{"node_id": 20366461, "posts": [{"tags": ["English", "snow", "blog", "educator", "education", "teacher"], "text": "<h2>And So it Begins&#8230;</h2>\n<p>It is snowing outside.</p>\n<p>In fact, I have been snowed in for the past four days.  The streets are a solid sheet of ice, and schools across the area have been closed due to the inclement weather.  Hence the birth of this blog.</p>\n<p>I am a middle school teacher.  English, to be precise.  Precise enough to know that this sentence and the former are incomplete sentences.  It is okay to break the rules, if you know them.</p>\n<p>That is the problem.  I teach middle school English, and no one knows what an incomplete sentence is, not to mention a run-on.</p>\n<p>This is my fifth year of teaching, and I have seen the education system for what it is, both good and bad.  This blog is dedicated to all the educators out there who share my  pain.</p>\n", "post_id": 1, "location": false, "date": "02-05-2011", "mentions": [], "extracted_features": {}}, {"tags": ["middle school", "grammar", "colon", "educator", "teaching", "education", "teacher"], "text": "<p>People often ask me what I actually teach in my middle school English class besides how to recognize sarcasm, so I thought I&#8217;d start an occasional grammar challenge/lesson for all you fantastic readers out there based on what I am currently teaching my students.</p>\n<h3>The Punctuation Mark, Not The Body Part</h3>\n<p>Here&#8217;s this week&#8217;s question for you:  in which ways may a colon be used?*</p>\n<p>Post a comment with your answers, and next week I will reveal the answers.  The winner(s) with the most correct answers will receive mad props and a proverbial fist bump.  Game on!</p>\n<p>*Hint: there are five main ways to use a colon.</p>\n", "post_id": 100, "location": false, "date": "04-08-2011", "mentions": [], "extracted_features": {}}, {"tags": ["school", "education", "middle school", "educator", "colon", "English", "teaching", "confessions", "teacher"], "text": "<p>A big thanks to all my readers who posted their answers to the question: &#8220;In which ways may a colon be used?&#8221;</p>\n<p>Everyone who posted had at least one correct answer, but the winner of this round goes to Becca Gresko who had four correct answers.  Mad props and a fist bump to you, madam!</p>\n<h3>Here are five main ways to use a colon:</h3>\n<p><strong>1.  Use a colon to emphasize or expand on a statement in a sentence.  This includes giving special attention to a piece of information or introducing a list. </strong></p>\n<p>Ex.  I finally decided on a name for my new puppy: Grizzly.</p>\n<p>Ex. When I went to the zoo last week, I saw all of my favorite animals: lions, tigers, and bears.  Oh My!</p>\n<p><strong>2.  Use a colon in the salutation of a business letter.</strong></p>\n<p>Ex. Dear Attorney Bob Loblaw:</p>\n<p><strong>3.  Use a colon to separate the hour and minute when using numerals to show time.</strong></p>\n<p>Ex. I woke up this morning at 6:00 a.m.</p>\n<p>4<strong>.  Use a colon to separate the title from a subtitle in a book.</strong></p>\n<p>Ex. <em>Diary of a Wimpy Kid: Dog Days</em></p>\n<p><strong>5.  Use a colon to separate the chapter and verse when referencing a religious text</strong>.</p>\n<p>Ex.  <a href=\"http://www.biblegateway.com/passage/?search=exodus%2020:12&amp;version=NIV\">Exodus 20:12</a> or <a href=\"http://www.biblegateway.com/passage/?search=deut%2021:18-21&amp;version=NIV\">Deuteronomy 21:18-21</a></p>\n<p>(My two favorite scriptures to use as examples in class.)</p>\n<h4>That&#8217;s Not All, Folks</h4>\n<p>Of course, the colon is a fairly flexible punctuative writing organ, so there are other acceptable uses as well, such as:</p>\n<p><strong>Introducing a quote in reference</strong></p>\n<p>Ex.  It was Mahatma Ghandi who said: &#8220;You must be the change you wish to see in the world.&#8221;</p>\n<p><strong>Writing ratios in mathematics, science, and music notation</strong></p>\n<p>1:5 (one out of five)<br />\n4:4 (four four time)</p>\n<p>Thanks for reading this installment of: &#8220;Are You Smarter Than a Sixth Grader?&#8221;</p>\n", "post_id": 104, "location": false, "date": "04-12-2011", "mentions": [], "extracted_features": {}}, {"tags": ["gramar", "snow", "educator", "spelling", "education", "teacher"], "text": "<h2>Snow Days</h2>\n<p>I live in one of the states in the southern U.S., which will for now go unnamed, but is wildly known for its dreadful fear of the cold, and especially frozen water.  Residents of this state are notoriously bad drivers in good weather conditions, and far worse when precipitation takes a turn for the colder.</p>\n<p>So there it was on Monday night, the news report of freezing rain and snowfall.  The district for which I worked closed schools before the bad weather even hit.  Now, if I were in the northern U.S., it would have been a typical winter week, but we just can&#8217;t resist a good snow day, or four.  The snow came, and the city shut down.</p>\n<p>Most people stayed indoors, peering out their windows wondering when this would all end.  They started calling it the &#8220;snowpocalypse&#8221;.  I was one of the braver ones who gets stir crazy and had to get out of the house each day.  It was entertaining seeing cars play slip-n-slide all over the roads.  I didn&#8217;t go out once without seeing a car spin out of control and hit something.  Suckers.</p>\n<h2>A-  Teacher</h2>\n<p>I&#8217;m sure all the kids were glad that we had four full days off of school, and I was, too, at first.</p>\n<p>See, I&#8217;m an A minus teacher.  I work pretty hard at getting kids to learn how to write with correct grammar and spelling, and I know all too well that for every day away from school, students lose three days of knowledge.  That&#8217;s why teachers rarely give quizzes on Mondays—it&#8217;s a recipe for disaster.</p>\n<p>So now, here I am on a Sunday night, wondering how I am going to jar my students&#8217; memories from a near week off of school.  I am fairly certain that some of them have forgotten their own names by now.</p>\n<p>Just kidding, sorta.  I do have a student (this is middle school, mind you) that cannot spell his own name.  I&#8217;ll give him some credit, though.  He works hard and always gets the first two letters correct.  Then he fills in the rest with random vowels and symbols that vaguely resemble some sort of alphabet.</p>\n<p>He isn&#8217;t the one I&#8217;m worried about.  I worry about the kid who couldn&#8217;t remember his own birthday.  I&#8217;ll say though, he does predict bad weather with eery accuracy.  He came in last Monday first thing in the morning and said, &#8220;Did you hear?  There&#8217;s not gonna be school tomorrow.  It&#8217;s gonna snow.  I hope it snows all week.&#8221;</p>\n<p>Well done, young weatherman.</p>\n", "post_id": 11, "location": false, "date": "02-07-2011", "mentions": [], "extracted_features": {}}, {"tags": ["school", "education", "middle school", "educator"], "text": "<p>It&#8217;s that time of year again.  Time to put away the margarita glasses, switch out the flip flops for Sperrys, and dust off the briefcase.  The school year is now in session.</p>\n<p>I have to admit, I was unprepared for this school year.  Yes, this is my 6th year of teaching middle school, but the summer ended in sort of a mental haze for me.  I sat through a swirl of meetings throughout last week, drifting along like a leaf in a pond.  I awoke at 6 a.m. on the first day of school, unsure whether walking into the classroom was really happening in a couple of hours.</p>\n<p>The first day of school wasn&#8217;t too bad, though.  I introduced 150 young students to the school and got them through the day.  Now, if I can get my head in the game, I&#8217;ll get through the next few days, too.</p>\n", "post_id": 140, "location": false, "date": "08-24-2011", "mentions": [], "extracted_features": {}}, {"tags": ["job security", "hug", "middle school", "high five", "English", "teaching", "education", "teacher"], "text": "<p>Teachers have to be careful.  Sometimes detrimentally so.</p>\n<p>At the beginning of the school year, there is inevitably a swarm of past-year students who want to come by the classroom to say hello.  They&#8217;ve forgotten about the homework, the detentions, and the long assignments that made them roll their eyes at me.  Now they love me.</p>\n<p>Seeing me as a fatherly figure (and unfortunately the closest thing to a father for many), they squeal my name and run up to me to give me a hug.  I quickly throw up my hand and enthusiastically say, &#8220;Teachers high five!&#8221; and avert the the attempted hug attacks with epic high fives.  Job security.</p>\n<p>Now, I&#8217;m not being paranoid to say that a male teacher has to be careful about those things.  It only takes one false accusation to ruin a man&#8217;s career and put him on the kind of list that parents check when finding a home in a new neighborhood.</p>\n<p>The other day, one of my new students was telling me during class about how her grandmother passed away a couple of weeks ago.  She began tearing up, and I was doing my best to console her.  I listened to her and watched her cry, and related by telling her how I lost a friend this summer also.  Then she went in for the hug, but I instinctively put my hand up and said, &#8220;Teachers high five?&#8221;</p>\n<p>I felt awful.  All this poor child needed was a hug.  But in the name of job security, I gave a paltry gesture of consolation.  I might be saving my job, but I feel like I am losing my soul.</p>\n", "post_id": 143, "location": false, "date": "09-01-2011", "mentions": [], "extracted_features": {}}, {"tags": ["school", "Kanye West", "middle school", "educator", "Ye", "teacher", "cursing", "Otis", "bitch", "Kanye", "Yeezy", "teaching", "education", "cursive"], "text": "<p>Ladies and gentlemen, today&#8217;s post is on everyone&#8217;s favorite topics: culture, cursing, and cursive.  Ok, maybe not cursive.</p>\n<h2>Sophisticated Ignorance</h2>\n<p>In a sixth grader&#8217;s mind, the moment he steps out of school, the teacher ceases to exist.  That&#8217;s why they are so surprised to see us in the supermarket.  <em>You eat?</em> they think to themselves.  What&#8217;s more surprising is to find out that a teacher has a life.</p>\n<p>A little over a week ago on a Friday afternoon a student asked me what I do on the weekend:</p>\n<p>&#8220;Well, at about 3:45, I&#8217;m getting in my car, driving to Austin, and seeing Kanye tonight.&#8221;</p>\n<p>&#8220;Wait, you listen to Kanye?&#8221; said another student, shocked.</p>\n<p>&#8220;Yeah.  I&#8217;m gonna see Ye tonight at ACL.&#8221;</p>\n<p><em>Boom.  Minds just blew.  </em></p>\n<h2>I Write My Curses</h2>\n<p>One thing I love about middle school is cussing—it&#8217;s hilarious.  The kids are old enough to know what all the run-of-the-mill cuss words are, but they are young enough that when they use them it&#8217;s like a toddler shooting a 12 gauge.  For one, they don&#8217;t know how to spell them.  I see things like &#8220;die fucer&#8221; and &#8220;stupid bich&#8221; written on the bathroom walls.  And when they hear it from a teacher, it knocks them back.</p>\n<p>Now, I don&#8217;t make it a habit to curse in front of my kids.  I don&#8217;t really curse that much anyway.  There have been a few times when I&#8217;ve almost dropped a bomb, like the time I said, &#8220;What the fuu&#8211;art fig newton&#8221; or the time I mouthed, &#8220;Oh sh*t&#8221; in front of the deaf student who could read lips (I could tell from her smirk that she caught it).  But the best is when they hear it for real.</p>\n<p>Today I nonchalantly took up a note from two girls in one of my classes as I walked by.  I placed it on my desk and kept teaching without skipping a beat.  At the end of class, I called the two girls up to my desk, opened the note, and read it aloud:</p>\n<p>&#8220;What are you doing?&#8221;</p>\n<p>&#8220;Nothing <em>bitch</em>,&#8221; I read with emphasis.</p>\n<p>The two girls were mortified to hear their note read out loud, blushing and turning their eyes to the ground.  And that is what makes it fun.</p>\n<h2>In Cursive</h2>\n<p>The district in which I teach requires that students learn cursive in second and third grade, and then—nothing.  By the time they reach sixth grade, there is only a faint memory of those swirling looping letters from primary school that most all of the english speaking world used in written language (not to mention cursive exists in other languages as well).  In fact, block-letter print wasn&#8217;t taught widely in schools until the 1920s.  Now our kids can&#8217;t even write their own names in cursive.</p>\n<p>So my counterpart and I decided to revive the lost art and set it upon ourselves to teach it.  We&#8217;re teaching <a title=\"D'Nealian Script\" href=\"http://en.wikipedia.org/wiki/File:Cursive.svg\">D&#8217;Nealian</a> script because it&#8217;s a pretty easy script to teach students who are used to print.  You might remember that old school stuff from your sweet 3rd grade teacher.  Or probably not.  In any case, we make our students write their warm-ups in cursive.  They moan and complain, but when they&#8217;re done they show their writing to me and ask what I think.</p>\n<p>I guess we got our swagger back, truth.</p>\n<h2></h2>\n", "post_id": 148, "location": false, "date": "09-27-2011", "mentions": [], "extracted_features": {}}, {"tags": ["laughing", "crying", "educator", "teaching", "education", "teacher"], "text": "<p>Yesterday I sent a student to the nurse for a very unique reason: laughter.</p>\n<p>One of my students came into class yesterday laughing so hard that he was crying.  Something that a teacher said in another class somehow hit his funny bone.  He couldn&#8217;t stop laughing, so I sent him to get a drink of water.  Still crying and laughing.  I told him to walk around for a while and get it out of his system.  He came back a few minutes later, his face red and tears streaming down his face.  He was laughing so hard that he couldn&#8217;t breathe.</p>\n<p>I sent him to the nurse with with the special nurse&#8217;s pass.  For the reason I had to check &#8220;other: laughing&#8221;.  He didn&#8217;t come back for the rest of class.</p>\n<p>Today I asked him about it, and he said that he was laughing so hard that he couldn&#8217;t breath and almost had to go to the E.R.  I think that&#8217;s worth a day out of class.</p>\n<p>&nbsp;</p>\n<p>On another note: I am going on a media fast for the month of October.  I&#8217;ll see you guys in November.</p>\n<p>&nbsp;</p>\n", "post_id": 155, "location": false, "date": "09-30-2011", "mentions": [], "extracted_features": {}}, {"tags": ["middle school", "teacher", "educator", "teaching", "education", "tripping"], "text": "<p>It&#8217;s good to be back.</p>\n<p>Yesterday a student tripped me, or almost tripped me, I should say.  I was talking to a couple of my students in the hallway, and another student was behind me.  When I turned around to walk away, there was her leg stuck out in front of me.  I stumbled over it, but I caught myself.  I turned back around, pissed.  I glared at the student, who had moved back against the wall.  I sharply spat out, &#8220;______.  I don&#8217;t even know what to say.&#8221; [Dramatic pause] &#8220;Get out of here.  <em>Now</em>.&#8221;</p>\n<p>She bolted down the hallway as fast as she could, terrified.</p>\n<p>Today, I pondered how I was going to handle the situation. This girl was becoming a pain the class anyway, so I was going to have to address it decisively.  And I felt like giving her a good scare.</p>\n<p>During class, I simply went over to her and said, &#8220;After school, you are going to come straight to my classroom.  I need to decide your punishment.&#8221;  This is the classic tension builder.  She was going to have to spend the rest of the school day worrying about what punitive measures await.</p>\n<p>The next step was to not be there immediately after school.  I chatted with some teachers for about five minutes, and then swung back by the room where she was waiting outside my door.  I ushered her into the classroom and told her to take a seat, and I sat at my desk in silence for a whole minute, looking deep in thought.</p>\n<p>Then the finale: laying out the possible consequences in order from greatest to least.</p>\n<p>&#8220;Your punishment,&#8221; I started, &#8220;is wholly dependent on how I perceive your intentions.  If I believe you tripped me intentionally, that&#8217;s assault.  I can press charges and you&#8217;ll never go to this school again.  Or I can write up an office referral, and you&#8217;ll be suspended.  If I believe you tripped my on accident or from a poor attempt at being funny, then the consequence may be less.  So, what should I believe?&#8221;</p>\n<p>&#8220;Well, sometimes when I stand, I stand like this,&#8221; she replied, standing up with one leg out.</p>\n<p>Now, I can read a middle schooler&#8217;s face like a first grade book of sight words.  She was obviously trying to cover.  I looked at her, eyebrows raised.</p>\n<p>&#8220;No, I&#8217;m not buying it.  This is English class, so let&#8217;s revise that story.&#8221;</p>\n<p>Her eyes welled up with tears.  &#8220;I didn&#8217;t mean to.  I was just trying to be funny.  I was going to move my foot away before you turned around.  I didn&#8217;t think you would trip.&#8221;</p>\n<p>And that&#8217;s where I brought it back down to earth.  I told her that her punishment was to write a page explaining why that was a terribly stupid decision, complete with an apology.  I hope I wasn&#8217;t too much of a jerk, but that girl be trippin&#8217;.</p>\n", "post_id": 157, "location": false, "date": "11-03-2011", "mentions": [], "extracted_features": {}}, {"tags": ["education", "music", "Nickelback", "educator"], "text": "<p>Today I had my students writing poetry.  In part of the poem they had to mention or incorporate a favorite song of theirs.  I should have known this was a bad idea.</p>\n<h3>Stripper love</h3>\n<p>In my second class of the day, one of my students loudly yelled, &#8220;I&#8217;m in love with a stripper!&#8221;  I promptly sent him outside for a talk.</p>\n<p>I asked with some confusion, &#8220;Why exactly did you just yell out, &#8216;I&#8217;m in love with a stripper!&#8217;?&#8221;</p>\n<p>He replied, &#8220;That&#8217;s my song.  I like that song.&#8221;</p>\n<p>&#8220;Do you think that&#8217;s appropriate to yell out in class?&#8221;</p>\n<p>&#8220;No.&#8221;</p>\n<p>&#8220;Oh.  Then why did you yell that out?  Was it to get attention or because you thought it would be funny to your classmates?&#8221;</p>\n<p>&#8220;No.  I just like that song.  I was listening to it this morning.&#8221;</p>\n<p>&#8220;So you&#8217;re not trying to get attention.  I see.&#8221;</p>\n<p>Right&#8230;</p>\n<h3>Do You Know What That Means?</h3>\n<p>In a later class, one of my students was very proud to show me his poem, newly printed on his notebook paper.  I start reading through the lines.</p>\n<p>&#8220;What is this word?  Can you say it out loud for me?&#8221;</p>\n<p>&#8220;[Gonorrhea].&#8221;</p>\n<p>&#8220;Do you know what gonorrhea means?&#8221;</p>\n<p>&#8220;I don&#8217;t know.  It&#8217;s a Lil&#8217; Wayne song.&#8221;</p>\n<p>Perfect teaching opportunity right here.  I proceeded to loudly explain so the whole class could hear, &#8220;Well, gonorrhea is an STD, a sexually transmitted disease.  It causes terrible burning sensations in the special parts of your body, where you don&#8217;t want that to happen.  Gonorrhea is really bad.&#8221;</p>\n<p>&#8220;Oh.&#8221;</p>\n<p>He sits down and erases his music choice.</p>\n<h3>Worst Band on the Earth</h3>\n<p>After school I had a couple of girls in detention for talking while they were supposed to be writing.  During their detention, they asked if I could put some music on.  I grinned and asked what they want to listen to.  They both said that they <em>love</em> metal.  I asked which metal bands they liked.  They gave me the names of some random metal bands, when I had to ask them, &#8220;Do you both like Nickelback?&#8221;</p>\n<p>&#8220;Yes, I <em>love</em> them!&#8221; they shouted together.</p>\n<p>&#8220;Well, too bad.  They are the worst band on the planet.  There are toddlers learning to play the pan flute somewhere in Malaysia that are better than Nickelback.  But let me see what I do have.&#8221;</p>\n<p>I smiled and proceeded to put on an Afro-beat station and play it as loudly as possible for the duration of their detention.</p>\n", "post_id": 16, "location": false, "date": "02-08-2011", "mentions": [], "extracted_features": {}}, {"tags": ["middle school", "learning", "educator", "teaching", "education", "teacher"], "text": "<h1>Welcome back to Confessions of a Middle School English Teacher!</h1>\n<p>I know what you&#8217;re thinking, and no, I did not die.  Last year was wrought with personal issues, from a cancer scare to a bout of depression to the start of a new novel, so I let the blog lay fallow.</p>\n<p>But today is the start of a new school year, and and a new blog entry. First, I must say that despite a rough personal life last year, last year&#8217;s students were the best I&#8217;ve ever had.  I told my kids on the last day of school that I was going to miss them&#8211;and I meant it.  I really was blessed to have them.</p>\n<h1>Roster-farian</h1>\n<p>I have 170 students on my roster for this year.  Needless to say, I was praying for families to move away.  There is nothing to be done about the numbers; until another school is built, we just have to keep adding desks and squeezing them in.  The problem, though, is that there is no way to fit these kids into my <a href=\"http://en.wikipedia.org/wiki/Dunbar's_number\">monkey sphere</a>.  The sheer number of kids makes it hard to remember names and form relationships.  My biggest class&#8211;32.</p>\n<h1>Hello Ms. __________, I&#8217;m calling from&#8230;</h1>\n<p>You know it&#8217;s going to be rough when you have to make a parent phone call on the first day of school.  I already had a student that was having behavior issues (A.K.A. being a little shit).  I mean, normally they at least test the waters for a couple of days before acting up.  Oh, but not today.  I had a child tell me he wanted to learn how to rob a bank and interrupted the class several times with loud and obnoxious behavior.  Let&#8217;s just say we&#8217;re going to have problems, he and I.</p>\n<p>Well, here&#8217;s to another school year full of antics and (hopefully) plenty of learning.  Oh, and if you know any teachers, say a little prayer for them.  They&#8217;ll need it.</p>\n", "post_id": 165, "location": false, "date": "08-27-2012", "mentions": [], "extracted_features": {}}, {"tags": ["mnemonic", "research", "tattoo gun", "educator", "education", "teacher"], "text": "<h3>Memento</h3>\n<p>Last week my students had a research report due, worth a major grade.  I have done everything I can think of to get kids to finish and turn in their projects, to no avail.  Here&#8217;s a short list of things I&#8217;ve tried with them:</p>\n<ul>\n<li>students wrote in their school agendas</li>\n<li>assignment written on the whiteboard</li>\n<li>said as many times as possible in class, to particular students, making eye contact</li>\n<li>made said students repeat the due date to me multiple times</li>\n<li>posted requirements, links, and how-tos on the school website</li>\n<li>put sticky notes on binders</li>\n<li>used conference/event style wristbands with directions written on them</li>\n<li>made students call their parents in front of me</li>\n</ul>\n<p>Naturally, I figured there was <em>no</em> way a student could forget to finish his or her presentation now.</p>\n<p>Today I began asking students about missing presentations.  In every one of my classes today, I was met with blank stares and students saying, &#8220;what project?&#8221;</p>\n<p>Sigh.</p>\n<p style=\"text-align:center;\">♦♦♦</p>\n<p>I told myself I was never going to do this, but I think it&#8217;s time.</p>\n<p>I am buying a tattoo gun.</p>\n", "post_id": 18, "location": false, "date": "02-11-2011", "mentions": [], "extracted_features": {}}, {"tags": ["school", "middle school", "open house", "educator", "teaching", "summer solstice", "education", "teacher"], "text": "<p>This evening when I got home, my legs were so sore I could barely walk across the room.  I thought to myself, &#8220;Why do my legs hurt so?  I haven&#8217;t gone running in days&#8230;wait, no.  That was this morning; it&#8217;s only felt like days.  Why?  Today was Open House.&#8221;</p>\n<p>J&#8217;explique.</p>\n<h3>The following is an excerpt from <em>World Book Erroneous</em>:</h3>\n<p><em>    &#8220;There is a long established and erroneous belief held by many that the longest day of the year, known as the summer solstice, takes place  around June 20/21.  This is actually not true.  While that day may provide the most amount of visible light of any day in the year, the real summer solstice always takes place in September, and is more variable in date.  </em></p>\n<p><em>    See, the longest day of the year is known by all teachers and is commonly referred to as &#8220;Open House&#8221;.  On that day each year, teachers open their classroom doors at 7:30 am or earlier, teach all day long, and then stay through the evening to meet parents, answer questions, and placate the general population of soon-to-be educated youth.  This lasts roughly until 9:00 pm when families slowly leave the building and fade over the horizon, making it the actual longest work day of the year at roughly thirteen and a half hours.&#8221;</em></p>\n", "post_id": 187, "location": false, "date": "09-05-2012", "mentions": [], "extracted_features": {}}, {"tags": ["middle school", "thesaurus", "Tyrannosaurus", "educator", "teaching", "education", "teacher"], "text": "<p>On the second day of school I had students create alliterative name tents for themselves in a vain attempt to learn their names.  Each child made his or her own silly name such as Jalapeño Jaime or Athletic Alex or whatnot, and designed it on a tri-folded sheet of manila paper.  One student, a young blonde girl, walked up to me to ask me a question.</p>\n<p>&#8220;[A+ Teacher], do you know what a Tyrannosaurus is?&#8221;</p>\n<p>Perplexed and intrigued, I tilted my head and furled my brow.</p>\n<p>&#8220;Um, yes&#8230;&#8221;</p>\n<p>&#8220;Do you have one?&#8221;</p>\n<p>&#8220;Yes, I have a pet Tyrannosaurus in my backyard,&#8221; I replied jokingly, assuming she was being silly.</p>\n<p>She shot me a doubly perplexed look.</p>\n<p>&#8220;I&#8217;m pretty sure they&#8217;ve been extinct for a very long time,&#8221; I added frankly.</p>\n<p>She paused, visibly confused, and said, &#8220;Uh, you know, a Tyrannosaurus.  You look use it to look up words&#8230;&#8221;</p>\n<p>Bing! Enter lightbulb over the head.</p>\n<p>&#8220;Oh!  You mean a Thesaurus.  They&#8217;re over there,&#8221; I pointed to the shelf lined with little yellow thesauri.</p>\n<p>&#8220;Great, thanks!&#8221; she replied and bounced off toward the bookshelf unaware of just how hard I had to control myself to not collapse in laughter.</p>\n", "post_id": 200, "location": false, "date": "09-12-2012", "mentions": [], "extracted_features": {}}, {"tags": ["educate", "love", "wife", "students", "single", "marriage", "teaching", "educator", "middle school", "dating", "teacher"], "text": "<p>I am an English teacher, and I am single.  That comes with come some perks and some drawbacks.  Just kidding, there are no perks.</p>\n<p>Too busy to date, buried under stacks of terrible student essays, my social life constantly on life support.  But&#8230;</p>\n<h3>Inquiring Minds Want to Know</h3>\n<p>In every class there are a handful of students that take an interest in their teachers&#8217; personal lives.  Now, most students are entirely engulfed in their own myopic middle school world unable to imagine that teachers exist outside of the confines of the school building, but the ones that aren&#8217;t&#8211;relentless meddlers all the way.  They barrage their teachers with thousands of questions from silly to serious.</p>\n<blockquote><p>&#8220;How old are you?&#8221;</p>\n<p>&#8220;Do you sleep at the school?&#8221;</p>\n<p>&#8220;Do you like dogs?&#8221;</p>\n<p>&#8220;Are you married?&#8221;</p></blockquote>\n<p>The last question is the one that triggered the latest endeavor by two of my students.</p>\n<h3>The Bachelor</h3>\n<p>&#8220;Mr. ________, we need to get you married,&#8221; declared the sweet freckled girl last Friday afternoon in class.</p>\n<p>&#8220;Oh? Is that so?&#8221; I replied, eyebrows raised, holding back a chuckle while passing out graded papers.</p>\n<p>&#8220;Yes,&#8221; added the dark-haired girl with her dark trendy glasses and One Direction suspenders on.  &#8220;You&#8217;re not getting any younger, you know.&#8221;</p>\n<p>Great, first my mother, now my students lecturing me on finding a spouse.</p>\n<p>They continued.</p>\n<p>&#8220;Be honest, when was the last time you took a girl on a date?&#8221; asked the concerned freckled brunette.</p>\n<p>I had to think about that.  For some time.</p>\n<p>&#8220;Oh gosh.  May? June?&#8221;</p>\n<p>(In full disclosure, I&#8217;m not even sure that the girl referenced thought it was a date, but I had to come up with something.)</p>\n<p>&#8220;Wanna see a picture?&#8221; I offered to legitimize my answer.  They both nodded excitedly.  I pulled the girl up on Facebook and showed them.</p>\n<p>&#8220;Mr. _________,&#8221; they both squealed, &#8220;She&#8217;s gorgeous! You missed out!&#8221;</p>\n<p>&#8220;Seriously,&#8221; I agreed.</p>\n<p>&#8220;What happened there?&#8221; asked the dark haired girl.</p>\n<p>&#8220;Oh, don&#8217;t get me started,&#8221; I sighed.</p>\n<p>&#8220;Well, we&#8217;re going to find you a wife,&#8221; freckles declared confidently. &#8220;What&#8217;s your type?&#8221;</p>\n<p>This is the part where a sane person would have just walked away.  Too late.  Not me.</p>\n<p>&#8220;I&#8217;m into strong, independent, ambitious women.  And she has to love Jesus.&#8221;</p>\n<p>&#8220;Great! I&#8217;ll start thinking about ladies at my church.&#8221;</p>\n<p>&#8220;Does it matter whether or not she has kids?&#8221; posed the dark haired girl.</p>\n<p>&#8220;No, that&#8217;s fine.  I love kids.&#8221; Immediately I regretted saying that. Is her mom single? Oh geez, she&#8217;s probably thinking of her mom.</p>\n<p>&#8220;What&#8217;s your age range?&#8221;</p>\n<p>&#8220;Mid twenties to mid thirties.&#8221;</p>\n<p>The bell rang to dismiss class.</p>\n<p>&#8220;Uh Oh, Mr. _______, dating the older ladies!&#8221; freckles joked.</p>\n<p>&#8220;I&#8217;m not getting any younger,&#8221; I reminded her.</p>\n<p>&#8220;Alright.  I think we have enough.  Don&#8217;t worry, we&#8217;ll find you a wife,&#8221; they concluded, running out of the room ecstatic at their new mission to find me a woman.</p>\n", "post_id": 203, "location": false, "date": "10-17-2012", "mentions": [], "extracted_features": {}}, {"tags": ["middle school", "computer", "educator", "teaching", "education", "technology", "teacher"], "text": "<h3>First, an update from my previous entry:</h3>\n<p>My friendly freckled student and came to me today and told me, &#8220;I think I have someone for you.&#8221;</p>\n<p>&#8220;Oh yeah?&#8221; I replied.</p>\n<p>&#8220;Yeah, but I think she&#8217;s forty.&#8221;</p>\n<h3>Tech know? or Tech No?</h3>\n<p>&#8220;Next year when I begin talking about this project and how fun it is because I&#8217;ve forgotten, will you tell me &#8216;never again&#8217;?&#8221;</p>\n<p>&#8220;What?&#8221; my cohort responded.</p>\n<p>&#8220;You heard me.  In fact, when I suggest it for next year, punch me in the face.&#8221;</p>\n<p>That was the conversation that took place after school today, due to the poor decision I made to have my sixth graders use computers to make a project &#8220;fun&#8221;.  </p>\n<p>The problem is that sixth graders know nothing about computers.  Now, you might think to yourself that these kids have grown up with computers.  They&#8217;ve never known a world without the internet; they&#8217;re the iPod/Pad/Phone generation and whatnot.  But friends, here&#8217;s the truth: they don&#8217;t have a clue about actual, real life computers. Yes they play games on iPhones.  They can work a wii or pound a playstation with their eyes closed.  However, they cannot double-click.  </p>\n<p>Having these students in the lab is a hair-greying experience.  These kids can&#8217;t remember their passwords, have never seen the &#8220;save&#8221; icon, or know what a right-click means.  I have literally had to walk students click by click through every facet of every instruction.  I can&#8217;t give a command such as &#8220;save your work&#8221; because they have no idea what to do.  </p>\n<p>They get frustrated.  I get frustrated.  Their final products will suck, and I will have to watch them all.  </p>\n<p>Oh well.  Click &#8220;Publish Post&#8221;.</p>\n<p> </p>\n", "post_id": 279, "location": false, "date": "10-24-2012", "mentions": [], "extracted_features": {}}, {"tags": ["middle school", "beer", "educator", "teaching", "education", "teacher"], "text": "<p>When wearing the same sports coat to school as the one you were wearing at last weekend&#8217;s late night party, remove bottle caps from pocket prior to the school day.  </p>\n<p><a href=\"http://aminusteacher.files.wordpress.com/2012/11/evernote-camera-roll-20121106-165517.jpg\"><img id=\"i-280\" class=\"size-full wp-image\" alt=\"Image\" src=\"https://aminusteacher.files.wordpress.com/2012/11/evernote-camera-roll-20121106-165517.jpg?w=580\" /></a></p>\n", "post_id": 281, "location": false, "date": "11-07-2012", "mentions": [], "extracted_features": {}}, {"tags": ["Independent", "Republican", "middle school", "USA", "Romney", "Democrat", "election", "educator", "America", "teaching", "education", "teacher", "Obama"], "text": "<h3>Teacher Debates</h3>\n<p>Tensions were high in our daily team meetings the last several days, mostly due to the election.  My team is a volatile mix of right-wing conservatives, moderates, left-wing liberals, and indifferent independents such as myself.  You might as well throw a grenade in the room as start talking politics in school.  In the last week there have been fierce debates about health care, taxes, marijuana, and surprisingly, road improvement.  As funny as it is to hear a group of teachers debating the pros and cons of smoking ganja, when I posed the question of the legality of voter ID laws, I might as well have pulled the pin and walked away.  Explosive.</p>\n<h3>What Teachers Do on Election Night</h3>\n<p>All across America on election night, teachers were glued to their TV sets to find out whether the world will be plunged into a <span style=\"color:#0000ff;\"><a href=\"http://www.youtube.com/watch?v=7ud3pK5Wa90\"><span style=\"color:#0000ff;\">thousand years of darkness</span></a></span> or whether their side will be found victorious to fix America within the next four years.   But mostly, we drank.</p>\n<p>Some of us gathered with friends and sipped champagne while watching the states being called by some perfectly manicured pundit; others played drinking games, taking a shot for every state won by whatever party (which judging from some of the hangovers the next day is not a great idea).  Either way, we teachers drank to knowing that whoever wins, education will remain a mess for the next four years.</p>\n<h3 style=\"text-align:center;\">Student Elections</h3>\n<p>At our own middle school, there were three elections this week of our own to celebrate the democratic process: the school mock election, the student council election, and an after school club election—all very presidential.</p>\n<h4>The Mock Election</h4>\n<p>Our school&#8217;s mock election was actually pretty B.A.  One of the social studies teachers went through the trouble of setting up a very realistic electoral format in which the students had to register to vote, were issued voter registration cards, had precincts, an electoral college, and stood in long lines to cast their votes on election day.</p>\n<p>Now, even though I live in a very red state, I teach in a a neighborhood that is blue collar, heavily hispanic, and hungry for opportunities to live and work in the future.  Unsurprisingly, the students elected Barack Obama in a landslide 80% of the popular vote and overwhelming majority in the electoral college.</p>\n<p>I&#8217;ll tell you this: these students (many of whom will never get to vote) have a better understanding of our political system than a great deal of U.S. citizen voters.</p>\n<h4>Student Council Elections</h4>\n<p>There were two candidates in the school&#8217;s student council elections this week as well (we&#8217;ll never get past a two party system, will we?).  One—an African-American girl.  The other—a Hispanic boy; both of them—eighth graders who are involved and well respected by students and staff alike.</p>\n<p>It was a tight race.  There were posters, promises, and political savvy.  The boy won by a narrow margin, pledging to bring our school a mascot for sports games.</p>\n<p>There were, however, three write-in votes for <span style=\"color:#0000ff;\"><a href=\"http://www.imdb.com/name/nm0708293/\"><span style=\"color:#0000ff;\">Pedro</span></a></span>.</p>\n<h4>Club Elections</h4>\n<p>As a co-sponsor for Amnesty International, we held our elections this week for president and vice president.  There were quite a few candidates, and they each had to write a speech.</p>\n<p>The vice presidential candidates brought the best and worst speeches I&#8217;ve ever heard by a young person:</p>\n<p>The first was by a young lady who obviously took the speech writing lesson I previously gave to heart.  It was personal, inspiring, and powerful.  She even included some style from <span style=\"color:#0000ff;\"><a href=\"http://www.ted.com/talks/nancy_duarte_the_secret_structure_of_great_talks.html\"><span style=\"color:#0000ff;\">Nancy Duarte</span></a></span>.  It really blew everyone away, and had she run for president, she may have won.</p>\n<p>The second speech was by a young lady who decided she would &#8220;wing it&#8221;.  Bad, bad, bad idea.  She started off okay talking about how she liked helping people, but somehow she quickly degraded into a completely neurotic, self-destructive word vomit wherein she pledged, among other things, to mostly stop lying and stealing unlike her good-for-nothing brother.  It was like watching a <span style=\"color:#3366ff;\"><span style=\"color:#0000ff;\"><span style=\"color:#0000ff;\"><span style=\"color:#3366ff;\"><a href=\"http://www.youtube.com/watch?v=HfHRLzWDhXc\"><span style=\"color:#3366ff;\">train wreck</span></a> </span><span style=\"color:#333333;\">in slow motion.  Still, she was brave.  Or crazy.</span></span></span><br />\n</span></p>\n<p>The presidential speeches were somewhat more leveled:</p>\n<ul>\n<li>The first speech was by a girl who basically told people to vote for her because she was &#8220;awesome&#8221;.  (the popular vote)</li>\n<li>The second girl invited a vote because she never missed meetings and was dependable. (the moderate vote)</li>\n<li>The third (my favored candidate) wrote a well-written and moving speech that equalled the vice presidential speech about the need for us to fight valiantly for the rights of the oppressed and call our fellow schoolmates to join in this endeavor. (the MLK vote)</li>\n<li>The fourth girl simply promised that if they voted for her that she would bring cookies, snacks, and donuts to each meeting.</li>\n</ul>\n<p>Of course the fourth girl won.  She had learned the true power of politics&#8211;empty promises.</p>\n", "post_id": 283, "location": false, "date": "11-08-2012", "mentions": [], "extracted_features": {}}, {"tags": ["school", "middle school", "educator", "detention", "teaching", "chicken dance", "education", "teacher"], "text": "<p>The other day I had quite a few students in detention.  I was pretty tired of their antics and decided to make detention more detention-y.  I asked them if they wanted to listen to some music.  They all said yes, so I played the <a href=\"http://www.youtube.com/watch?v=aWjeITmDmmo\">Chicken Dance</a>.  On repeat.</p>\n<p>The first time, they all liked it.  A few of them started doing the motions until I reminded them they were in detention.</p>\n<p>The second time, they laughed.  One of them remarked that it was a really long song.</p>\n<p>The third time, all their smiles dropped.  A look of dreadful realization grew across their faces.  I looked directly at them and flashed a classic <a href=\"http://images5.fanpop.com/image/answers/2731000/2731456_1337792180883.76res_189_266.jpg\">super villain grin</a>.</p>\n<p>And so it played.  For the next 30 minutes.*</p>\n<p>I sat and graded papers, joyfully whistling along while the students cringed in their seats until I signaled the end of detention, wherein they flew from their chairs out of my room and down the hallway&#8230;</p>\n<p>The next day in class, one of the students started to act out.  I turned to him and with the same evil grin, clucked my hands and flapped my arms.  Immediately, he stopped talking and sat up in his seat.</p>\n<p>&nbsp;</p>\n<p>&nbsp;</p>\n<p>*Although I constantly teach my students not to use sentence fragments, I secretly love to use them myself.  Mostly for effect.</p>\n", "post_id": 306, "location": false, "date": "12-21-2012", "mentions": [], "extracted_features": {}}, {"tags": ["teacher", "food", "candy", "sugar", "chocolate", "educator", "teaching", "education", "Christmas"], "text": "<p>I&#8217;m not a fan of sweets or apples&#8211;the two things that students constantly drop off at my desk that kids assume teachers love.  I don&#8217;t know why, but I&#8217;ve just never had much of a sweet tooth.  </p>\n<p>During the Christmas season, sugar-coated tidbits made by students&#8217; parents or (gulp) students themselves are loaded up on my desk every class period.  The setting quickly becomes a small mountain of candy canes, sugar cookies, and chocolate pretzels wrapped in red and green cellophane.  Honestly, it makes me a bit noxious.  </p>\n<p>I always accept and give a gracious thank-you to the student, but once the student turns away, I &#8220;share&#8221; the treats with other students.  I say, &#8220;Gosh, there is so much here, I can&#8217;t possibly eat all this myself!  Would anyone like some?&#8221; </p>\n<p>Immediately my desk is aswarm with little germy hands held out for a small bounty of cookies and caramel and whatnot.  I unload all the sugary treats on these kids, minus a bit of dark chocolate if it can be found.</p>\n<p>It&#8217;s a win-win situation.  The kids feel appreciated, and I don&#8217;t acquire diabetes.  </p>\n<p>Now, if you&#8217;ll please excuse me, I&#8217;m going to go eat some kale.  </p>\n", "post_id": 313, "location": false, "date": "12-22-2012", "mentions": [], "extracted_features": {}}, {"tags": ["education", "middle school", "research", "educator", "fail", "confessions"], "text": "<h3><span style=\"font-weight:normal;font-size:13px;\">My students spent a couple of weeks researching a global cause and creating a presentation using a web application called <a title=\"Glogster\" href=\"http://www.edu.glogster.com\" target=\"_blank\">glogster</a>.  It was spectacular.  The brackets are my notes.</span></h3>\n<p>Today I learned:</p>\n<ul>\n<li>250,000 polar bears die each year<span style=\"color:#c0c0c0;\"> [which means they go extinct ten times per year]</span></li>\n<li>Because global warming is killing all the polar bears, we can save them by helping them cool off</li>\n<li>polar bears are a spices of bear</li>\n<li>If there are too many landfills we will all suffocate and die</li>\n<li>&#8220;There are  925 Million Under MOurished People In The World That DEal  WIth  World Hunger!!!!!&#8221; <span style=\"color:#c0c0c0;\">[as opposed to other malnourished people who don't deal with hunger?]</span></li>\n<li>We celebrated <span style=\"color:#c0c0c0;\">[Thanksgiving]</span> all that we are thankful for by gorgng ourselves right into a food coma. It&#8217;s the traditional way. <span style=\"color:#c0c0c0;\">[Wait.  Actually, that's true]</span></li>\n<li>When trees are cut it increases the water quantity.</li>\n<li>&#8220;what are landfills gases? landfills gases is when people throw trash away more than a car weight.&#8221;</li>\n<li>Life began on the planet about 3,500 years ago</li>\n<li>Lions are endangered because of hunting.  We should catch all the tigers left and put them in zoos.  Or we can put up &#8220;No Hunting&#8221; signs.</li>\n</ul>\n", "post_id": 34, "location": false, "date": "02-12-2011", "mentions": [], "extracted_features": {}}, {"tags": ["school", "middle school", "student", "teacher", "public", "voucher", "learning", "fail", "teaching", "education", "debate"], "text": "<p>I posed a comment on FB this evening, and I would like to post it here as well as a question and get some feedback from you, the reader.  Please respond to the question below in the comments section:</p>\n<p>Is public education a failed experiment?  Why or why not?  </p>\n<p>Discuss.</p>\n", "post_id": 347, "location": false, "date": "01-16-2013", "mentions": [], "extracted_features": {}}, {"tags": ["iPad", "pencils", "school", "middle school", "lending", "Beats", "educator", "teaching", "education"], "text": "<p>One of the things that I encounter on a regular basis is students who do not bring any supplies to class.  Students constantly ask me for pencils and paper, because, after all, my students are poor.  I have a system worked out wherein a student can borrow a pencil or pen in exchange for their student ID.  That ensures that students don&#8217;t just jack my supplies of which I spend  many dollars each year.  </p>\n<p>The problem with this approach is twofold.  </p>\n<p>First, it teaches them the wrong thing.  It teaches them that they are not responsible for their own things, that someone else will always take care of them.  It&#8217;s called socialism, except they have nothing to give at the start.  They give nothing, but expect care in return.  </p>\n<p>The second problem is that they are not as poor as they say.  After the Christmas break, these same students came in with all sorts of bling: new expensive shoes and clothes, iPads, and Beats by Dre.  The real issue isn&#8217;t that they cannot afford school supplies, but that their parents spend money on expensive trinkets that they cannot afford. </p>\n<p>So what can I do to teach students personal responsibility?  What can I do to show them that they really can afford the two dollars that is needed?&#8211;</p>\n<p>Point at their new kicks and stop lending out pencils.</p>\n", "post_id": 354, "location": false, "date": "01-30-2013", "mentions": [], "extracted_features": {}}, {"tags": [], "text": "<p><em>Caution: This is a serious post.  Read at your own risk.</em></p>\n<p>This has been the week from hell.  On Monday, my superior called me into his office after school.  I already knew what he would say.  Too many of my kids were failing.</p>\n<p>This is where I have issues with education.  I have students who do not do their work.  In return, they have low grades, and as a result, I have to fix it.   God forbid that we hold students culpable for their own effort.  I was told these students had to pass, and I needed to do &#8220;whatever it takes&#8221; to get them passing.</p>\n<p>I spent half of the evening on that Valentine&#8217;s Day calling parents who had been called the previous Thursday to tell them that their children were failing.  Still.</p>\n<p>Then, I spent every school hour hunting down students.  I pulled them into my room in the morning; I pulled them out of electives; I pulled them out of lunch. I kept them after school.  I called parents again.  Rinse. Repeat.</p>\n<p>In the end, I have pulled about a 60 hour workweek (so far; today is Thursday) hunting down students who didn&#8217;t care whether or not they passed my class and calling parents who didn&#8217;t care whether or not their children passed my class.  Many of the parents I called were put off by the audacity that I would call them to tell them that their children were failing.</p>\n<p>Why?  So my administrators don&#8217;t look bad.  The results would have been the same if the students had failed.  They would go on regardless of their grades.  No student fails a grade from failing grades.  They aren&#8217;t held back even if they fail the standardized tests they take.  And they know it.  That is why they don&#8217;t do their best in the first place.  They know the system, and they call our bluffs every time.</p>\n<p>In the meantime, I haven&#8217;t slept on account of the stress.  I&#8217;ve totaled less sleep in a week than hours I&#8217;ve worked in a single day.</p>\n<p>Heart.  Palpitations.</p>\n<p>&#8220;I&#8217;m telling you baby,<br />\nYou know that only the good die young &#8230;&#8221;</p>\n", "post_id": 42, "location": false, "date": "02-18-2011", "mentions": [], "extracted_features": {}}, {"tags": ["star wars", "middle school", "failing", "detention", "lunch", "grades", "educator", "education", "darth vader"], "text": "<dd> </dd>\n<dd><a href=\"http://aminusteacher.files.wordpress.com/2011/03/apple2.jpg\"><img class=\"alignnone size-full wp-image-52\" title=\"apple2\" src=\"https://aminusteacher.files.wordpress.com/2011/03/apple2.jpg?w=221&#038;h=166\" alt=\"\" width=\"221\" height=\"166\" /></a></dd>\n<dd> </dd>\n<dd><span style=\"font-family:'Star Jedi Logo DoubleLine1';\"><span style=\"background-color:#ffffff;\"><span style=\"text-shadow:rgba(0,0,0,0.480469) 2px -2px 4px;\"><span style=\"font-family:'Star Jedi Logo MonoLine';\"><span style=\"font-size:medium;\"><span style=\"font-size:14px;\"><span style=\"font-family:'Star Jedi Logo DoubleLine2';\"><span style=\"text-shadow:rgba(0,0,0,0.585938) 2px -1px 4px;\"><span style=\"color:#f6fa09;\"><span style=\"font-size:medium;\"><span style=\"font-size:14px;\">it is a dark time for the </span></span></span></span></span></span></span></span></span></span></span></dd>\n<dd><span style=\"font-family:'Star Jedi Logo DoubleLine1';\"><span style=\"background-color:#ffffff;\"><span style=\"text-shadow:rgba(0,0,0,0.480469) 2px -2px 4px;\"><span style=\"font-family:'Star Jedi Logo MonoLine';\"><span style=\"font-size:medium;\"><span style=\"font-size:14px;\"><span style=\"font-family:'Star Jedi Logo DoubleLine2';\"><span style=\"text-shadow:rgba(0,0,0,0.585938) 2px -1px 4px;\"><span style=\"color:#f6fa09;\"><span style=\"font-size:medium;\"><span style=\"font-size:14px;\"> Students.  Although the </span></span></span></span></span></span></span></span></span></span></span></dd>\n<dd><span style=\"font-family:'Star Jedi Logo DoubleLine1';\"><span style=\"background-color:#ffffff;\"><span style=\"text-shadow:rgba(0,0,0,0.480469) 2px -2px 4px;\"><span style=\"font-family:'Star Jedi Logo MonoLine';\"><span style=\"font-size:medium;\"><span style=\"font-size:14px;\"><span style=\"font-family:'Star Jedi Logo DoubleLine2';\"><span style=\"text-shadow:rgba(0,0,0,0.585938) 2px -1px 4px;\"><span style=\"color:#f6fa09;\"><span style=\"font-size:medium;\"><span style=\"font-size:14px;\"> grading period has been verified</span></span></span></span></span></span></span></span></span></span></span></dd>\n<dd><span style=\"font-family:'Star Jedi Logo DoubleLine1';\"><span style=\"background-color:#ffffff;\"><span style=\"text-shadow:rgba(0,0,0,0.480469) 2px -2px 4px;\"><span style=\"font-family:'Star Jedi Logo MonoLine';\"><span style=\"font-size:medium;\"><span style=\"font-size:14px;\"><span style=\"font-family:'Star Jedi Logo DoubleLine2';\"><span style=\"text-shadow:rgba(0,0,0,0.585938) 2px -1px 4px;\"><span style=\"color:#f6fa09;\"><span style=\"font-size:medium;\"><span style=\"font-size:14px;\"> Imperial teachers have driven the</span></span></span></span></span></span></span></span></span></span></span></dd>\n<dd><span style=\"font-family:'Star Jedi Logo DoubleLine1';\"><span style=\"background-color:#ffffff;\"><span style=\"text-shadow:rgba(0,0,0,0.480469) 2px -2px 4px;\"><span style=\"font-family:'Star Jedi Logo MonoLine';\"><span style=\"font-size:medium;\"><span style=\"font-size:14px;\"><span style=\"font-family:'Star Jedi Logo DoubleLine2';\"><span style=\"text-shadow:rgba(0,0,0,0.585938) 2px -1px 4px;\"><span style=\"color:#f6fa09;\"><span style=\"font-size:medium;\"><span style=\"font-size:14px;\"> Rebel pupils from their hidden</span></span></span></span></span></span></span></span></span></span></span></dd>\n<dd><span style=\"font-family:'Star Jedi Logo DoubleLine1';\"><span style=\"background-color:#ffffff;\"><span style=\"text-shadow:rgba(0,0,0,0.480469) 2px -2px 4px;\"><span style=\"font-family:'Star Jedi Logo MonoLine';\"><span style=\"font-size:medium;\"><span style=\"font-size:14px;\"><span style=\"font-family:'Star Jedi Logo DoubleLine2';\"><span style=\"text-shadow:rgba(0,0,0,0.585938) 2px -1px 4px;\"><span style=\"color:#f6fa09;\"><span style=\"font-size:medium;\"><span style=\"font-size:14px;\"> bases and pursued them across</span></span></span></span></span></span></span></span></span></span></span></dd>\n<dd><span style=\"font-family:'Star Jedi Logo DoubleLine1';\"><span style=\"background-color:#ffffff;\"><span style=\"text-shadow:rgba(0,0,0,0.480469) 2px -2px 4px;\"><span style=\"font-family:'Star Jedi Logo MonoLine';\"><span style=\"font-size:medium;\"><span style=\"font-size:14px;\"><span style=\"font-family:'Star Jedi Logo DoubleLine2';\"><span style=\"text-shadow:rgba(0,0,0,0.585938) 2px -1px 4px;\"><span style=\"color:#f6fa09;\"><span style=\"font-size:medium;\"><span style=\"font-size:14px;\"> the school campus&#8230;</span></span></span></span></span></span></span></span></span></span></span></dd>\n<dd> </dd>\n<h3></h3>\n<h3>Darth Teacher</h3>\n<dd> </dd>\n<p>At the time of my last post, my students had made my life miserable.  It was time to repay the favor.</p>\n<p>After calling parents, pulling students from classes, and keeping them before and after school, I had little choice.  I had no support from parents, and an administration that would stop at nothing to raise their scores.  I had to hit them where it hurts: lunch.</p>\n<p>Middle schoolers revel in their lunch time.  It is the only official time during the school day to socialize.  They would rather be boiled in hot oil than have to eat their lunch with, gulp, a teacher.  To forfeit their time in the cafeteria is the worst punishment any middle school student could imagine.</p>\n<p>Now, I had to be careful about this.  Students have to eat.  If even one student was unable to eat lunch because of my actions,  I would be in a legal battle and out of a job.  I came up with a plan.</p>\n<h3>So We Meet Again, Young Skywalker</h3>\n<p>I called in the failing pupils before lunch, and told each them to take a seat as they filed into my room.</p>\n<p>&#8220;Do you know why I have called you here?&#8221; I asked.</p>\n<p>No one answered.</p>\n<p>&#8220;Personal responsibility.  You lack it, and that is why you are here. [imagine Darth Vader breathing here]  For the next three weeks, your lunch is mine.&#8221;</p>\n<p>&#8220;You are going to eat our lunches?&#8221; one asked.</p>\n<p>&#8220;We don&#8217;t get to eat lunch?  That&#8217;s not fair!&#8221; another said.</p>\n<p>&#8220;Oh, no.  It&#8217;s worse than that,&#8221; I said. &#8220;You have to eat lunch&#8230;with me.&#8221;</p>\n<p>&#8220;Noooooooo!&#8221;</p>\n<p>&#8220;Yes, young Padawans.   The ignorant alliance has been crushed, and you are under my power.  You will get your lunch, and  you will eat here, with me, until you no longer fail my class.  And then, you will learn the ways of the smart side&#8230;&#8221;</p>\n<dd> </dd>\n", "post_id": 47, "location": false, "date": "03-01-2011", "mentions": [], "extracted_features": {}}, {"tags": ["Olive Garden", "education", "middle school", "educator", "teaching", "unicorn", "mathematics", "confessions", "teacher", "math"], "text": "<p>I do not teach math.  To me, mathematics belongs in the same mythological realm as unicorns and mountain trolls&#8211;interesting to think about, fun in riddles and puzzles, but ultimately unreal.  I mean, what is a number really, but a description of something that <em>actually is</em>.</p>\n<p>Nonetheless, I recently made the mistake of doing math.</p>\n<p>Last night I graded papers for four and a half hours, a regular occurrence for me.  Most weeks I push a sixty hour work week, which in the overtime world would be awesome because I&#8217;d bank and probably own a yacht and drink martinis or some other silly nonsense.  But mind you, I am a teacher&#8211;<em>the</em> <em>noble</em> <em>profession</em>.</p>\n<p>Somehow I had the terrible idea to calculate how much money I brought home, considering the actual hours I work.  Bad idea, teacher.</p>\n<p>Bad, bad idea.</p>\n<h3>Put It in a Word Problem</h3>\n<p>Let&#8217;s say that I take home <em>x </em>dollars each month at a grueling, thankless, yet indispensable job.  I am paid for working a laughable forty hours a week.  Yet since I work sixty hours each week without overtime pay, what is discrepancy between the paid the dollar amount and the actual earned amount in terms of <em>y</em> in dollars per hour ?</p>\n<p>I&#8217;m no mathematician, and my formula could probably be better expressed, but since math is mythological, it doesn&#8217;t really matter as long as the magical numbers balance in the end:</p>\n<div id=\"attachment_512\" style=\"width: 235px\" class=\"wp-caption aligncenter\"><a href=\"http://aminusteacher.files.wordpress.com/2013/02/photo-feb-19-8-55-43-pm.jpg\"><img class=\"size-medium wp-image-512\" alt=\"Math = Unicorns\" src=\"https://aminusteacher.files.wordpress.com/2013/02/photo-feb-19-8-55-43-pm.jpg?w=225&#038;h=300\" width=\"225\" height=\"300\" /></a><p class=\"wp-caption-text\">Math = Unicorns</p></div>\n<p>In any case, it wasn&#8217;t the difference in the pay per hour that mattered, but the fact that after working out the calculations, I realized that with as many hours as I work, I am pocketing less <em>per hour</em> than when I waited tables at The Olive Garden as a college student.</p>\n<p>Would you like to sample our new Valpolicella?  Soup or salad?  I&#8217;ll get  you some more breadsticks&#8230;</p>\n", "post_id": 511, "location": false, "date": "02-20-2013", "mentions": [], "extracted_features": {}}, {"tags": [], "text": "<p>Happy Friday everyone!  Just a little something lighthearted for you.</p>\n<span class='embed-youtube' style='text-align:center; display: block;'><iframe class='youtube-player' type='text/html' width='640' height='390' src='https://www.youtube.com/embed/Dd7FixvoKBw?version=3&#038;rel=1&#038;fs=1&#038;showsearch=0&#038;showinfo=1&#038;iv_load_policy=1&#038;wmode=transparent' frameborder='0' allowfullscreen='true'></iframe></span>\n", "post_id": 521, "location": false, "date": "03-01-2013", "mentions": [], "extracted_features": {}}, {"tags": ["riddle", "school", "middle school", "puzzle", "seating", "games", "chess", "educator", "teaching", "Sorry", "education", "Tetris", "teacher"], "text": "<p>Teachers love games.  We are constantly creating puzzles, riddles, challenges, and most importantly, seating charts.  They are the real brain teasers of the classroom.</p>\n<p><a href=\"http://aminusteacher.files.wordpress.com/2013/03/tetris.jpg\"><img class=\"alignnone size-medium wp-image-529 aligncenter\" alt=\"http://www.google.com/search?as_st=y&amp;tbm=isch&amp;hl=en&amp;as_q=tetris&amp;as_epq=&amp;as_oq=&amp;as_eq=&amp;cr=&amp;as_sitesearch=&amp;safe=images&amp;tbs=sur:f&amp;biw=1276&amp;bih=646&amp;sei=BJNLUd7bKIbL2QX8oICgBA#imgrc=nTdLN0HRzyRZ9M%3A%3BUj-XOKL41COy3M%3Bhttp%253A%252F%252F2.bp.blogspot.com%252F_M5CxIdbNdyk%252FS8PVMvwas4I%252FAAAAAAAADMM%252FTRANsHmqfhg%252Fs1600%252Ftetris.jpg%3Bhttp%253A%252F%252Flimpa-vias.blogspot.com%252F%3B736%3B964\" src=\"https://aminusteacher.files.wordpress.com/2013/03/tetris.jpg?w=229&#038;h=300\" width=\"229\" height=\"300\" /></a></p>\n<p>In some ways creating a seating chart is akin to playing Tetris.  We create groups, rows, boxes, L&#8217;s and zigzagged desks in order to accommodate the plethora of students in the room, moving and turning the faux-wood topped units until they fit in the room just right.  The only difference is that once we create the perfect fit, a row of students doesn&#8217;t disappear.  Also, there isn&#8217;t the mesmerizing Soviet era folk music.</p>\n<p><img class=\"size-medium wp-image-528 aligncenter\" alt=\"freeimage-3711180\" src=\"https://aminusteacher.files.wordpress.com/2013/03/freeimage-3711180.jpg?w=300&#038;h=198\" width=\"300\" height=\"198\" /></p>\n<p>In other ways seating charts are similar to playing chess.  Whenever I create a new seating arrangement, I meticulously place students in strategic locations in order to win the room.  In most classes there is a king and/or (drama) queen to conquer.  I quickly move to isolate them from the defenses of their pawns or pin them to place with well behaved bishops or retarded rooks.  I am not joking when I say that I plan several moves in advance.</p>\n<p><em>If I place so-and-so here, he will try to get up and pretend to sharpen his pencil to say something rude to this girl over there, in which case, this other girl will&#8230;</em></p>\n<p>Check.  Mate.</p>\n<p>Then there are times like today, when creating a seating chart is like playing minesweeper.</p>\n<p><img class=\"size-full wp-image-532 aligncenter\" alt=\"images-1\" src=\"https://aminusteacher.files.wordpress.com/2013/03/images-1.jpeg?w=247&#038;h=204\" width=\"247\" height=\"204\" /></p>\n<p>In one of my classes, two of my students told me that they <em>can&#8217;t</em> sit together.  Now, this happens all the time because sixth grade girls are completely self-centered, completely unaware of hurting one&#8217;s feelings when declaring, &#8220;I can&#8217;t stand him!&#8221; while standing next to him.  Also, sixth grade boys are pretty weird, so I can&#8217;t entirely blame the girls.</p>\n<p>Usually I tell the kids to suck it up because I am not about to rearrange my carefully crafted calculated chart, but I could tell that there was a real urgency in the pleas of these two students.  I walked over and jokingly said, &#8220;What&#8217;s the deal? What? Are you exes or something?&#8221;</p>\n<p>Their faces answered in the affirmative.</p>\n<p>I took a sharp epiphanic breath, &#8220;Oh&#8230;&#8221;</p>\n<p>Boom.</p>\n<p><img class=\"size-medium wp-image-530 aligncenter\" alt=\"images\" src=\"https://aminusteacher.files.wordpress.com/2013/03/images.jpeg?w=300&#038;h=246\"   /></p>\n", "post_id": 526, "location": false, "date": "03-22-2013", "mentions": [], "extracted_features": {}}, {"tags": ["dad", "school", "middle school", "parents", "teaching", "mom", "educator", "hero", "heroes", "education", "teacher"], "text": "<p>I was reading through some essays today, wherein the students had to write about their heroes.  I discovered some interesting trends/stereotypes that my students portrayed.</p>\n<p>Most of the white and black kids chose famous people as their heroes.  Topping the list were Selena Gomez, Beyoncé, Peyton Manning, Kobe Bryant, or often, none.  But there was something refreshingly common among hispanic students, particularly my LEP (Limited English Proficiency) students.</p>\n<p>Most of my hispanic students wrote that their heroes were their parents.</p>\n<p>They wrote about how their parents loved them, provided for them, took them places.  These parents were not taken for granted.  One student wrote how he was able to tell his mother everything, even his secrets.  Another commented that he wants to be just like his dad, who has worked hard to provide a better life for his family.  One student even wrote that her parents were the best thing in her life.  These kids were so proud of their parents and all that has been done for them.</p>\n<p>In all, some 90% of my hispanic students reported that the heroes in their lives were mom and dad.  That is a cultural lesson of which many of us can learn.</p>\n", "post_id": 544, "location": false, "date": "03-27-2013", "mentions": [], "extracted_features": {}}, {"tags": ["school", "end", "educator", "train wreck", "teaching", "middle school", "education", "teacher"], "text": "<p>The end of the year is never a smooth ride.  Teachers often have an expectation of ending the school year on a positive note, telling each student how wonderful it was to have him or her in the class, and celebrating their achievements, etc., etc.  But it never works out that way.</p>\n<p>The last days of school are busy filling out paperwork for failing kids going to summer school, verifying grades, and hunting down slacker students who never turned in a final project despite numerous reminders and phone calls to parents.  Besides that, even the best students are playing fast and loose with their behavior, knowing there isn&#8217;t much that can be done because, hey, it&#8217;s the end of the year.</p>\n<p>With all material done being taught and assessed, there is little to do but play games, and the way my students are acting, it might just be the Hunger Games, because they&#8217;re about to start killing each other.  I don&#8217;t know how many <em>keep your hands to yourself</em> or <em>don&#8217;t throw that</em> conversations I&#8217;ve had this week.  Even I&#8217;ve thrown a few markers and <em>your mom</em>&#8216;s in my classroom.</p>\n<p>In the end, the last week of school isn&#8217;t the smooth pulling of a locomotive into the station, but a train wreck: collecting bodies and counting survivors.</p>\n<p>Here&#8217;s to surviving. [raises glass]</p>\n<p style=\"text-align:center;\"><a href=\"http://aminusteacher.files.wordpress.com/2013/06/137.jpg\"><a href=\"http://www.retronaut.com/2013/01/train-wreck-at-montparnasse/\"><img class=\"aligncenter size-large wp-image-570\" alt=\"137\" src=\"https://aminusteacher.files.wordpress.com/2013/06/137.jpg?w=853&#038;h=1024\"   /></a></a></p>\n", "post_id": 547, "location": false, "date": "06-06-2013", "mentions": [], "extracted_features": {}}, {"tags": ["school", "middle school", "twerking", "twerk", "Miley Cyrus", "educator", "education", "teacher"], "text": "<h3>Ah, it&#8217;s good to be back.</h3>\n<p>The yellow dog busses are pulling into the schools, streams of backpacked students are pouring out into rivers of new school outfits, their shoes squeaking happily into the freshly waxed corridors of middle school.  Young timid sixth graders are being shepherded to their first classes, weaving in between the slouching sleepy-eyed eighth graders slinking their way to American History.  The hallways are full of excited chatter, the expressive ramblings of seventh graders showing each other their Facebook summer albums on brightly displayed smartphones.</p>\n<p>And me?  I am ecstatic, ready for a new year of molding minds and creating great writers.  Oh, and of course, putting my foot in my mouth.</p>\n<h3>Call Me Miley Cyrus</h3>\n<p>As the year has gotten under way, we began our first writing composition of the school year&#8211;a personal narrative.  As any good English teacher, I have modeled brainstorming, drafting, revising, editing, with my students following suit.  It has come time for my students to create their first final draft.</p>\n<p>I was giving some final instructions for my students before they were to begin.</p>\n<p>&#8220;Make sure you single-space, since this is a final draft.  Remember the suggestions your peers have given you, to add details and improve your writing, and correct the mistakes they have pointed out.  Don&#8217;t just rewrite your rough draft.  You need to really <em>twerk</em> it.&#8221;</p>\n<p>Immediately all of the faces in my classroom shot up at me.</p>\n<p>&#8220;I mean, tweak it.  TWEAK it.  Please, no twerking.&#8221;</p>\n<p>Oh gosh, how red my face must have been.  Well, here&#8217;s to another great and crazy school year!</p>\n<div id=\"attachment_578\" style=\"width: 402px\" class=\"wp-caption aligncenter\"><a href=\"http://aminusteacher.files.wordpress.com/2013/09/no-twerking2.jpg\"><img class=\" wp-image-578\" title=\"No Twerking\" alt=\"No Twerking\" src=\"https://aminusteacher.files.wordpress.com/2013/09/no-twerking2.jpg?w=392&#038;h=246\" width=\"392\" height=\"246\" /></a><p class=\"wp-caption-text\">No Twerking</p></div>\n<p style=\"text-align:center;\">\n", "post_id": 572, "location": false, "date": "09-25-2013", "mentions": [], "extracted_features": {}}, {"tags": ["school", "middle school", "milf", "educator", "teaching", "education", "teacher"], "text": "<p style=\"text-align:-webkit-auto;\">I remember when I was a kid, there was a short period of time in fourth grade when I learned a new word—a bad word—and I went around the playground using it for days, having no clue what it really meant.  I used it like any other child would: carelessly and in ignorance.  This is one of those kinds of stories&#8230;</p>\n<p style=\"text-align:center;\"><a href=\"http://iframewidth=420height=315src=//www.youtube.com/embed/G2y8Sx4B2Skframeborder=0allowfullscreen/iframe\"><span class='embed-youtube' style='text-align:center; display: block;'><iframe class='youtube-player' type='text/html' width='420' height='315' src='https://www.youtube.com/embed/G2y8Sx4B2Sk?version=3&#038;rel=1&#038;fs=1&#038;showsearch=0&#038;showinfo=1&#038;iv_load_policy=1&#038;wmode=transparent' frameborder='0' allowfullscreen='true'></iframe></span></a></p>\n<p>It was Friday, and the last period of the day.  My students were finishing up silly dialogue stories to demonstrate their knowledge of the newfound quotation mark.  For some unknown reason a few of my students asked me how old I am.  I told them to guess.  I received some very flattering (and a few not-so-flattering) responses before revealing that I am, in fact, thirty-three, several gray hairs withstanding.</p>\n<p>&#8220;No way, I thought you were like twenty-four!&#8221; one child exclaimed.</p>\n<p>&#8220;Whoa, my <em>mom</em> is younger than you,&#8221; added another.</p>\n<p>&#8220;My mom is like that.  She looks way younger than she is,&#8221; said the first child.</p>\n<p>&#8220;Yeah,&#8221; interjected a third child, a young girl who overheard the conversation, &#8220;my mom&#8217;s a MILF.&#8221;</p>\n<p>&#8220;<em>What</em> did you say?!&#8221; I turned to the girl with shock and horror.</p>\n<p>&#8220;What?&#8221; she answered innocently.  Then seeing my expression, she grew wide-eyed. &#8220;Wait, what? Is that bad? Oh, no, that&#8217;s bad. What does that mean?!  Am I in trouble!?!&#8221;</p>\n<p>&#8220;You&#8217;re not in trouble,&#8221; I assured her, &#8220;but I don&#8217;t think that means what you think it means.  Come talk to me after class.&#8221;</p>\n<p>The last few minutes of class went by, and this sweet young lady sat nervously while the rest of the students packed up.  After the bell rang and the other kids filed (or fled) out of the classroom to get on their busses, I called her over to my desk.</p>\n<p>&#8220;So, I&#8217;m guessing you don&#8217;t know what MILF means, huh?&#8221;</p>\n<p>&#8220;Doesn&#8217;t it mean pretty or something like that?&#8221;</p>\n<p>&#8220;Um, not exactly.  Do you know the F-word?&#8221;</p>\n<p>&#8220;Yeah,&#8221; she muttered sheepishly.</p>\n<p>&#8220;And you know what the F-word means?&#8221;</p>\n<p>&#8220;Yes,&#8221; she answered, blushing.</p>\n<p>&#8220;Well&#8230;MILF is an acronym for the phrase &#8216;Mothers I&#8217;d Like To F.&#8221;</p>\n<p>&#8220;Oh my god!&#8221; she blurted, covering her mouth.  &#8220;I said that about my mom! I am <em>so</em> embarrassed.&#8221;</p>\n<p>&#8220;Yeah, let&#8217;s not call your mom that, ok?&#8221;</p>\n<p style=\"text-align:center;\">***</p>\n<h5 style=\"text-align:center;\">How about you?  Have you ever used a word misunderstanding what it truly meant? Please write a comment below for your own confession!</h5>\n", "post_id": 598, "location": false, "date": "10-08-2013", "mentions": [], "extracted_features": {}}, {"tags": ["school", "middle school", "manuscript", "forgery", "educator", "teaching", "cursive", "education", "handwriting"], "text": "<p style=\"text-align:center;\"><a href=\"http://aminusteacher.files.wordpress.com/2013/11/750px-cursive-svg.png\"><img class=\"aligncenter size-large wp-image-669\" alt=\"D'Nealian Script\" src=\"https://aminusteacher.files.wordpress.com/2013/11/750px-cursive-svg.png?w=1024&#038;h=817\"   /></a></p>\n<p>When I was a child, my handwriting was awful. In fact, the only &#8220;C&#8221; I remember getting in elementary school was in handwriting (back when you received grades for that sort of thing). One time in fifth grade I tried to forge my mother&#8217;s signature on a report card because I realized that I had brought it back unsigned. I didn&#8217;t consider for one moment that the scrawling mess on the paper wouldn&#8217;t pass for my mother&#8217;s. Also, I didn&#8217;t realize that the name Barbara did not contain an &#8220;e&#8221;.</p>\n<p>Needless to say, I was caught immediately, and my teacher called up the school&#8217;s police officer who informed me that what I did was illegal and I could go to jail. I&#8217;m pretty sure I am scarred for life.</p>\n<h3><span style=\"font-style:normal;line-height:23px;\">The Writing On The Wall.</span></h3>\n<p>It wasn&#8217;t until the end of college that my own handwriting improved. I was about to start student teaching in a first grade classroom; the teacher, an old dragon of a woman who was approaching thirty years of teaching, asked me to write something on the board. I had only written a couple of words when she stopped me and said, &#8220;<em>You</em> are not teaching <em>my</em> students with <em>that</em> handwriting!&#8221;</p>\n<p>She made me stay after school let out each day to practice my handwriting on the old black chalkboard, I kid you not. I felt like Bart Simpson in the opening credits. She wouldn&#8217;t let me write on the board in front of the students until my penmanship was up to par, which took some time. I am forever grateful for that woman, tough as she was.</p>\n<p>In my own classroom, I still teach handwriting. Some years I start of the year with it, and others I wait until my students beg me to teach them how to have beautiful cursive penmanship. This year my students are begging, so in the spring I will begin to teach it. The only thing I can&#8217;t do is grade them on it, as I learned from a sharp admonition from an administrator a few years ago.</p>\n<h3>Paying It Forward.</h3>\n<p>Recently, I gave a detention to one of my sixth grade boys for roughhousing, or something like that. He returned the following morning with his detention slip in hand. At one glance I knew that it wasn&#8217;t his dad&#8217;s signature, but I didn&#8217;t say anything. I just had him come in and take a seat. He asked what he was going to do for detention while I brought over a binder that I use for handwriting practice and told him that he was going to practice his handwriting. For the next thirty minutes he sat and carefully practiced his ABCs.</p>\n<p>When his time was finished, I asked him, &#8220;Now, why do you think I had you practice your handwriting today for detention?&#8221;</p>\n<p>&#8220;&#8216;Cause my handwriting&#8217;s real bad?&#8221; he guessed.</p>\n<p>&#8220;Yes,&#8221; I answered. &#8220;And if you are going to forge your parent&#8217;s signature, your handwriting really needs to improve.&#8221;</p>\n<p>Gulp.</p>\n", "post_id": 660, "location": false, "date": "11-25-2013", "mentions": [], "extracted_features": {}}, {"tags": ["blues", "education", "plagiarism", "poetry"], "text": "<p style=\"text-align:center;\"><img class=\"aligncenter\" title=\"Blues Brothers\" src=\"https://i0.wp.com/www.bluesbrothersgallery.com/images/bluesbros.jpg\" alt=\"Blues Brothers\" width=\"461\" height=\"312\" /></p>\n<h3>Blues: So Easy, Even a Middle Schooler Can&#8230;Never Mind</h3>\n<p>Recently, I taught my students poetry through a variety of styles and forms.  I taught limericks, haiku, cinquains, etc.  One such poetic style was the twelve bar blues.  It&#8217;s pretty simple to write a blues song:</p>\n<p>Write a sad line like, &#8220;Oh my baby left me all alone.&#8221;</p>\n<p>Then repeat that line, &#8220;Oh my baby left me all alone.&#8221;</p>\n<p>The rhyme with it; thus, &#8220;Now I am sitting in an empty home.&#8221;</p>\n<p>Can&#8217;t be any more straightforward than that, right?  That&#8217;s what I thought.</p>\n<p>One of my students had the assignment missing and came in to make up the work.  I gave him example after example and tried to explain the simple structure of the song.  I even busted out my own blues song and sang it, complete with fake guitar twang.</p>\n<h3>The Copy Cat Blues</h3>\n<p>The next day, he returned with a blues poem all written out.  The only problem: he copied the example I had posted on the board—word for word.</p>\n<p>&#8220;You didn&#8217;t write a blues song,&#8221; I said.  &#8220;All you did is copy the one from the board.  That&#8217;s plagiarism.  I need you to write one of your own, from <em>your</em> head, not mine.&#8221;</p>\n<p>&#8220;Okay,&#8221; he breathed in his falsetto voice and walked away.</p>\n<p>(Now, let me give you a short auditory description of how this child speaks.  He only speaks by taking a deep breath and letting it all out at one time as he speaks in falsetto.  Go ahead, give it a try.  See what I mean?)</p>\n<h3>The Laughingstock Blues</h3>\n<p>The next day he returned and breathed out, &#8220;I have my blues poem.&#8221;</p>\n<p>He handed me a piece of paper with several paragraphs written on it.  It obviously was not a blues poem, or a poem of any sort for that matter.   Hmmm.  I typed the first sentence of his paragraph in the Google search bar, which led me to an entry at poets.org.  I looked up at him with a huge grin on my face.</p>\n<p>&#8220;Not only did you again plagiarize this, but you didn&#8217;t even plagiarize a poem.  You copied several paragraphs about the history of poetry from this website.&#8221;</p>\n<p>Normally I refrain from laughing at students, but this was just too good.  &#8220;Oh, man.  You didn&#8217;t even copy a poem.  Wow.  Now that is the best thing I&#8217;ll hear all day!&#8221;</p>\n<p>I proceeded to tell him to do it again.  He smiled, confused, and left the room.  Later that day that same student complained that it was hard to log in to the computers because he keeps forgetting how to spell his name.  Maybe he should write a blues song about that.</p>\n", "post_id": 67, "location": false, "date": "03-10-2011", "mentions": [], "extracted_features": {}}, {"tags": ["school", "hazmat", "middle school", "ill", "plague", "sick", "educator", "education"], "text": "<p style=\"text-align:center;\"><a href=\"http://aminusteacher.files.wordpress.com/2014/01/outbreak-original.jpg\"><img class=\" wp-image aligncenter\" id=\"i-697\" alt=\"Image\" src=\"https://aminusteacher.files.wordpress.com/2014/01/outbreak-original.jpg?w=455&#038;h=256\" width=\"455\" height=\"256\" /></a></p>\n<p>It&#8217;s that time of the year—plague season.  </p>\n<p>All around my school are pallid faces, high fevers, and nauseous stomachs. It seems to have hit especially hard this year. Nearly half of the seventh grade teachers are out, as well as a quarter of the students. The principal had the flu last week. Even I, with my supercharged immune system, fell ill to a stomach virus over the weekend that had me hurling from morning to night, and not eating for another full day.</p>\n<p>See, schools are like gigantic petri dishes, full of agar and ready to incubate disease, except we are the medium.  The rate at which students get sick is pretty incredible, dominos falling from class to class, up and down stairs, and through the halls. It&#8217;s pretty much like <a href=\"http://www.imdb.com/title/tt0114069/\"><em>Outbreak</em></a> without all the dying and hazmat suits.</p>\n<p>The thing to remember is this: when a student says he feels sick, just hand him the trashcan and send him up to the nurse.</p>\n", "post_id": 679, "location": false, "date": "01-18-2014", "mentions": [], "extracted_features": {}}, {"tags": ["Shaquille O'Neal", "bandwagon", "testimonial", "friendship bracelet", "skinny jeans", "slap bracelet", "Nike Elite", "trends", "hipster", "educator", "teaching", "middle school", "education", "teacher", "mustache"], "text": "<p>In the most recent unit on persuasive writing, my class has had to explore various terminology related to persuasion.  Such terms as proposition, evidence, evaluation, testimonials, and bandwagon appeal have been discussed.  It is one of my favorite units, because I get to teach not only writing techniques that help my students create plausible arguments (such as why their parents should finally cave in and by them a puppy), but also critical thinking skills that will help them develop better choices in the real world.</p>\n<p>I get to crush my poor students&#8217; perfect world where TV ads are all true and fashion is new, to help them see the world in a broken, manipulative, and colorful light.  I have two lessons that perspicuously demonstrate the finer points of our consumer choices.</p>\n<h2>1. Testimonials</h2>\n<p>Kids are suckers for celebs.  If a famous person endorses a product, it has to be true.  Without fail, I am always able to find some unsuspecting young jock wearing a Power Balance bracelet, convinced that it works.  I mean, if Shaquille O&#8217;Neal can almost incomprehensibly mumble his way to a product&#8217;s endorsement, it&#8217;s legit, right?  I mean, he even gets to the &#8220;scientific&#8221; part!</p>\n<p><span class='embed-youtube' style='text-align:center; display: block;'><iframe class='youtube-player' type='text/html' width='640' height='390' src='https://www.youtube.com/embed/Q1LQppZKoK4?version=3&#038;rel=1&#038;fs=1&#038;showsearch=0&#038;showinfo=1&#038;iv_load_policy=1&#038;wmode=transparent' frameborder='0' allowfullscreen='true'></iframe></span></p>\n<p>They love it and believe it, until I show them how it &#8220;works&#8221;.</p>\n<p><span class='embed-youtube' style='text-align:center; display: block;'><iframe class='youtube-player' type='text/html' width='640' height='390' src='https://www.youtube.com/embed/f4Vh8uKr1Gs?version=3&#038;rel=1&#038;fs=1&#038;showsearch=0&#038;showinfo=1&#038;iv_load_policy=1&#038;wmode=transparent' frameborder='0' allowfullscreen='true'></iframe></span></p>\n<p>I don&#8217;t actually show them the second video, but I do the same demonstration with students using, not a Power Balance Band, but a <a href=\"http://www.google.com/url?sa=i&amp;rct=j&amp;q=&amp;esrc=s&amp;source=images&amp;cd=&amp;cad=rja&amp;docid=1Yqe1mAKrZCHxM&amp;tbnid=D4dlJj9kxJaQUM:&amp;ved=0CAUQjRw&amp;url=http%3A%2F%2Fwww.meijer.com%2Fs%2Fschleich-standing-sheep-figurine%2F_%2FR-204726&amp;ei=lHngUpStJOjm2gWz5YCwBw&amp;bvm=bv.59568121,d.b2I&amp;psig=AFQjCNF93i8TztJ_jYReAcDb1lkHmhCnIw&amp;ust=1390529286565025\">Power Balance Lamb</a>, and let their jaws hit the floor. I confess I enjoy seeing my students with a Power Balance Band look down at their cheap rubber bracelets in shame.</p>\n<p>All that is to say— just because a celeb. endorses it, doesn&#8217;t mean it&#8217;s worth it.</p>\n<h2>2. Bandwagon Appeal</h2>\n<p>In making the point about bandwagon appeal and how people are all after the hot new item, I appealed to the trends that Generation Z kids currently embrace:</p>\n<h2 style=\"text-align:center;\">Rubber Band Bracelets<br />\n<a href=\"http://aminusteacher.files.wordpress.com/2014/01/five-below-hot-trend-rubber-band-bracelet-kits.jpg\"><img class=\"aligncenter  wp-image-722\" alt=\"five-below-hot-trend-rubber-band-bracelet-kits\" src=\"https://aminusteacher.files.wordpress.com/2014/01/five-below-hot-trend-rubber-band-bracelet-kits.jpg?w=323&#038;h=181\" width=\"323\" height=\"181\" /></a></h2>\n<h2 style=\"text-align:center;\">Colorful Skinny Jeans</h2>\n<p style=\"text-align:center;\"><a href=\"http://aminusteacher.files.wordpress.com/2014/01/f21-skinnies.jpg\"><img class=\"aligncenter  wp-image-724\" alt=\"f21-skinnies\" src=\"https://aminusteacher.files.wordpress.com/2014/01/f21-skinnies.jpg?w=315&#038;h=210\" width=\"315\" height=\"210\" /></a></p>\n<h2 style=\"text-align:center;\">Silly Mustaches<br />\n<a href=\"http://aminusteacher.files.wordpress.com/2014/01/mustache.png\"><img class=\"aligncenter  wp-image-734\" alt=\"mustache\" src=\"https://aminusteacher.files.wordpress.com/2014/01/mustache.png?w=369&#038;h=138\" width=\"369\" height=\"138\" /></a></h2>\n<h2 style=\"text-align:center;\">Ridiculous Socks</h2>\n<p style=\"text-align:center;\"><a href=\"http://aminusteacher.files.wordpress.com/2014/01/nike-elite-basketball-crew-socks-mens.jpeg\"><img class=\"aligncenter size-full wp-image-726\" alt=\"nike-elite-basketball-crew-socks-mens\" src=\"https://aminusteacher.files.wordpress.com/2014/01/nike-elite-basketball-crew-socks-mens.jpeg?w=200&#038;h=200\" width=\"200\" height=\"200\" /></a></p>\n<p>To be fair, I had to share with the kids the trends that I grew up with, items that were all the rage.  Oh, how the wagon has rolled because we had&#8230;</p>\n<h2 style=\"text-align:center;\">Slap Bracelets<br />\n<a href=\"http://aminusteacher.files.wordpress.com/2014/01/mp_large.jpeg\"><img class=\"aligncenter\" alt=\"mp_large.\" src=\"https://aminusteacher.files.wordpress.com/2014/01/mp_large.jpeg?w=323&#038;h=208\" width=\"323\" height=\"208\" /></a></h2>\n<h2 style=\"text-align:center;\"></h2>\n<h2 style=\"text-align:center;\"></h2>\n<h2 style=\"text-align:center;\"><span style=\"line-height:1.5em;\">Colorful Skinny Jeans</span></h2>\n<p style=\"text-align:center;\"><span style=\"line-height:1.5em;\"><a href=\"http://aminusteacher.files.wordpress.com/2014/01/a110-300x253.jpg\"><img class=\"aligncenter  wp-image-730\" alt=\"versace-circa-early-90s-models-christy.jpeg?w=500&amp;h=706\" src=\"https://aminusteacher.files.wordpress.com/2014/01/versace-circa-early-90s-models-christyw500h706.jpeg?w=291&#038;h=410\" width=\"291\" height=\"410\" /></a></span></p>\n<h2 style=\"text-align:center;\">Silly Mustaches</h2>\n<p style=\"text-align:center;\"><a href=\"http://aminusteacher.files.wordpress.com/2014/01/mustache-tom-selleck.jpg\"><img class=\"aligncenter  wp-image-733\" alt=\"mustache tom-selleck\" src=\"https://aminusteacher.files.wordpress.com/2014/01/mustache-tom-selleck.jpg?w=256&#038;h=256\" width=\"256\" height=\"256\" /></a></p>\n<h2 style=\"text-align:center;\"></h2>\n<h2 style=\"text-align:center;\">Ridiculous Socks</h2>\n<h2 style=\"text-align:center;\"><a href=\"http://aminusteacher.files.wordpress.com/2014/01/leg-warmers.jpg\"><img class=\"aligncenter  wp-image-732\" alt=\"leg-warmers\" src=\"https://aminusteacher.files.wordpress.com/2014/01/leg-warmers.jpg?w=225&#038;h=335\" width=\"225\" height=\"335\" /></a></h2>\n<h2 style=\"text-align:center;\"></h2>\n<h2>Full Circle</h2>\n<p>Well, it looks like things have come full circle.  In fact, what made me think of this was that today one of my sweet students came into my classroom and presented me with a brand new&#8230;</p>\n<p>…slap bracelet.</p>\n<p style=\"text-align:center;\"><a href=\"http://aminusteacher.files.wordpress.com/2014/01/photo.jpg\"><img class=\"aligncenter  wp-image-735\" alt=\"photo\" src=\"https://aminusteacher.files.wordpress.com/2014/01/photo.jpg?w=277&#038;h=371\" width=\"277\" height=\"371\" /></a></p>\n", "post_id": 700, "location": false, "date": "01-23-2014", "mentions": [], "extracted_features": {}}, {"tags": ["best practices", "education", "school"], "text": "<p>Today I was called into the office to talk to the vice principals—both of them.</p>\n<p>They wanted to talk to me about my teaching methods and classroom management style.  In other words, they wanted to tell me how to teach my class.  Never you mind that I constantly employ best practices in my classroom.  That&#8217;s not the kind of stuff that really matters.</p>\n<h3>What I Learned From Administrators</h3>\n<ul>\n<li>I should not have a reading corner in my classroom, a pleasant area wherein students can relax and read when they are done with their classwork (best practice), because they cannot be properly monitored.  They should always sit at their desks, as uncomfortable as they are.</li>\n</ul>\n<ul>\n<li>Students should not be allowed to listen to music as they work (best practice).  Does it matter that it helps students focus?  Nope.</li>\n</ul>\n<ul>\n<li>Students should not be allowed to play educational games (best practice).  Games like <a href=\"http://www.freerice.com\" rel=\"nofollow\">http://www.freerice.com</a> that build vocabulary skills should not be played to give incentives for students finishing their work and achieving good scores.</li>\n</ul>\n<ul>\n<li> Make sure that students pass, especially special education students.  Whether students turn in their work or not, whether they make an effort to learn or not—they need to receive passing marks.  It&#8217;s not that it makes a difference in their moving on to the next grade level.  Students will go to the next grade whether they earn 50&#8217;s or 100&#8217;s, and no matter if they pass the state standardized tests.  It&#8217;s just that it makes the school look bad and requires more paperwork; that&#8217;s what matters.</li>\n</ul>\n<h3>What I Learned From Students</h3>\n<p>I went on to remove the comfy seats of the reading corner, and begin implementing the suggestions (directives) from my bosses.  The first thing that students asked as they came into the classroom was, &#8220;What happened to the reading corner?  Where did the seats go?&#8221;</p>\n<p>I had to go on to explain that students would no longer be able to sit in the back and read when their work was done.  They had to stay in their seats to read quietly.  They would no longer be allowed to listen to music as they worked.  They could certainly not be allowed to play online games if they finished their work.</p>\n<p>They were pissed.  All the rest of the day I had to tacitly explain that students could not partake in the things that previously motivated them to learn.  The comments from students ranged from &#8220;Why can&#8217;t we do this anymore?&#8221; to &#8220;This sucks&#8221; and &#8220;I hate this school.&#8221;  A couple of highly motivated students asked if they could write letters of complaint to the head principal about this.</p>\n<p>Way to go admin.  This is why students do not love school.  It is no longer a place of creating lifelong learners, but an oppressive environment aimed at producing high numbers on a spreadsheet (not that I should mention that in previous years my students have had some of the highest standardized test scores in the district).</p>\n<p>I guess my students and I both learned the same lesson today: school is not fun.</p>\n", "post_id": 77, "location": false, "date": "03-11-2011", "mentions": [], "extracted_features": {}}, {"tags": ["school", "middle school", "educator", "hair", "Good Hair", "buzz", "voodoo", "teaching", "education", "teacher", "Rachel's Challenge"], "text": "<p>My head is cold, and there is a reason for that.</p>\n<p>One of the organizations at my school, <a href=\"http://www.rachelschallenge.org\" target=\"_blank\">Rachel&#8217;s challenge</a>, was raising money for a family in need. In coming up with possible fundraising ideas, we threw around the typical penny war, baked goods sale, and car wash. But these were all chump change; we wanted to raise serious funds for a serious need—a student and family experiencing a very difficult time, even for our demographic.</p>\n<p>Then the idea came: a buzz-off. There is nothing that kids want to see more than a teacher humiliated, and what better way than shaving teachers&#8217; heads live during a pep rally? That, surely, would be a big draw. This is where I come in. I was asked whether I would be willing to volunteer to have my head shaved for the fundraiser. Now, this is a pretty big request. I mean, I have good hair. I take pride in my stylish, tussled-yet-professional mane. After asking permission from the girlfriend, I reluctantly agreed to put my coiffure to the chopping block.</p>\n<p>For each several hundred dollars raised, a different teacher would be slated to undergo the razor. I determined that my hair was worth at least $1,000. However, as my school is Title I, that was deemed a bit ambitious, and I had to settle for the $400 dollar mark (far below the true value of my gorgeous hair, and sadly ranked below the shorter hair of another administrator).</p>\n<p>Each day during lunch the donation jars were carted around, collecting funds, and the school was plastered with posters of the participating teachers&#8217; faces with the hair photoshopped out. At first it was rough, and not many donations were collected, but with the daily announcements and plenty of heckling from teachers, the dollars started to flow. One fellow teacher participating was awesome enough to mock his students by styling his hair just like several of his students throughout the week, including signs with their names worn around his neck.</p>\n<p>My students were incredibly and surprisingly passionate about the issue.  Some students told me they they would bring a hundred dollars just to see me have my head shaved (which is unlikely as most of my kids eat on <a href=\"http://www.fns.usda.gov/snap/supplemental-nutrition-assistance-program-snap\">SNAP</a>, but hey, you never know). Other students were vehemently opposed to seeing my head without its glorious locks, and begged me not to do it. I didn&#8217;t know that my hairdo would cause such a reaction.</p>\n<p>There were a few students who definitely took it overboard. One of my students asked me if she could keep a lock of my hair. I gave her a glance of repudiation and said, &#8220;No. That&#8217;s <em>creepy</em>.&#8221; The last thing I need is to wake up at night in searing pain as a child twists a pin in her newly completed <a href=\"http://static.tvtropes.org/pmwiki/pub/images/voodoo-doll_163.jpg\">voodoo doll</a>. Two of my other students drew a gravestone on my whiteboard and asked if we could have a moment of silence for my soon-to-be beheaded hair.</p>\n<p>Middle schoolers are weird.</p>\n<p>When the time finally came for the pep rally, students were mocking my hair, asking me if I was scared to lose it, cruelly telling me to kiss it goodbye. I mean, really? This is just hair, not Jesus before the Sanhedrin. Nonetheless, I was a little nervous, not because I am vain about my hair (which I am), but because I have a brilliantly germanic bone structure that just seems to shout, &#8220;Deutschland über alles!&#8221;</p>\n<p>The pep rally itself had very little to do with our sports teams, who have not earned any accolades for some years, but we did have some sports group recognized for a moment after our band, choir, and cheerleaders all performed. There were a few silly teacher vs. student games, and then came the big moment, the finale. Two other teachers and myself were called out to the floor. It was announced that we had raised over $800 for this family—pretty amazing for our student population.</p>\n<p>As we came down to the court, I could hear sixth graders chanting my name. It was strangely awesome. I felt like Petyon Manning, or rather, more like a Roman gladiator entering the Colosseum. We were seated, and behind us came the buzzing whir of three electric razors. Then as the whirring came close, hair began to fall in small heaps on the ground.</p>\n<p>Minutes later there we were, three teachers, sheared as sheep.</p>\n<p>I kept running my hands over my newly pared hair; it felt soft and fuzzy, but I was worried as to what I would see when I looked in a mirror. However, I had no need. As students exited the gym, one student came up to me and deftly said, &#8220;You look like Walter White.&#8221; Ouch.</p>\n<p>Well, hair grows back, but until then I will be needing to wear my beanie, mostly because my head is cold, but also because kids keep asking to touch my head. Did I mention middle schoolers were weird?</p>\n<h5>Oh, and if you didn&#8217;t get the title reference, <a href=\"http://www.imdb.com/title/tt1213585/\" target=\"_blank\"><em>Good Hair</em></a> is a surprisingly good documentary film narrated by Christ Rock chronicling the awesomeness and difficulties of black hair.</h5>\n", "post_id": 822, "location": false, "date": "02-13-2014", "mentions": [], "extracted_features": {}}, {"tags": ["school", "middle school", "hail", "educator", "teaching", "education", "teacher", "Texas"], "text": "<p>It has been a long couple of months. I was given a student teacher for seven weeks, which, contrary to conventional wisdom, does not make teaching any easier. It in fact, makes it even more stressful. But that is another story for another day.</p>\n<p>A little over a week ago I was down in the basement where I teach, helping a student after school learn how to make source cards for citing research and chatting with another teacher in code about craft beer. In the midst of explaining that copying the URL on a website wasn&#8217;t a sufficient citation, I heard some sort of banging noise in the hallway.</p>\n<p>I looked out of my door, and I didn&#8217;t see anything, but the sound was getting louder. It was the pounding violent sound of hammers on metal. Oh, no. Hail.</p>\n<p>You see, here in Texas we do everything bigger—including weather.</p>\n<p>The sound grew to a roaring blitz of ice on the roof so loud that I was sure it was falling straight through the building. I got up on a desk and checked above the ceiling tiles to ascertain whether water was leaking through the upper floor. No water, but the noise was deafening. There was nothing I could do until the storm passed over, so I continued to tutor my student on the ways of citation and talk to my coworker about tasty libations.</p>\n<p>A few minutes after the terrible sound subsided, a fellow teacher ran into my room wide-eyed and frantic.</p>\n<p>&#8220;I&#8217;m so sorry to interrupt, but you need to see your car.&#8221;</p>\n<p>&#8220;Destroyed?&#8221; Considering the cacophony, it would be no surprise.</p>\n<p>&#8220;It&#8217;s pretty bad.&#8221;</p>\n<p>That was as good of a time as any to call it a day, so I sweep the student out of the room and walked upstairs with my coworker and out of the building to the parking lot, where half a dozen teachers were staring in disbelief at their cars. It looked like an act of vandalism—cars pockmarked and dented; cracked, spiderwebbed, and shattered windshields; hailstones lying like golf balls around the grass.</p>\n<p>I came to my car. It had no back windshield anymore. The front windshield was cracked. Every panel on my car was as blemished as an adolescent&#8217;s acned face.</p>\n<p>No small number of other teachers had their cars looking just the same, and one car even had a hole punched through the top of the trunk. The storm has been the talk of the town, and a picture of my poor car even made it into the local newspaper. Now my students are pelting me with questions about my car: Is it ruined? How are you going to get to school? Want my dad to fix it?</p>\n<p>Within the next few weeks, there will be a whole lot of teachers pulling up to school in their sweet new (and by that I mean used) rides.</p>\n<p>Hmmm…maybe we should lobby for covered parking.</p>\n<p>(Just kidding; we don&#8217;t even have enough money to pay for remediation materials!)</p>\n<div id=\"attachment_830\" style=\"width: 250px\" class=\"wp-caption aligncenter\"><a href=\"http://aminusteacher.files.wordpress.com/2014/04/image.jpeg\"><img class=\"size-full wp-image-830\" src=\"https://aminusteacher.files.wordpress.com/2014/04/image.jpeg?w=240&#038;h=320\" alt=\"Ouch.\" width=\"240\" height=\"320\" /></a><p class=\"wp-caption-text\">Hail found by a coworker in the same neighborhood as our school.</p></div>\n", "post_id": 829, "location": false, "date": "04-14-2014", "mentions": [], "extracted_features": {}}, {"tags": ["middle school", "standardized testing", "testing", "educator", "teaching", "education", "teacher"], "text": "<p>Another year, another round of standardized testing. Over the past two days students trotted into brick gilded buildings across the state and broke the seals on booklets of testing material to determine their level of academic achievement. I do not take these days lightly, but I also do not add to the burden of their mandatory assessment. I cooked breakfast burritos for kids who came hungry, and played fun games before the test to get them in a positive mood.</p>\n<p>But once the test begins and furious bubbling of answers ensues, <em>what do teachers think about for four mind-numbing hours?</em></p>\n<p>As I pace the room, actively monitoring the testing, I have to keep myself from dying of absolute boredom. Therefore, I come up with something to occupy my mind. Last year it was how to build a water catchment system for my home. The year before it was creating schematics for a permanent magnet motor to solve the world&#8217;s energy problems (which never left the ridiculous design phase, of course). This year, it was pondering the objectives I will need to reteach before my students are ready for next year: subject-verb agreement, run-ons, eliminating redundancies, etc.</p>\n<p>So fellow educators, what occupies your mind during those testing days?  Post in the comments below.</p>\n<p>&nbsp;</p>\n", "post_id": 844, "location": false, "date": "04-24-2014", "mentions": [], "extracted_features": {}}, {"tags": ["school", "middle school", "district", "grading", "grading policy", "teaching", "education"], "text": "<p><a title=\"A Texas School District Rethinks Grading Policy\" href=\"http://www.wfaa.com/news/education/Denton-ISD-considers-changing-how-it-grades-students--256440271.html\">A Texas School District Rethinks Grading Policy</a></p>\n<p>A Texas school district is considering a new policy in which there are no late grades and giving opportunity for students to turn in assignments at any point in time.  Some believe that this will lead to a truer account of academic achievement; others worry that this will lead to laziness among students.</p>\n<p>What are your thoughts?</p>\n", "post_id": 860, "location": false, "date": "04-24-2014", "mentions": [], "extracted_features": {}}, {"tags": ["teaching", "recycling", "middle school", "education", "teacher"], "text": "<p>One of my favorite people on staff is a man who works with the mentally disabled students in the life skills room.  A real tough job sometimes.  But this man manages to bring out the best in everything, a trait that I truly admire.</p>\n<p>I was on my way out after school when I saw two students, brother and sister, bringing up the recycling carts to be emptied outside.  I stopped and grabbed a couple of carts to roll out there with them.  We were outside emptying the them when this staff member joined us grabbing carts and shaking them over the big blue bin.</p>\n<p>He started telling the students about how great recycling was and began singing an impromptu soul song about recycling.  I liked the sound of it, so I started beat boxing along with his singing.  Soon we had an all-out vocal jam session, recycle style.  We even had the kids singing along with us.  It was pretty much baller.</p>\n<p>That, my friends, is one that makes it count.</p>\n", "post_id": 87, "location": false, "date": "03-24-2011", "mentions": [], "extracted_features": {}}, {"tags": ["NASCAR", "movies", "mall", "Walmart", "teaching", "education"], "text": "<p>This evening I ran into a couple of my students at the mall.  This is precisely why I avoid the mall, Walmart, and NASCAR races.  But sometimes, it&#8217;s fun.</p>\n<p>I had just gotten out of a movie when one of my students walked past me with several of his friends.  He did not recognize me without my teacher garb, and walked on by.  One of my other students arrived outside the cinema with several other kids and immediately started shouting my name.  I gave him my traditional bro handshake and chatted with the kids for a minute.  They went on in to the theater, and the first student came up to me after hearing I was outside.  He started asking me about my weekend and what movie I saw.  Then he got nervous and asked if I was going to give him homework for seeing him out in public.</p>\n<p>&#8220;No way,&#8221; I replied.  &#8220;Homework is for school days.  Weekends, no homework.  And that goes for the both of us.&#8221;  Then I sent him on his way to chill with his friends.</p>\n<p>You know, kids can be pretty cool when they&#8217;re not in school.  They can be punks in class, but alright on their own.  I guess that says something about the school environment.  Or just that kids are, well, just kids.</p>\n", "post_id": 91, "location": false, "date": "04-03-2011", "mentions": [], "extracted_features": {}}, {"tags": ["teaching", "education", "middle school", "planets", "Uranus"], "text": "<p>The other day, I had the following warm-up for my students: If the moon is made of cheese, what else in the universe is edible?</p>\n<p>I got the typical responses, such as the Sun is an orange, Pluto is ice cream, etc., but one response just about made me piss myself.  This particular wisecracking student gave a list of planets with their associated foods, all quite creative, and then he got to his last one.</p>\n<p>&#8220;And well, Uranus shouldn&#8217;t be a food, because if it was then someone would say, &#8216;Hey, can I have a piece of Uranus?&#8217; And that would be gross.&#8221;</p>\n<p>Ah&#8230;this is why I love teaching.</p>\n", "post_id": 94, "location": false, "date": "04-06-2011", "mentions": [], "extracted_features": {}}, {"tags": ["middle school", "education", "colon", "teaching", "educator"], "text": "<h3 style=\"font-size:1.17em;\">Punctuation or Not?</h3>\n<p>My students are often asking me random questions, sometimes related to English, sometimes not.</p>\n<p>Recently, one of my students came up to my desk to ask me a question.</p>\n<p>&#8220;Mr. _____, what&#8217;s a colon?&#8221;</p>\n<p>&#8220;Well, do you mean the punctuation mark?&#8221;</p>\n<p>&#8220;No, like the part of your body.&#8221;</p>\n<p>I had to think through how to answer this one.</p>\n<p>&#8220;Well, it is the the part of the body that processes waste.&#8221;</p>\n<p>I am met with a blank stare.  I had to rephrase.</p>\n<p>&#8220;It holds your poop.&#8221;</p>\n<p>&#8220;Ah, dang.  That&#8217;s gross!  Wait, so what&#8217;s a colonoscopy?&#8221;</p>\n<p>From the other side of the classroom I heard some other students look at him and laugh.  They had put this poor kid up to it.  Now I had to keep going.</p>\n<p>&#8220;A colonoscopy is when a doctor sticks a tube in your butt and starts to&#8211;&#8220;</p>\n<p>&#8220;Never mind,&#8221; said the student and walked back to his group of friends, blushing.</p>\n<p>Sometimes I love this job.</p>\n", "post_id": 96, "location": false, "date": "04-19-2011", "mentions": [], "extracted_features": {}}], "edges": [{"data": [0, 0, 0, 0, 20366461, 0, 20366461, 0, 20366461, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 28668234, 37488147, 0, 37445753, 0, 0, 0, 36501846, 0, 0, 20366461, 0, 42144909, 0, 37911252, 0, 28668234, 0, 0, 37911252, 0, 0, 0, 0, 0, 0, 13072802, 20366461, 0, 0, 0, 13072802, 13072802, 0, 0, 0, 0, 0, 0, 20366461, 0, 0, 20366461, 44756317, 0, 0, 0, 0, 28668234, 0, 0, 0, 0, 0, 63828937, 31699004, 0, 0, 59976619, 0, 0, 61196244, 0, 0, 6005255, 72672749, 0, 0, 0, 6005255, 0, 0, 67573462, 0, 0, 0, 0, 0, 0, 20366461, 28668234], "type": "comment", "service": "wordpress"}, {"data": [25291632, 25291632, 18473744, 26048408, 10298061, 31106034, 31106034, 38255010, 39417882, 31106034, 33485566, 37488147, 33485566, 34752656, 37445753, 31106034, 40696976, 40797895, 31106034, 31532499, 34033684, 34520506, 41707354, 31106034, 38431974, 42144909, 281523, 20147046, 26531592, 31106034, 31430246, 33544430, 34520506, 40797895, 26531592, 38431974, 26048408, 38431974, 44560433, 13072802, 16387675, 44560433, 12752176, 12555799, 25793832, 43504928, 44560433, 43504928, 44560433, 44756317, 38380433, 43659943, 21714754, 26048408, 55453801, 26306676, 44744156, 57515200, 56585343, 57515200, 12752176, 31699004, 54744938, 54744938, 44560433], "type": "like", "service": "wordpress"}], "metadata": {"services": [{"username": "A- Teacher", "display_name": "aminusteacher", "service": "wordpress", "service_url": "https://wordpress.com/", "location": {"location_name": "U.S."}, "service_id": 20366461, "profile_url": "http://en.gravatar.com/aminusteacher"}]}}