{"node_id": 21572636, "posts": [{"tags": ["Mudslides", "prophecy", "Earthquakes", "Upheavals", "Sinkholes"], "text": "<p>So I have been sick lately and tried to fight it yesterday to do one more post here&#8230;but it is a time consuming post and my medicine kicked in, so while it is making me better, I&#8217;ll be down for the count till I make up for the sleep I have lost.</p>\n<p>Even so&#8230;I got enough energy for this&#8230;me thinks the earth just got its bell rung again.</p>\n<p>Pakistan was struck with a 7.7 mag. quake, this is the second magnitude 7 quake for Pakistan this year.</p>\n<blockquote><h6><span style=\"color:#333300;\"><strong>Earthchange event:</strong> The 7.7 magnitude oblique-strike-slip earthquake was so powerful, it raised new land out of the Arabian sea.</span></h6>\n<h5><span style=\"color:#3366ff;\"><strong>September 24, 2013</strong> </span>– <span style=\"color:#008000;\"><strong>PAKISTAN</strong> </span>- <span style=\"color:#000019;\">A massive, <span style=\"color:#c10000;\"><strong>7.7</strong></span> magnitude earthquake struck south-central Pakistan on Tuesday afternoon local time. The USGS warns that there will high casualties and economic losses, requiring international response. Seismologists have also confirmed that the quake raised a new island, about 30-40 feet high, off the coast. The island is about half a mile off the coast of Gwadar, in the Arabian Sea. Already, reports the <em>International Herald Tribune</em>, crowds have gathered to see the mountainous, rocky island. Some are claiming it is 100 feet high. It’s not unusual for earthquakes of this magnitude to change the coastline, or even deform the shape of the planet. In 2010, an 8.8 magnitude quake in Chile created new coastlines in that country and changed the shape of the Earth enough to shorten our days by a fraction of a second. Today in Pakistan, estimates of damages are still coming in, and it may be days before we know the full extent of the losses because the quake struck in many regions that are remote. The nearest city to the epicenter is Arawan, where damage is said to be extensive, with houses collapsing and people trapped inside. So far, death tolls hover around 40, but that number is expected to rise as emergency services reach more of the affected areas. The populations near the epicenter may be sparse, but according to the USGS, the problem is that they are extremely vulnerable. <br /></span></h5>\n<h5><span style=\"color:#000019;\">Most homes are made of materials like unreinforced brick masonry, which crumble quickly in quakes and can be deadly. Karachi is another nearby city, with millions of residents, whose homes may have also been affected. People as far away as New Delhi report feeling the quake. The USGS also offers a quick scientific summary of the nature of the quake: The September 24, 2013 M7.7 earthquake in south-central Pakistan occurred as the result of oblique-strike-slip type motion at shallow crustal depths. The location and mechanism of the earthquake are consistent with rupture within the Eurasia plate above the Makran subduction zone. The event occurred within the transition zone between northward subduction of the Arabia plate beneath the Eurasia plate and northward collision of the India plate with the Eurasia plate. The epicenter of the event is 69km north of Awaran, Pakistan, and 270km north of Karachi, Pakistan (population 11.6 million). Right now, as emergency groups gather more information, the best thing we can do is wait to find out more. But it’s very likely that humanitarian aid will be needed, and as soon as we know more we’ll offer an update. –<a href=\"http://io9.com/7-7-magnitude-quake-in-pakistan-just-created-a-new-isla-1377964003\" target=\"_blank\"><span style=\"color:#000019;\"><strong>I09</strong></span></a></span></h5>\n</blockquote>\n<p><a href=\"http://ammi2.files.wordpress.com/2013/09/new-island.jpg\"><img class=\"size-full wp-image\" id=\"i-116\" alt=\"Image\" src=\"https://ammi2.files.wordpress.com/2013/09/new-island.jpg?w=487\" /></a></p>\n", "post_id": 111, "location": false, "date": "09-24-2013", "mentions": [], "extracted_features": {}}, {"tags": ["lightening", "typhoons", "animals", "fish", "roar", "Floods", "locusts", "storms", "ocean", "massive kills", "earth", "climate change", "world", "birds", "thunder", "dolphins"], "text": "<p><a title=\"Secular Reports Of Earthly Upheavals By Month \" href=\"http://www.youtube.com/watch?v=QXUHDJlAF-w&amp;feature=c4-overview&amp;list=UU6Ck6N7gRst7qwkXdapbLaQ\">Secular Reports Of Earthly Upheavals By Month </a></p>\n<p>You shall be visited of the LORD of hosts with thunder, and with earthquake, and great noise, with storm and tempest, and the flame of devouring fire. Isaiah 29</p>\n<p>^ABOVE^ is a link to the video channel of &#8220;fidockave213  AKA  seventhvial213&#8243;  , the vid.s go back almost if not 2 years. He,she,they? Whom ever is putting them together has done a great job of gathering secular reports from around the world. The vid.s tend to be 30-45 minutes long, depending on what all has happened around the world during that particular month. Some months need a part 2. I have linked to April 2013 for you to consider, its a 2 part vid.</p>\n<p>Again the vid.s contain collections of mainstream media reports that rival or surpass the recent 6 months of rain that just fell on Colorado in a few days. That wasn&#8217;t a freak event, in fact its becoming quite common around the world these last few years.</p>\n", "post_id": 144, "location": false, "date": "09-24-2013", "mentions": [], "extracted_features": {}}, {"tags": [], "text": "<p><a href=\"http://ammi2.files.wordpress.com/2013/10/mecca-copy.jpg\"><img class=\"size-full wp-image\" id=\"i-162\" alt=\"Image\" src=\"https://ammi2.files.wordpress.com/2013/10/mecca-copy.jpg?w=650\" /></a></p>\n<p><span class=\"userContent\">Its that time of year again&#8230;.millions of people congregating in what is really a small space considering. Did you know that the bible speaks of its destruction? Did you know that even m<span class=\"text_exposed_show\">uslims expect it to be destroyed?</p>\n<p> The areas spoken of in Habakkuk 3 ( below )&#8230;.include the area of Saudi Arabia. In fact muslims know this and use Hab. 3 to proselytize Christians and Jews. </span></span></p>\n<p><span class=\"userContent\"><span class=\"text_exposed_show\">Specifically they use Hab. 3:3</p>\n<p> 3God came from <strong>Teman</strong>, and the<strong> <em>Holy One</em></strong> from <strong>mount Paran</strong>. Selah. <br /> His glory covered the heavens, and the earth was full of his praise.</p>\n<p> <span style=\"color:#ff0000;\">~*</span>They use it for proof that their god is THE god. But like all false prophets&#8230;they take that verse out of its context. When you read on &#8230;the Lord is coming from that are&#8230;.but He is walking thru it with destruction and pestilence.</p>\n<p> 4And his brightness was as the light; he had horns coming out of his hand: and there was the hiding of his power.<br /> 5Before him went the pestilence, and burning coals went forth at his feet.</p>\n<p> <span style=\"color:#ff0000;\">~*</span>They have been plagued with pestilence lately&#8230;and their volcanoes are waking up too.</p>\n<p> <strong>Saudi Arabia confirms more MERS cases</strong><br /> August 1, 2013 – JEDDAH, SA – Three more confirmed cases of Middle East Respiratory Syndrome (MERS) coronavirus infections in Saudi Arabia have been recorded, the Ministry of Health said on Thursday. A statement posted on the ministry’s website said … Continue reading →</p>\n<p> <strong>Saudi man dies in kingdom from MERS coronavirus: Health Ministry</strong><br /> July 29, 2013 – SAUDI ARABIA – A Saudi man has died of the coronavirus Middle East Respiratory Syndrome (MERS), the Saudi Health Ministry said on Saturday, raising to 39 the number of deaths from the SARS-like virus in the … Continue reading →</p>\n<p><strong><span style=\"color:#ff0000;\"> ~*</span> They are going there and then bringing it back to the countries they live in&#8230;</strong><br /> PLAGUES &amp; PESTILENCES: Global Alert &#8211; WHO Says New &#8211; YouTube<br /> May 2013<br /> <a href=\"http://www.facebook.com/l.php?u=http%3A%2F%2Fwww.youtube.com%2Fwatch%3Fv%3DrXvSayx1DkE&amp;h=hAQE3fWuy&amp;s=1\" target=\"_blank\" rel=\"nofollow nofollow\">http://www.youtube.com/watch?v=rXvSayx1DkE</a></p>\n<p> <strong>Saudi Arabia at risk from rare volcanic earthquakes</strong><br /> <a href=\"http://www.facebook.com/l.php?u=http%3A%2F%2Fwww.scidev.net%2Fglobal%2Fearth-science%2Fnews%2Fsaudi-arabia-at-risk-from-rare-volcanic-earthquakes.html&amp;h=4AQHUWIQI&amp;s=1\" target=\"_blank\" rel=\"nofollow nofollow\">http://www.scidev.net/global/earth-science/news/saudi-arabia-at-risk-from-rare-volcanic-earthquakes.html</a></p>\n<p> <strong>Saudi Arabia to build earthquake shelters – report</strong><br /> <a href=\"http://www.facebook.com/l.php?u=http%3A%2F%2Fwww.arabianbusiness.com%2Fsaudi-arabia-build-earthquake-shelters-report-499015.html&amp;h=4AQHUWIQI&amp;s=1\" target=\"_blank\" rel=\"nofollow nofollow\">http://www.arabianbusiness.com/saudi-arabia-build-earthquake-shelters-report-499015.html</a></p>\n<p> <strong>ANCIENT VOLCANIC FIELD REAWAKENS IN SAUDI ARABIA</strong><br /> In 2009, more than 30,000 earthquakes struck an ancient lava field, opening up a five-mile long crevice. Sensors show that magma has risen to roughly a mile below the surface of the Earth, and eruptions remain possible.<br /> <a href=\"http://www.facebook.com/l.php?u=http%3A%2F%2Fwww.csmonitor.com%2FScience%2F2010%2F0926%2FAncient-volcanic-field-reawakens-in-Saudi-Arabia&amp;h=3AQGu4pro&amp;s=1\" target=\"_blank\" rel=\"nofollow nofollow\">http://www.csmonitor.com/Science/2010/0926/Ancient-volcanic-field-reawakens-in-Saudi-Arabia</a></p>\n<p> <strong>Failed eruption shook Saudi Arabia</strong><br /> <a href=\"http://www.facebook.com/l.php?u=http%3A%2F%2Fwww.nature.com%2Fnews%2F2010%2F100926%2Ffull%2Fnews.2010.494.html&amp;h=dAQHvPOeJ&amp;s=1\" target=\"_blank\" rel=\"nofollow nofollow\">http://www.nature.com/news/2010/100926/full/news.2010.494.html</a></p>\n<p> <strong>Now back to HAB.3</strong></p>\n<p> 6<strong><em>He</em></strong> stood, and measured the earth: he beheld, and <strong>drove asunder the nations</strong>; and the everlasting <strong>mountains were scattered</strong>, the perpetual<strong> hills did bow</strong>: his ways are everlasting.</p>\n<p> 7I saw the tents of <strong>Cushan in affliction</strong>: and the curtains of the <strong>land of Midian</strong> did tremble.</p>\n<p> 8Was the LORD displeased against the rivers? was thine anger against the rivers? was thy wrath against the sea, that thou didst ride upon thine horses and thy chariots of salvation?</p>\n<p> 9Thy bow was made quite naked, according to the oaths of the tribes, even thy word. Selah. Thou didst <strong>cleave the earth with rivers</strong>.</p>\n<p> 10The <strong>mountains saw thee, and they trembled</strong>: the <span style=\"text-decoration:underline;\">overflowing of the water passed by</span>: the <span style=\"text-decoration:underline;\">deep uttered his voice</span>, and <span style=\"text-decoration:underline;\">lifted up</span> his hands on high.</p>\n<p> 11The<strong> sun and moon stood still</strong> in their habitation: at the<strong> light of thine arrows</strong> they went, and at the shining of <strong>thy glittering spear</strong>.</p>\n<p> 12Thou didst <strong>march through the land</strong> in indignation, thou didst <strong>thresh the heathen</strong> in anger.</p>\n<p> 13Thou went forth <em><strong>for the salvation of thy people</strong></em>, even for <em><strong> salvation with thine anointed</strong></em>;</span></span></p>\n<p><span class=\"userContent\"><span class=\"text_exposed_show\">thou <strong>wounded the head</strong> out of the house <strong>of the wicked</strong>, by discovering the foundation unto the neck. Selah.</p>\n<p> 14Thou didst <strong>strike through with his staves</strong> <span style=\"text-decoration:underline;\">the head of his villages</span>: <span style=\"color:#ff0000;\">they came out as a whirlwind to scatter me: their rejoicing was as to devour the poor secretly</span>.</p>\n<p> 15Thou didst walk through the sea with thine horses, through the heap of great waters.</p>\n<p> 16When I heard, my belly trembled; my lips quivered at the voice: rottenness entered into my bones, and I trembled in myself, that I might rest in the day of trouble: <span style=\"color:#ff0000;\">when he cometh up unto the people, he will invade them with his troops.</span></p>\n<p> Habakkuk Rejoices</p>\n<p> 17Although the fig tree shall not blossom, neither shall fruit be in the vines; the labour of the olive shall fail, and the fields shall yield no meat; the flock shall be cut off from the fold, and there shall be no herd in the stalls:</p>\n<p> 18<span style=\"text-decoration:underline;\"><strong>Yet I will rejoice in the LORD, I will joy in the God of my salvation.</strong></span></p>\n<p> 19<em><strong>The LORD God is my strength, and he will make my feet like hinds&#8217; feet, and he will make me to walk upon mine high places.</strong></em> To the chief singer on my stringed instruments.</p>\n<p><span style=\"color:#ff6600;\"> <strong>The Hajj Pilgrimage At A Glance</strong></span><br /> <a href=\"http://www.huffingtonpost.com/2013/10/11/hajj-2013_n_4064513.html?ref=topbar\" target=\"_blank\" rel=\"nofollow nofollow\">http://www.huffingtonpost.com/2013/10/11/hajj-2013_n_4064513.html?ref=topbar</a></span></span></p>\n<p> </p>\n", "post_id": 160, "location": false, "date": "10-12-2013", "mentions": [], "extracted_features": {}}, {"tags": ["mark 13", "bible", "christian", "fire", "thunder", "matthew 24", "storm", "prophecy", "earthquake"], "text": "<h5 class=\"uiStreamMessage userContentWrapper\"><span class=\"messageBody\"><span class=\"userContent\">You shall be visited of the LORD of hosts with thunder, and with earthquake, and great noise, with storm and tempest, and the flame of devouring fire. Isaiah 29</span></span></h5>\n<p>When I began studying bible prophecy a little over ten years ago, the IRIS Seismic Monitor was still pretty quiet, I would go to the site and at most find a few circles, here and there, that marked an earthquake. But these days its constantly lit up like the Vegas strip, and they are small, medium and large ,&#8221;in various places&#8221; all over the globe. And the area that is covered by these circles is growing by the year.</p>\n<p>But don&#8217;t take my word for it, see for yourself.</p>\n<p><a href=\"http://www.iris.edu/seismon/\" rel=\"nofollow\">http://www.iris.edu/seismon/</a></p>\n<p>At that time scientist where dismissing the seeming uptick in earthquakes as a by product of better surveillance, not only better monitors, but more of them. A reasonable conclusion that no one could really question,especially those pesky christians, who everyone knows expected earthquakes to not only become more frequent but more destructive too.</p>\n<p>This remained a reasonable and satisfactory answer from them, for anyone who asked, until the <span class=\"st\"><em>2004</em> Indian Ocean <em>earthquake. </em>That quake not only rung the earth like a bell, it set off alarms in the science community and forced them to sit up and take notice. It wasn&#8217;t too long after that , when I began to hear their whispers on the internet , &#8220;there is more this than meets the eye&#8221;<strong> </strong> and soon it was clear that their answer of &#8221; bigger and better tech &#8221; was no longer adequate for them either. And they had to begrudgingly admit that yes the earthquakes were happening more frequently and that they had no good reason for what was going on. </span></p>\n<p><span class=\"st\">From then on they could only bite their tongues when the christian pointed to, for instance, the prophecy in Matt. 24 as the answer, because they couldn&#8217;t reasonably refute it any more, thanks to Google Earth and the IRIS Monitoring site.</span></p>\n<header class=\"content-head\">\n<h1>Geoscientists find clues to why first Sumatran earthquake was deadlier than second</h1>\n<h5 class=\"data\">Jul 08, 2010  <a href=\"http://phys.org/news197815460.html\" rel=\"nofollow\">http://phys.org/news197815460.html</a></h5>\n<p>&#8220;When you hear of wars and rumors of wars, do not be frightened; those things must take place; but that is not yet the end.</p>\n<p><span class=\"highl\">&#8220;For nation will rise up against nation, and kingdom against kingdom; there will be earthquakes in various places; there will also be famines. </span></p>\n<p><span class=\"highl\">These things are merely the beginning of birth pangs. </span><br />Mark 13</p>\n</header>\n<p><span class=\"st\"><a href=\"http://ammi2.files.wordpress.com/2013/09/23694.jpg\"><img class=\"size-full wp-image\" id=\"i-79\" alt=\"Image\" src=\"https://ammi2.files.wordpress.com/2013/09/23694.jpg?w=650\" /></a><em> <br /></em></span></p>\n", "post_id": 18, "location": false, "date": "09-23-2013", "mentions": [], "extracted_features": {}}, {"tags": [], "text": "<p><a title=\"ACCORDING TO GEOLOGY AND PROPHECY THE LEVANT IS A POWDER KEG\" href=\"http://www.timesofisrael.com/strong-earthquake-in-crete-felt-in-israel-egypt/\">ACCORDING TO GEOLOGY AND PROPHECY THE LEVANT IS A POWDER KEG</a></p>\n<hgroup>\n<h1 class=\"headline\">Strong earthquake in Crete felt in Israel, Egypt</h1>\n<h1 class=\"headline\"></h1>\n<h2 class=\"underline\">US Geological Survey registers quake of 6.4 magnitude in Mediterranean; reports of damage to buildings but no injuries. The earthquake was also felt in Athens. Greece is often struck by earthquakes. In 1999, 143 people were killed after a quake of 5.9 magnitude was felt in Athens. More than 100 buildings had collapsed as a result.</h2>\n</hgroup>\n", "post_id": 180, "location": false, "date": "10-12-2013", "mentions": [], "extracted_features": {}}, {"tags": [], "text": "<div class=\"aboveUnitContent\">\n<div class=\"userContentWrapper\">\n<div class=\"_wk\">\n<blockquote>\n<div class=\"text_exposed_root text_exposed\" id=\"id_525aac18e23396843882796\">While the Pharisees were gathered together, Jesus asked them,<br />\n“What do you think about the Messiah? Whose son is he?”</div>\n<div class=\"text_exposed_root text_exposed\"></div>\n<div class=\"text_exposed_root text_exposed\"><span class=\"text_exposed_show\"><span class=\"text_exposed_show\">“The son of David,” they replied.</span></span></div>\n<div class=\"text_exposed_root text_exposed\"><span style=\"color:#000000;\">He said to them, “How is it then that David, speaking by the Spirit, calls him ‘Lord’? </span></div>\n<div class=\"text_exposed_root text_exposed\"></div>\n<div class=\"text_exposed_root text_exposed\"><span style=\"color:#000000;\"><span style=\"color:#000000;\"><span class=\"text_exposed_show\">For he says, “‘The Lord said to my Lord: “Sit at my right hand until I put your enemies under your feet.”’</span></span></span></div>\n<div class=\"text_exposed_root text_exposed\"><span style=\"color:#000000;\"><span style=\"color:#000000;\"><span class=\"text_exposed_show\"><br />\n45 If then David calls him ‘Lord,’ how can he be his son?”</span></span></span></div>\n<div class=\"text_exposed_root text_exposed\"></div>\n<div class=\"text_exposed_root text_exposed\">46 No one could say a word in reply,<br />\nAnd from that day on no one dared to ask him any more questions.</div>\n<div class=\"text_exposed_root text_exposed\"><span style=\"color:#000000;\"><span class=\"text_exposed_show\"><span class=\"userContent\"><span class=\"text_exposed_show\">Matthew 22</span></span></span></span></div>\n</blockquote>\n<div class=\"text_exposed_root text_exposed\">SORRY ABOUT THE ^MESS^ ILL GET THE HANG OF THIS SOON</div>\n<div class=\"text_exposed_root text_exposed\"></div>\n<div class=\"text_exposed_root text_exposed\"></div>\n<div class=\"text_exposed_root text_exposed\"></div>\n<div class=\"text_exposed_root text_exposed\"></div>\n<div class=\"text_exposed_root text_exposed\"><em><strong><span class=\"text_exposed_show\"><span class=\"text_exposed_show\">~*All day long you&#8217;re transmitting to the people around you. Does it sound like Jesus? When you have surrendered the transmitter to Christ, then He is really in charge. *~</span></span></strong></em></div>\n<div class=\"text_exposed_root text_exposed\"></div>\n<div class=\"text_exposed_root text_exposed\"></div>\n<div class=\"text_exposed_root text_exposed\"><span style=\"color:#000000;\">Exodus 4:12</span><br />\n<span style=\"color:#000000;\"> Now go; I will help you speak and will teach you what to say.&#8221;</span></div>\n<div class=\"text_exposed_root text_exposed\"></div>\n<div class=\"text_exposed_root text_exposed\"><span style=\"color:#000000;\">Ezekiel 29:21</span><br />\n<span style=\"color:#000000;\"> &#8220;On that day I will make a horn grow for the Israelites, and I will open your mouth among them. Then they will know that I am the LORD.&#8221;</span></div>\n<div class=\"text_exposed_root text_exposed\"></div>\n<div class=\"text_exposed_root text_exposed\"></div>\n<div class=\"text_exposed_root text_exposed\"><span style=\"color:#000000;\">Luke 12:12</span><br />\n<span style=\"color:#000000;\"> for the Holy Spirit will teach you at that time what you should say.&#8221;</span><span style=\"color:#000000;\"> 14&#8243;So make up your minds not to prepare beforehand to defend yourselves; for I will give you utterance and wisdom which none of your opponents will be able to resist or refute. Luke 21</span></p>\n<p><span style=\"color:#000000;\"> 17 No weapon that is formed against thee shall prosper; and every tongue that shall rise against thee in judgment thou shalt condemn.</span></p>\n<p><span style=\"color:#000000;\"> This is the heritage of the servants of the Lord, and their righteousness is of me, saith the Lord. Isaiah 54</span></p>\n<p><span style=\"color:#000000;\"> Luke 21:13</span><br />\n<span style=\"color:#000000;\"> And so you will bear testimony to me.</span></p>\n<p><em><strong>Jesus Prays for His Disciples&#8230;THEN AND NOW</strong></em></p>\n<p><span style=\"color:#000000;\">6“I have revealed you to those whom you gave me out of the world. They were yours; you gave them to me and they have obeyed your word. Now they know that everything you have given me comes from you. For I gave them the words you gave me and they accepted them. They knew with certainty that I came from you, and they believed that you sent me. </span></p>\n</div>\n<div class=\"text_exposed_root text_exposed\">\n<p><span class=\"text_exposed_show\"><span class=\"text_exposed_show\"><span style=\"color:#000000;\">I pray for them.</span></span></span><span style=\"color:#000000;\"> I am not praying for the world, but for those you have given me, for they are yours. 10All I have is yours, and all you have is mine. And glory has come to me through them. 11I will remain in the world no longer, but they are still in the world, and I am coming to you.</span><span style=\"color:#000000;\"> Holy Father, protect them by the power of your name, the name you gave me, so that they may be one as we are one. 12While I was with them, I protected them and kept them safe by that name you gave me. None has been lost except the one doomed to destruction so that Scripture would be fulfilled.</span></p>\n<p><span style=\"color:#000000;\"> 13“I am coming to you now, but I say these things while I am still in the world, so that they may have the full measure of my joy within them. 14I have given them your word and the world has hated them, for they are not of the world any more than I am of the world.</span></p>\n<p><span style=\"color:#000000;\"> 15My prayer is not that you take them out of the world but that you protect them from the evil one.</span></p>\n<p><span style=\"color:#000000;\"> 16They are not of the world, even as I am not of it.</span></p>\n<p><span style=\"color:#000000;\"> 17Sanctify them by the truth; your word is truth. 18As you sent me into the world, I have sent them into the world.</span></p>\n<p><span style=\"color:#000000;\"> 19For them I sanctify myself, that they too may be truly sanctified.</span></p>\n<p>Jesus Prays for All Believers</p>\n<p><span style=\"color:#000000;\">20“My prayer is not for them alone.</span></p>\n<p><span style=\"color:#000000;\"> I pray also for those who will believe in me through their message, that all of them may be one, Father, just as you are in me and I am in you.</span></p>\n<p><span style=\"color:#000000;\"> May they also be in us&#8230; so that the world may believe&#8230; that you have sent me.</span></p>\n<p><span style=\"color:#000000;\"> 22I have given them the glory that you gave me, that they may be one as we are one— I in them and you in me—so that they may be brought to complete unity.</span></p>\n<p><span style=\"color:#000000;\"> Then the world will know&#8230;. that you sent me&#8230;. and have loved them&#8230; even as you have loved me.</span></p>\n<p>&nbsp;</p>\n<p><em><strong>IF WE ARE TRANSMITTING HIS WORDS&#8230;NOT OUR OPINION OF THEM&#8230; THEN NO ONE CAN GAINSAY OR RESIST&#8230;ALL THAT IS LEFT FOR THEM&#8230;.IS TO SHUT US UP WITH DEATH. AND THIS OPTION THEY HATE TO RESORT TO BECAUSE IT ONLY FURTHERS OUR CAUSE.</strong></em></p>\n</div>\n</div>\n</div>\n</div>\n<div class=\"photoUnit clearfix\"></div>\n", "post_id": 187, "location": false, "date": "10-13-2013", "mentions": [], "extracted_features": {}}, {"tags": [], "text": "<p>I BELIEVE THE # 79 IN THE ARTICLE BELOW INDICATES THE NUMBER OF VOLCANO&#8217;S THAT HAVE ERUPTED THIS YEAR&#8230;.OR THAT ARE ERUPTING RIGHT NOW. WILL LOOK INTO THAT.</p>\n<p>THE READ LINE RUNNING UP THE MIDDLE OF THE RED SEA INTERSECTS WITH THE JORDAN RIFT aka DEAD SEA TRANSFORM.</p>\n<p> SOME INSIGHT TO THE RED SEA FIRST&#8230;SEE EMBEDDED LINKS FOR DEEPER STUDY</p>\n<blockquote><p><span style=\"color:#003366;\">The <b>Red Sea Rift</b> is a spreading center between two <a class=\"mw-redirect\" title=\"Tectonic plate\" href=\"https://www.facebook.com/pages/Tectonic-plate/111797322171986\"><span style=\"color:#003366;\">tectonic plates</span></a>, the <a title=\"African Plate\" href=\"https://www.facebook.com/pages/African-Plate/137556016274467\"><span style=\"color:#003366;\">African Plate</span></a> and the <a title=\"Arabian Plate\" href=\"https://www.facebook.com/pages/Arabian-Plate/126335957409263\"><span style=\"color:#003366;\">Arabian Plate</span></a>. It extends down the length of the <a title=\"Red Sea\" href=\"https://www.facebook.com/pages/Red-Sea/104098302959292\"><span style=\"color:#003366;\">Red Sea</span></a>, stretching from the southern end of the <a title=\"Dead Sea Transform\" href=\"https://www.facebook.com/pages/Dead-Sea-Transform/132715430097201\"><span style=\"color:#003366;\">Dead Sea Transform</span></a> to a <a title=\"Triple junction\" href=\"https://www.facebook.com/pages/Triple-junction/110207509029666\"><span style=\"color:#003366;\">triple junction</span></a> with the <a title=\"Aden Ridge\" href=\"https://www.facebook.com/pages/Aden-Ridge/137760912913387\"><span style=\"color:#003366;\">Aden Ridge</span></a> and the <a title=\"East African Rift\" href=\"https://www.facebook.com/pages/East-African-Rift/132057466830382\"><span style=\"color:#003366;\">East African Rift</span></a> (the <a title=\"Afar Triple Junction\" href=\"https://www.facebook.com/pages/Afar-Triple-Junction/138168609538717\"><span style=\"color:#003366;\">Afar Triple Junction</span></a>) in the <a class=\"mw-redirect\" title=\"Afar Depression\" href=\"https://www.facebook.com/pages/Afar-Depression/132493956788972\"><span style=\"color:#003366;\">Afar Depression</span></a> of eastern <a title=\"Africa\" href=\"https://www.facebook.com/pages/Africa/109532132406338\"><span style=\"color:#003366;\">Africa</span></a>.</span></p>\n<p><span style=\"color:#003366;\">The rift zone includes the island of <a class=\"mw-redirect\" title=\"Jabal al-Tair\" href=\"https://www.facebook.com/pages/Jabal-al-Tair/123247747720007\"><span style=\"color:#003366;\">Jabal al-Tair</span></a>, formed by the basaltic stratovolcano of the same name, located northwest of the <a class=\"mw-redirect\" title=\"Bab al-Mandab\" href=\"https://www.facebook.com/pages/Bab-al-Mandab/142312555785986\"><span style=\"color:#003366;\">Bab al-Mandab</span></a> passage at the mouth of the <a title=\"Red Sea\" href=\"https://www.facebook.com/pages/Red-Sea/104098302959292\"><span style=\"color:#003366;\">Red Sea</span></a>, about half way between <a title=\"Yemen\" href=\"https://www.facebook.com/pages/Yemen/105726662794640\"><span style=\"color:#003366;\">Yemen</span></a> and <a title=\"Eritrea\" href=\"https://www.facebook.com/pages/Eritrea/103427776356132\"><span style=\"color:#003366;\">Eritrea</span></a>. The volcano erupted on 30 September 2007, after 124 years of <a class=\"mw-redirect\" title=\"Dormant volcano\" href=\"http://en.wikipedia.org/wiki/Dormant_volcano\" target=\"_blank\" rel=\"nofollow\"><span style=\"color:#003366;\">dormancy</span></a>.</span></p>\n<p><span style=\"color:#003366;\">The axial deep of the rift was the location of the first known hot <a title=\"Hydrothermal vent\" href=\"https://www.facebook.com/pages/Hydrothermal-vent/107797579250425\"><span style=\"color:#003366;\">hydrothermal brines</span></a> discovered on the sea floor. Workers from 1949 through the 1960s confirmed the presence of hot, 60 °C, saline brines and associated metalliferous muds. The hot solutions were emanating from an active subseafloor <a class=\"mw-redirect\" title=\"Rift (geology)\" href=\"https://www.facebook.com/pages/Rift-geology/106216486081051\"><span style=\"color:#003366;\">rift</span></a>.</span></p>\n</blockquote>\n<h2 class=\"entry-title\"> </h2>\n<h2 class=\"entry-title\"><a href=\"http://theextinctionprotocol.wordpress.com/2013/10/13/79-jebel-zubair-volcano-erupts-in-the-red-sea/\" rel=\"bookmark\">79: Jebel Zubair volcano erupts in the Red Sea</a></h2>\n<h5><span style=\"color:#3366ff;\"><b>October 13, 2013</b></span> –<span style=\"color:#008000;\"><strong>SAUDI ARABIA</strong> </span>— <span style=\"color:#000019;\">As of today, the submarine eruption continues with the production of a steam plume of variable size, not always easily identifiable on satellite images. A SO2 plume is also visible on satellite data drifting from the eruption site. No ash can be seen on satellite imagery, only steam, and the area of discolored water (indicator of suspended particles) is small if not has disappeared. That suggests that the eruption is currently rather weak and probably has not yet entered the so-called surtseyan phase where solid fragments (ash, lava blocks) are ejected above the surface of the sea. –<a href=\"http://www.volcanodiscovery.com/volcano-activity/news/37910/Volcanic-activity-worldwide-12-Oct-2013-Klyuchevskoy-Soufriere-Hills-Jebel-Zubair.html\" target=\"_blank\"><span style=\"color:#000019;\"><strong>Volcano Discovery</strong></span></a></span></h5>\n<p><a href=\"http://theextinctionprotocol.wordpress.com/2013/10/13/79-jebel-zubair-volcano-erupts-in-the-red-sea/\" rel=\"nofollow\">http://theextinctionprotocol.wordpress.com/2013/10/13/79-jebel-zubair-volcano-erupts-in-the-red-sea/</a><a href=\"http://ammi2.files.wordpress.com/2013/10/kkdeailed_map.gif\"><img class=\"size-full wp-image\" id=\"i-204\" alt=\"Image\" src=\"https://ammi2.files.wordpress.com/2013/10/kkdeailed_map.gif?w=650\" /></a></p>\n", "post_id": 199, "location": false, "date": "10-13-2013", "mentions": [], "extracted_features": {}}, {"tags": ["Fire brimstone pyroclastic flows last days lords return prophecy end times rome"], "text": "<h1 class=\"entry-title single-entry-title\">Vesuvius: Avenger of Jerusalem</h1>\n<p><span style=\"color:#000000;\">While reading pondering the information Im providing here keep in mind that Simcha Jacobovici is Jewish thus has funny ideas about Christians so a biblical lens is required. Having said that, I haven&#8217;t made up my mind yet whether or not his animosity is genuine or feigned, mostly because he is teamed up with of all things , a christian named James Tabor.</span></p>\n<p><span style=\"color:#000000;\">So with all that said&#8230;I agree with  Simcha&#8217;s  conclusion that Vesuvius was the wrath of God practiced against the Romans. For one, Pompeii was named after a roman general who desecrated the temple and too, the Romans were persecuting God&#8217;s people, on top of destroying the place by His name, the footstool of His throne and the apples of His eye.</span>     </p>\n<blockquote><p><span style=\"color:#003366;\"><span class=\"reftext\"><a href=\"http://biblehub.com/zechariah/1-14.htm\"><span style=\"color:#003366;\">14</span></a></span>So the angel who was speaking with me said to me, &#8220;Proclaim, saying, &#8216;Thus says the LORD of hosts, &#8220;I am exceedingly jealous for Jerusalem and Zion. <span class=\"reftext\"><a href=\"http://biblehub.com/zechariah/1-15.htm\"><span style=\"color:#003366;\">15</span></a></span><span class=\"highl\">&#8220;But I am very angry with the nations who are at ease; for while I was only a little angry, they furthered the disaster.&#8221;</span> <span class=\"reftext\"><a href=\"http://biblehub.com/zechariah/1-16.htm\"><span style=\"color:#003366;\">16</span></a></span>&#8216;Therefore thus says the LORD, &#8220;I will return to Jerusalem with compassion; My house will be built in it,&#8221; declares the LORD of hosts, &#8220;and a measuring line will be stretched over Jerusalem.&#8221;&#8216;</span></p>\n</blockquote>\n<p><span style=\"color:#000000;\">What happened to Pompeii is completely in line with what God did to the Egyptians, the Assyrians and the Babylonians. While Simcha and Tabor think it was an eye witness account of whats written in revelation, I disagree. I say what happened was a foreshadowing of what will come upon Mystery Babylon. There is nothing new under the sun, what has been shall be, it is written.</span></p>\n<p><span style=\"color:#000000;\">THE DESTRUCTION OF POMPEII</span><br /><a href=\"http://www.simchajtv.com/vesuvius-the-first-apostle/\" rel=\"nofollow\">http://www.simchajtv.com/vesuvius-the-first-apostle/</a></p>\n<p><span style=\"color:#000000;\">You will find a link to their documentary here at Tabors blog. Again enter with a biblical lens so you can test all things and rightly divide because while I only read the one article by him, I get the distinct impression that he thinks all of revelation has been fulfilled.</span> </p>\n<h1 class=\"entry-title\">The Destruction of Pompeii and the New Testament Book of Revelation</h1>\n<p><a href=\"http://jamestabor.com/2013/10/09/the-destruction-of-pompei-and-the-new-testament-book-of-revelation/\" rel=\"nofollow\">http://jamestabor.com/2013/10/09/the-destruction-of-pompei-and-the-new-testament-book-of-revelation/</a></p>\n<p> <span style=\"color:#000000;\">Pompeii and its citizens weren&#8217;t the only ones destroyed at that time, Herculaneum was a sister city that was also buried under the wrath of God. The heat was so intense that their brains literally boiled.  I know TMI but &#8230;they were instantly vaporized. (see video below)</span></p>\n<p><span style=\"color:#993300;\"><span style=\"font-family:Arial;\">A <b><i>pyroclastic flow: </i></b>is a fluidized mixture of solid to semi-solid fragments and hot, expanding gases that flows down the flank of a volcanic edifice. These awesome features are heavier-than-air emulsions that move much like a snow avalanche, except that they are fiercely hot, contain toxic gases, and move at phenomenal, hurricane-force speeds, often over 100 km/hour. They are the most deadly of all volcanic phenomena.</span></span></p>\n<p><span style=\"color:#000000;\">There was something about the description of the way they perished that sounded so familiar. Where had I heard of people perishing in a similar manner before? Then I remembered were I had heard about people melting, I had read it in Zechariah 14</span></p>\n<blockquote><p><span style=\"color:#003366;\"><span class=\"reftext\"><a href=\"http://biblehub.com/zechariah/14-12.htm\"><span style=\"color:#003366;\"><b>12</b></span></a></span>And this shall be the plague wherewith the LORD will smite all the people that have fought against Jerusalem; Their flesh shall consume away while they stand upon their feet, and their eyes shall consume away in their holes, and their tongue shall consume away in their mouth.</span></p>\n<p><span style=\"color:#003366;\"><span class=\"reftext\"><a href=\"http://biblehub.com/zechariah/14-13.htm\"><span style=\"color:#003366;\"><b>13</b></span></a></span>And it shall come to pass in that day, <i>that</i> a great tumult from the LORD shall be among them; and they shall lay hold every one on the hand of his neighbor, and his hand shall rise up against the hand of his neighbor. </span></p>\n<p><span style=\"color:#003366;\"><span class=\"reftext\"><a href=\"http://biblehub.com/zechariah/14-14.htm\"><span style=\"color:#003366;\"><b>14</b></span></a></span>And Judah also shall fight at Jerusalem; and the wealth of all the heathen round about shall be gathered together, gold, and silver, and apparel, in great abundance. </span></p>\n<p><span style=\"color:#003366;\"><span class=\"reftext\"><a href=\"http://biblehub.com/zechariah/14-15.htm\"><span style=\"color:#003366;\"><b>15</b></span></a></span>And so shall be the plague of the horse, of the mule, of the camel, and of the ass, and of all the beasts that shall be in these tents, as this plague.</span></p>\n</blockquote>\n<p><span style=\"color:#000000;\">Interestingly I was&#8217;nt the first to associate Zechariah 14 with the destruction of a people by &#8220;melting&#8221; them in a fiery heat. A connection between Zechariah 14 had also come to mind in the aftermath of Nagasaki and Hiroshima. Now you know why so many people today think that Israel will be the victim of a nuclear war. And it was a legitimate leap considering that most people had never seen the aftermath of a pyroclastic flow. But just as God is consistent in how He dealt with the nations that came against His people and His land. He is also consistent in how He destroys and we are told that last time it was with water but when He returns this time&#8230;its going to be with fire.</span> <span style=\"color:#000000;\">And while He is perfectly capable of cleaning up a nuclear mess made by men, it is the footstool of His Glorious Throne.</span> </p>\n<blockquote><p><span style=\"color:#003366;\"><span class=\"reftext\"><a href=\"http://biblehub.com/isaiah/47-14.htm\"><span style=\"color:#003366;\">14</span></a></span><span class=\"highl\">&#8220;Behold, they have become like stubble, Fire burns them; They cannot deliver themselves from the power of the flame; There will be no coal to warm by Nor a fire to sit before!</span> <span class=\"reftext\"><a href=\"http://biblehub.com/isaiah/47-15.htm\"><span style=\"color:#003366;\">15</span></a></span>&#8220;So have those become to you with whom you have labored, Who have trafficked with you from your youth; Each has wandered in his own way; There is none to save you. Isaiah 47</span></p>\n<p><span style=\"color:#003366;\"><span class=\"reftext\"><a href=\"http://biblehub.com/isaiah/66-15.htm\"><span style=\"color:#003366;\">15</span></a></span><span class=\"highl\">For behold, the LORD will come in fire And His chariots like the whirlwind, To render His anger with fury, And His rebuke with flames of fire.</span> <span class=\"reftext\"><a href=\"http://biblehub.com/isaiah/66-16.htm\"><span style=\"color:#003366;\">16</span></a></span>For the LORD will execute judgment by fire And by His sword on all flesh, And those slain by the LORD will be many. Isaiah 66:15</span></p>\n</blockquote>\n<h1> </h1>\n<p><span style=\"color:#000000;\">In the image below you see the outline of the people who where overcome by the pyroclastic flow along with mud and ash. Their bodies encased in ash and mud that hardened and set all around them so that when they were finally discovered, the archeologist were able to pour cement into the voids left by their bodies.</span></p>\n<p><span style=\"color:#000000;\">Here is an account of what happened along with information on volcano&#8217;s and pyroclastic flows</span></p>\n<p><span style=\"color:#000000;\"><span style=\"font-family:Verdana, Arial, Helvetica, sans-serif;font-size:300%;\"><b><span style=\"text-decoration:underline;\">Mount Vesuvius: Not Just Another Volcano</span></b></span></span></p>\n<p><a href=\"http://mountvesuvius.tripod.com/\" rel=\"nofollow\">http://mountvesuvius.tripod.com/</a></p>\n<p>A video</p>\n<h1 class=\"yt\" id=\"watch-headline-title\"><span class=\"watch-title long-title yt-uix-expander-head\" dir=\"ltr\" id=\"eow-title\" title=\"The Other Pompeii: Life and Death in Herculaneum HD\">The Other Pompeii: Life and Death in Herculaneum HD </span></h1>\n<p><a href=\"http://www.youtube.com/watch?v=1ItRttO8YeY\" rel=\"nofollow\">http://www.youtube.com/watch?v=1ItRttO8YeY</a></p>\n<h3 class=\"r\"><span style=\"color:#000000;\"><a href=\"http://www.google.com/url?sa=t&amp;rct=j&amp;q=&amp;esrc=s&amp;source=web&amp;cd=9&amp;cad=rja&amp;ved=0CF4QtwIwCA&amp;url=http%3A%2F%2Fscience.howstuffworks.com%2Fnature%2F7153-volcanoes-pyroclastic-flow-video.htm&amp;ei=EnlbUvigH8mE2wXsi4HYDg&amp;usg=AFQjCNFNDnIbmBVxKYzsVB5dY6hxcYb8Sw&amp;sig2=FC2oKSSm2-krglTYQWPXQA&amp;bvm=bv.53899372,d.b2I\"><span style=\"color:#000000;\">HowStuffWorks &#8220;Volcanoes: </span></a></span><a href=\"http://www.google.com/url?sa=t&amp;rct=j&amp;q=&amp;esrc=s&amp;source=web&amp;cd=9&amp;cad=rja&amp;ved=0CF4QtwIwCA&amp;url=http%3A%2F%2Fscience.howstuffworks.com%2Fnature%2F7153-volcanoes-pyroclastic-flow-video.htm&amp;ei=EnlbUvigH8mE2wXsi4HYDg&amp;usg=AFQjCNFNDnIbmBVxKYzsVB5dY6hxcYb8Sw&amp;sig2=FC2oKSSm2-krglTYQWPXQA&amp;bvm=bv.53899372,d.b2I\"><em>Pyroclastic Flow</em></a><a href=\"http://www.google.com/url?sa=t&amp;rct=j&amp;q=&amp;esrc=s&amp;source=web&amp;cd=9&amp;cad=rja&amp;ved=0CF4QtwIwCA&amp;url=http%3A%2F%2Fscience.howstuffworks.com%2Fnature%2F7153-volcanoes-pyroclastic-flow-video.htm&amp;ei=EnlbUvigH8mE2wXsi4HYDg&amp;usg=AFQjCNFNDnIbmBVxKYzsVB5dY6hxcYb8Sw&amp;sig2=FC2oKSSm2-krglTYQWPXQA&amp;bvm=bv.53899372,d.b2I\">&#8220;</a></h3>\n<p><a href=\"http://science.howstuffworks.com/nature/7153-volcanoes-pyroclastic-flow-video.htm\" rel=\"nofollow\">http://science.howstuffworks.com/nature/7153-volcanoes-pyroclastic-flow-video.htm</a><br /><a href=\"http://ammi2.files.wordpress.com/2013/10/tumblr_lanz3u0kid1qzgcpyo1_400.jpg\"><img class=\"size-full wp-image\" id=\"i-241\" alt=\"Image\" src=\"https://ammi2.files.wordpress.com/2013/10/tumblr_lanz3u0kid1qzgcpyo1_400.jpg?w=390\" /></a></p>\n", "post_id": 218, "location": false, "date": "10-14-2013", "mentions": [], "extracted_features": {}}, {"tags": [], "text": "<p> <br /><span style=\"color:#000000;\">Speaking of FLAT EARTHERS, did the church really teach that the earth was flat as so many are taught today? Did you know that no one before the 1830s believed that THE medieval CHURCH  and its people thought that the earth was flat? </span></p>\n<p><span style=\"color:#000000;\">Would you believe that it was no other than our beloved storyteller Washington Irving (1783-1859) who started the rumor?</span></p>\n<p><span style=\"color:#000000;\">Trust me on this, its a fact&#8230;.yet so call &#8221; intellectuals &#8221; keep attributing it to the church and Columbus is celebrated for something he didnt do ( save us MODERNS from flat earth fear) to this very day? </span><br /><span style=\"color:#000000;\">I know right&#8230;Im embarrassed for them too.</span></p>\n<p><span style=\"color:#000000;\">BUT I will ADMIT SOME CHURCHES EVEN BELIEVE IT AND TEACH IT</span><br /><span style=\"color:#000000;\">Yet&#8230;it got its legs as true history by those who wanted to smear the church.</span><br /><span style=\"color:#000000;\">No wonder His people are destroyed for lack of knowledge.</span></p>\n<p><span style=\"color:#000000;\">While the churches are without excuse&#8230;gotta have a little mercy on them.</span><br /><span style=\"color:#000000;\">Ignorance is ignorance&#8230;.</span><br /><span style=\"color:#000000;\">SCHOOLS/UNIVERSITIES TEACH IT THIS DAY&#8230;yet it has been proven wrong in every way.</span></p>\n<p><span style=\"color:#000000;\">Will you help me use this Columbus Day 2013 to set the record straight? </span></p>\n<p><span style=\"color:#000000;\">Help me hang the &#8220;flat earther&#8221; moniker around the neck of those to whom it actually belongs&#8230;the history and science teachers (I use the title teacher loosely) to which it belongs. They are the only ones who have believed it thus teach it. </span>But dont take my word for it&#8230;</p>\n<p><span style=\"color:#800000;\">Contra Mundum: The Flat-Earth Myth</span><br /><span style=\"color:#000000;\">~*At a philosophy conference at Otago University, shortly after I graduated, I recall one speaker using the example of “medieval flat-earthers” in his paper as an example of an irrational belief. Almost everyone in attendance nodded their heads in agreement; no one contested the historical assumptions implicit in the example. More recently Victoria University ran a slick television campaign stating that in the 14th century most people believed the world was flat. The ad showed a picture of a boat sailing across the sea only to fall over the side of the earth and concluded “It makes you think.”</span></p>\n<p><span style=\"color:#000000;\">It is true that I did learn this story at school and that I have read it in more than one history textbook but because I took the time to research the history of theology when I was at university I know that this story is fiction. It is a slanderous fabrication invented by opponents of Christianity in the 19th century and has been thoroughly debunked by contemporary historians of science.</span></p>\n<p><span style=\"color:#000000;\">The definitive study is undoubtedly that of Jeffrey Burton Russell in Inventing the Flat Earth: Columbus and Modern Historians. Russell summarised his findings, in a paper presented to the 1997 American Scientific Affiliation Conference, as follows,</span></p>\n<p><span style=\"color:#000000;\">    [W]ith extraordinary few exceptions no educated person in the history of Western Civilization from the third century B.C. onward believed that the earth was flat. A round earth appears at least as early as the sixth century BC with Pythagoras, who was followed by Aristotle, Euclid, and Aristarchus, among others in observing that the earth was a sphere. Although there were a few dissenters—Leukippos and Demokritos for example–by the time of Eratosthenes (3 c. BC), followed by Crates(2 c. BC), Strabo (3 c. BC), and Ptolemy (first c. AD), the sphericity of the earth was accepted by all educated Greeks and Romans.</span></p>\n<p><span style=\"color:#000000;\">    Nor did this situation change with the advent of Christianity. A few—at least two and at most five—early Christian fathers denied the spherically of earth by mistakenly taking passages such as Ps. 104:2-3 as geographical rather than metaphorical statements. On the other side tens of thousands of Christian theologians, poets, artists, and scientists took the spherical view throughout the early, medieval, and modern church. The point is that no educated person believed otherwise.</span></p>\n<p><span style=\"color:#000000;\">Russell traced the story about Columbus and medieval flat-earthers back to the 19th century; it originated in a fictional novel by Washington Irving The Life and Voyages of Christopher Columbus I (1829). Later it was picked up by two influential books, John Draper’s History of the Conflict between Religion and Science (1874) and Andrew Dickson White’s book A History of The Warfare Between Science and Theology in Christendom. These books famously used the Columbus story plus many others to defend the thesis that the Church, for centuries, suppressed science and worked to prevent its flourishing; this is known as the conflict thesis.</span></p>\n<p><span style=\"color:#000000;\">These books and the conflict thesis they spawned, are highly influential in popular science and media coverage of theological and scientific issues today despite most historians rejecting them as propaganda. In The Encyclopedia of the History of Science and Religion, Collin Russell notes,</span></p>\n<p><span style=\"color:#000000;\">    Draper takes such liberty with history, perpetuating legends as fact that he is rightly avoided today in serious historical study. The same is nearly as true of White, though his prominent apparatus of prolific footnotes may create a misleading impression of meticulous scholarship.</span></p>\n<p><span style=\"color:#000000;\">Steven Shapin wrote in the same vein in The Scientific Revolution,</span></p>\n<p><span style=\"color:#000000;\">    In the late Victorian period it was common to write about the “warfare between science and religion” and to presume that the two bodies of culture must always have been in conflict. However, it is a very long time since these attitudes have been held by historians of science.</span></p>\n<p><span style=\"color:#000000;\">Numerous other specialists in the field of the history of science and religion concur that the existence of medieval flat-earthers is a myth. Numbers and Lindberg noted in a journal article, “there was scarcely a Christian scholar of the Middle Ages who did not acknowledge [Earth's] sphericity and even know its approximate circumference.” In his study of medieval cosmology, God and Reason in the Middle Ages, distinguished historian Edward Grant noted that,</span></p>\n<p><span style=\"color:#000000;\">    All medieval students who attended a university knew this. In fact any educated person in the Middle Ages knew the earth was spherical, or of a round shape. Medieval commentators on Aristotle’s “On the Heavens” or in the commentaries on a popular thirteenth century work titled “Treatise on the Sphere” by John of Sacrobosco, usually included a question in which they enquired “whether the whole earth is spherical”. Scholastics answered this question unanimously: The earth is spherical or round. No university trained author ever thought it was flat.</span></p>\n<p><span style=\"color:#000000;\">Draper’s and White’s books remain widely cited despite being debunked as historically inaccurate. In fact, the kinds of textbooks Katie mentioned have been subject to scathing criticism precisely for making the aforementioned claims. Lawrence S. Lerner, a professor in the Department of Physics and Astronomy at California State University who is a member of the panel that wrote the 1990 framework for science education in California’s public schools criticised Pretence Halls history text denouncing it as “ignorant fakery.” In an article entitled “Fake ‘History’ That Is Flatly Wrong,” Lerner described the flat-earth claims as a “popular piece of pseudo historical folklore” he added that it “remains popular today among people who have had little education. These evidently include the people who produce ‘science’ books for Prentice Hall.”</span></p>\n<p><span style=\"color:#000000;\">The historical facts are difficult to dispute. During the, so called, “dark ages” Boethius (480-525) cited a well known and accepted ancient Greek cosmological model that affirmed the sphericity of the earth in the Consolidation of Philosophy. Isidore of Serville (560-636) affirmed a round earth in the Etymologies. Bede (672-735) in The Reckoning of Time taught the earth was round; as did Rabanus Marcus in the ninth century.</span></p>\n<p><span style=\"color:#000000;\">The late middle-ages are no different. Hemannus Contractus (1013-155) measured the circumference of the world. Hildegard of Bingen (1098-1179) taught the world was round as did John of Sacrbosco (1200-1256) and Peire d’Ailly (1350-1420). Dante’s Divine Comedy portrays the earth as a sphere. In the Summa Theologicae Thomas Aquinas wrote,</span></p>\n<p><span style=\"color:#000000;\">    The physicist proves the earth to be round by one means, the astronomer by another: for the latter proves this by means of mathematics, e.g. by the shapes of eclipses, or something of the sort; while the former proves it by means of physics, e.g. by the movement of heavy bodies towards the center, and so forth.</span></p>\n<p><span style=\"color:#000000;\">Even medieval textbooks taught the world was round. Both the Elucidarium of Honorius Augustodunensis, a twelfth century manual for educating clergy, and On the Sphere of the World, the standard cosmological textbook of medieval universities in the 13th century, taught that the world was round.</span></p>\n<p><span style=\"color:#000000;\">As I have delved into religious history further I have found that this had not been the first or only instance where I was fed false propaganda about Christianity. I could document several other false versions of history; the flat-earth story will suffice for now. As New Zealand blogger Contra Celsum wrote, “the flat earthers are those who think they existed.” *~</span><br /><span style=\"color:#800000;\">MUCH MORE AT LINK</span><br /><a href=\"http://www.mandm.org.nz/2009/12/contra-mundum-the-flat-earth-myth.html\" rel=\"nofollow\">http://www.mandm.org.nz/2009/12/contra-mundum-the-flat-earth-myth.html</a><a href=\"http://ammi2.files.wordpress.com/2013/10/danozaf91ifn35dea9b1zt7ubf9oajdrv-full.jpg\"><img class=\"size-full wp-image\" id=\"i-318\" alt=\"Image\" src=\"https://ammi2.files.wordpress.com/2013/10/danozaf91ifn35dea9b1zt7ubf9oajdrv-full.jpg?w=650\" /></a></p>\n", "post_id": 319, "location": false, "date": "10-14-2013", "mentions": [], "extracted_features": {}}, {"tags": [], "text": "<p><a href=\"http://p2alm.com/2013/09/23/zephaniah-names-the-nations-christ-defeats-upon-his-return-and-none-of-them-are-european/\">Zephaniah Names the Nations Christ Defeats Upon His Return and None of Them Are European</a>.</p>\n", "post_id": 331, "location": false, "date": "10-19-2013", "mentions": [], "extracted_features": {}}, {"tags": [], "text": "<blockquote><p><span style=\"color:#000000;\">&#8220;There were similar cases in the past in which a number of earthquakes clustered around the same time and place, among other cases in Lebanon and the Gilboa,&#8221; said Dr. Uri Friedlander the head of the Israel Geophysical Institute Sunday. </span></p>\n<p><span style=\"color:#000000;\">&#8220;The truth is we don&#8217;t know what this recent string means.&#8221; </span></p>\n<p><span style=\"color:#000000;\">The Kinneret is located on the seismically-active Great Syria-African Rift. In a number of cases in the past the area saw devastating earthquakes with a magnitude of 6 and upward.</span></p>\n<p><span style=\"color:#000000;\">Sometimes, a series of earthquakes could mean the release of energy that had built up in the earth and thus would mean that there is less of a chance of a devastating earthquake taking place in the near future, but it isn&#8217;t clear that this is the case here.</span></p>\n<p><span style=\"color:#000000;\">The last devastating earthquake in Israel took place in 1927. It had a magnitude of 6.2 and its epicenter was in the Dead Sea. 300 people perished. </span></p>\n<p><a href=\"http://www.haaretz.com/news/national/.premium-1.553422\">http://www.haaretz.com/news/national/.premium-1.553422</a></p>\n<p>&nbsp;</p>\n<p><em><strong>UPDATE</strong> </em></p>\n<p>10-22-2013</p></blockquote>\n<p>#5  A mild earthquake hit northern Israel on Tuesday, marking the fifth quake in a week to hit areas near the Kinneret.</p>\n<p><a href=\"http://www.haaretz.com/news/national/1.553762\" rel=\"nofollow\">http://www.haaretz.com/news/national/1.553762</a></p>\n", "post_id": 333, "location": false, "date": "10-20-2013", "mentions": [], "extracted_features": {}}, {"tags": [], "text": "<p><span style=\"color:#000000;\">&#8220;Four generations after Noah, Genesis 10:25 records the birth of Peleg (meaning division) “for in his days was the earth divided”. Some suggest the continents of the earth were divided at this time. However, this seems unlikely, as such a process would have had to occur within a very confined time period. The resultant geological violence would be overwhelmingly catastrophic—like another Noahic Flood all over again. Any continental separation thus likely occurred during the Flood. 1</span>&#8220;<strong><a href=\"http://www.answersingenesis.org/articles/cm/v22/n1/peleg\" target=\"_blank\" rel=\"nofollow\">In the Days of Peleg &#8211; Answers in Genesis</a></strong></p>\n<p><span style=\"color:#800000;\"><strong>IS THIS? ^ ~~~~~~ THAT? v</strong></span></p>\n<p><span style=\"color:#000000;\">In the remote Afar desert a 60 kilometre &#8211; around 40 miles &#8211; long segment of plate boundary cracked open by as much as eight metres over ten days in 2005. The gap filled with 2.5 cubic kilometres of molten rock &#8211; enough to bury the 42 square kilometres of London&#8217;s congestion charging zone under 60 m of lava.&#8221;</span></p>\n<p><span style=\"color:#000000;\">&#8220;The activity in the last 5 years in Afar has been truly incredible &#8211; we have been witnessing the plates split apart in real time in front of our eyes. Our research has shown the importance of molten magma in the whole process &#8211; we have been able to track the magma from below the Earth&#8217;s crust until it is intruded into cracks and solidifies into new crust, or is erupted at the surface.&#8221;</span></p>\n<p><span style=\"color:#000000;\">&#8220;The team, who aim to show that geology can be fast and furious, will present their research at this year&#8217;s Royal Society Summer Science Exhibition which opens in London today. Visitors to the exhibit will be able to take a 3D tour of the Afar rift in Ethiopia &#8211; above and below ground &#8211; where the African continent is cracking open. </span><strong><a href=\"http://phys.org/news196967150.html\" target=\"_blank\" rel=\"nofollow\">Witness the birth of Africa’s new ocean</a></strong></p>\n", "post_id": 342, "location": false, "date": "10-21-2013", "mentions": [], "extracted_features": {}}, {"tags": [], "text": "<p>famines and pestilences</p>\n<p>via <a href=\"http://midnightwatcher.wordpress.com/2013/10/21/syria-polio-cases-spark-alarm-over-rise-of-pestilences-including-flesh-eating-parasites-due-to-war/\">Syria: Polio Cases Spark Alarm Over Rise Of Pestilences Including Flesh-Eating Parasites Due To War</a>.</p>\n", "post_id": 357, "location": false, "date": "10-22-2013", "mentions": [], "extracted_features": {}}, {"tags": [], "text": "<h1><span style=\"color:#000000;\">The disease that killed a million piglets in China has spread to the US, and no one knows why</span></h1>\n<div class=\"byline\">\n<div class=\"byline-info single-author\"><span class=\"author\">By <a href=\"http://qz.com/author/htimmonsqz/\">Heather Timmons</a></span> <span class=\"timestamp\" title=\"2013-10-23 13:00:50\">October 23, 2013</span></div>\n<div class=\"byline-info single-author\" style=\"text-align:left;\"><a href=\"http://ammi2.files.wordpress.com/2013/10/china-pigs.jpg\"><img class=\"size-full wp-image\" id=\"i-364\" alt=\"Image\" src=\"https://ammi2.files.wordpress.com/2013/10/china-pigs.jpg?w=289\" /></a></div>\n<div class=\"byline-info single-author\" style=\"text-align:left;\">\n<p class=\"annotatable\"><span class=\"anno-span\">     &#8220;America’s pork industry has been gripped by an outbreak of <a href=\"http://www.pork.org/FileLibrary/PORKFileLibrary16/PEDVUpdateNewsletter-1-20130628.pdf\">porcine diarrhea since mid-May</a>, the first appearance of the condition in North America. US farmers have <a href=\"http://www.aasv.org/aasv%20website/Resources/Diseases/PorcineEpidemicDiarrhea.php\">reported 768 cases of the disease</a>, known as porcine epidemic diarrhea virus (PEDV), through the first week of October, which implies that many more thousands of animals could be affected. </span></p>\n<div class=\"anno-right\">\n<div class=\"regular\">\n<div class=\"count\"><span class=\"plus\">    </span><span class=\"anno-span\">Although the disease is not transferable to humans, it has been devastating for the US pork industry. It causes severe “watery diarrhea and vomiting in nursing pigs,” according to <a href=\"http://www.pork.org/FileLibrary/PORKFileLibrary16/PEDVUpdateNewsletter-1-20130628.pdf\">information from the US’s National Pork Board</a>. Almost all the piglets who get the disease die because of it, and farmers are reportedly filling “<a href=\"http://www.nytimes.com/2013/08/05/us/hog-producers-battling-to-contain-virus-that-has-killed-piglets-by-the-thousands.html?_r=0\">wheelbarrows of dead piglets</a>.” </span></div>\n<div class=\"count\"></div>\n</div>\n</div>\n<div class=\"anno-right\">\n<div class=\"regular\">\n<div class=\"count\"><span class=\"plus\">    </span><span class=\"anno-span\">Now researchers at the Virginia-Maryland Regional College of Veterinary Medicine at Virginia Tech <a href=\"http://www.sciencedaily.com/releases/2013/10/131022131651.htm?utm_source=feedburner&amp;utm_medium=feed&amp;utm_campaign=Feed%3A+sciencedaily%2Fplants_animals+%28ScienceDaily%3A+Plants+%26+Animals+News%29\">say they’ve traced the virus</a> back to eastern China’s Anhui province. Anhui is one of China’s major pig-farming areas, home to companies like the fast-growing <a href=\"http://www.antainy.com/xpe/portal/b746e78a-136d-1000-a064-4f25e92da5cf\">Anhui Antai Agricultural Industry Group</a>, which slaughtered 500,000 pigs last year. </span></div>\n<div class=\"count\"></div>\n</div>\n</div>\n<div class=\"anno-right\">\n<div class=\"regular\">\n<div class=\"count\"><span class=\"plus\">    </span><span class=\"anno-span\">Pinpointing the origin of the virus isn’t going to provide much reassurance to US farmers. Years after it spread in China, it still hasn’t been controlled. </span></div>\n<div class=\"count\"></div>\n</div>\n</div>\n<div class=\"anno-right\">\n<div class=\"regular\">\n<div class=\"count\"><span class=\"plus\">    </span><span class=\"anno-span\">Reports of PEDV outbreaks in China and Europe are not new, and have been mostly controlled with vaccination over the years. But starting in 2010, China suffered a severe outbreak of PEDV that killed <a href=\"http://wwwnc.cdc.gov/eid/article/18/1/11-1259_article.htm\">more than 1 million piglets</a> in less than two years. </span></div>\n<div class=\"count\"><span class=\"anno-span\">Scientists said the Chinese death toll was thanks to new <a href=\"http://wwwnc.cdc.gov/eid/article/18/8/12-0002_article.htm\">vaccine-resistant strains</a> of the disease.&#8221;</span></div>\n<div class=\"count\">TO CONTINUE SEE LINK BELOW</div>\n<div class=\"count\"><span class=\"anno-span\"><a href=\"http://qz.com/138621\" rel=\"nofollow\">http://qz.com/138621</a><br />\n</span></div>\n<div class=\"count\"></div>\n<div class=\"count\"><span class=\"anno-span\"></span></div>\n<div class=\"count\"><span class=\"anno-span\"> </span><span style=\"color:#000000;\"><span class=\"reftext\"><a href=\"http://biblehub.com/1_kings/8-37.htm\"><span style=\"color:#000000;\"><b>    37</b></span></a></span>If there be in the land famine, if there be pestilence, blasting, mildew, locust, <i>or</i> if there be caterpiller; if their enemy besiege them in the land of their cities; whatsoever plague, whatsoever sickness <i>there be</i>; </span></div>\n<div class=\"count\"><span style=\"color:#000000;\"><span class=\"reftext\"><a href=\"http://biblehub.com/1_kings/8-38.htm\"><span style=\"color:#000000;\"><b>    38</b></span></a></span>What prayer and supplication soever be <i>made</i> by any man, <i>or</i> by all thy people Israel, which shall know every man the plague of his own heart, and spread forth his hands toward this house: </span></div>\n<div class=\"count\"><span style=\"color:#000000;\"><span class=\"reftext\"><a href=\"http://biblehub.com/1_kings/8-39.htm\"><span style=\"color:#000000;\"><b>    39</b></span></a></span>Then hear thou in heaven thy dwelling place, and forgive, and do, and give to every man according to his ways, whose heart thou knowest; (for thou, <i>even</i> thou only, knowest the hearts of all the children of men;)</span></div>\n<div class=\"count\"><span style=\"color:#000000;\">   <span class=\"reftext\"><a href=\"http://biblehub.com/1_kings/8-40.htm\"><span style=\"color:#000000;\"><b>40</b></span></a></span>That they may fear thee all the days that they live in the land which thou gavest unto our fathers. 1 Kings 8</span></div>\n<div class=\"count\" style=\"padding-left:30px;\"></div>\n</div>\n</div>\n</div>\n</div>\n", "post_id": 361, "location": false, "date": "10-26-2013", "mentions": [], "extracted_features": {}}, {"tags": [], "text": "<p><span class='embed-youtube' style='text-align:center; display: block;'><iframe class='youtube-player' type='text/html' width='640' height='390' src='https://www.youtube.com/embed/r6sGpXZA098?version=3&#038;rel=1&#038;fs=1&#038;showsearch=0&#038;showinfo=1&#038;iv_load_policy=1&#038;wmode=transparent' frameborder='0' allowfullscreen='true'></iframe></span></p>\n<p> Thousands could die in Israel, the IDF is preparing for the worst</p>\n", "post_id": 389, "location": false, "date": "10-27-2013", "mentions": [], "extracted_features": {}}, {"tags": [], "text": "<p><!--[if gte mso 9]&gt;--></p>\n<p><span lang=\"EN\" style=\"color:#000000;\">There is an apt saying that comes to mind in regards to this subject&#8230;&#8221;just because your paranoid doesnt mean they arent after you.&#8221; This can be turned to say&#8230;just because they are looked upon as &#8220;old wives tales &#8221; doesnt mean they arent true. </span></p>\n<p class=\"MsoNormal\"><span lang=\"EN\" style=\"color:#000000;\">Having pointed these things out, lets proceed&#8230;.An Asian ol&#8217; wives tale says that when Sea Monsters come to shore, they are warning of an impending earthquake, generally of massive proportions.</span></p>\n<p class=\"MsoNormal\">&#8220;Via ENENews, who quotes CNN’s New Day:</p>\n<p class=\"MsoNormal\">CNN’s New Day, Oct. 18, 2013: There’s a Japanese legend that oarfish beach themselves to warn of an impending earthquake. And, in fact, dozens of them did just that in Japan about a year before the devastating Fukushima quake and tsunami in 2011.</p>\n<p class=\"MsoNormal\">Backing up that assertion is an article from May 2011, which shows that oarfish did, indeed, warn Japan of the major 2011 Earthquake, which caused the tsunami that devasted andcrippled the Fukushima nuclear plant.</p>\n<p class=\"MsoNormal\">In March of 2010, British newspaper The Telegraph published this article that speculated about an oncoming powerful earthquake there after dozens of giant oarfish have been found washed ashore on beaches in Japan and some caught in fishermen’s nets.</p>\n<p class=\"MsoNormal\">Is it a myth if they have evidence of it happening?&#8221;</p>\n<p class=\"MsoNormal\"><a href=\"http://www.youtube.com/watch?v=LIvoVUtrWDs\"><span style=\"color:blue;\">http://www.youtube.com/watch?v=LIvoVUtrWDs</span></a></p>\n<p class=\"MsoNormal\"><span lang=\"EN\" style=\"color:#000000;\">Are California’s giant dead oarfish a sign of an impending earthquake disaster?</span></p>\n<p class=\"MsoNormal\"><a href=\"http://ammi2.files.wordpress.com/2013/10/925821-cddbde18-3af4-11e3-9bcd-10262b6f88531.jpg\"><img class=\"size-full wp-image\" id=\"i-405\" alt=\"Image\" src=\"https://ammi2.files.wordpress.com/2013/10/925821-cddbde18-3af4-11e3-9bcd-10262b6f88531.jpg?w=640\" /></a></p>\n<p class=\"MsoNormal\">October 23, 2013 – CATALINA ISLAND, Ca.  — Could the appearance of rare “sea serpents” washing ashore beaches in Southern California portend disaster? The question comes following the discovery of the carcass of a rare 18-foot-long oarfish off the coast of Catalina Island on Oct. 13, followed by another snakelike 14-foot-long oarfish found on Oct. 18 in Oceanside. Fishermen in Japan reported a sharp uptick in oarfish sightings in March 2010 following the massive magnitude-8.8 earthquake in Chile that same month, which marked almost exactly one year before the country was devastated by its own magnitude-8.9 quake in northeast Japan. Oarfish, which can grow to more than 50 feet in length, are considered the longest bony fish in the world. They typically dive more than 3,000 feet deep, which makes sightings rare and has fueled various serpent legends throughout history. According to traditional Japanese lore, oarfish rise to the water’s surface and beach themselves to warn of an impending earthquake, a notion that some scientists have speculated could be supported by the bottom-dwelling fish being more sensitive to seismic shifts.</p>\n<p class=\"MsoNormal\">Known as the “Messenger from the Sea God’s Palace,” over a dozen “ryugu no tsukai,” or slender oarfish, either washed ashore or were caught in fishing nets in the Ishikawa, Toyama, Kyoto, Shimane and Nagasaki prefectures near the quake’s epicenter months before the 2011 quake hit, according to several reports. Scientists, however, say there is no data to support an actual link between the two phenomena. “It’s probably just a coincidence,” said Rick Feeney, who has been studying fish for almost 35 years for the Natural History Museum of Los Angeles County. According to Feeney, four sightings have been reported since 2010 from the Central Coast southward, including in Malibu in 2010 and Lompoc in 2011. “We think that they come inshore to die actually because they’re in distress for some reason, but we don’t know what the reason is,” said Feeney, adding that the fish could have been starving or disoriented. But the fish remain somewhat of a mystery to researchers because there have been few Oarfish caught over the years, he said. A record number of sea lion sightings were reported along Southland beaches earlier this year, including one declared “unusual mortality event” in April that saw hundreds of ailing sea lion pups washed ashore. –CBS</p>\n<p class=\"MsoNormal\"><a href=\"http://theextinctionprotocol.wordpress.com/2013/10/23/are-californias-giant-dead-oarfish-a-sign-of-an-impending-earthquake-disaster/\" rel=\"nofollow\">http://theextinctionprotocol.wordpress.com/2013/10/23/are-californias-giant-dead-oarfish-a-sign-of-an-impending-earthquake-disaster/</a></p>\n<p class=\"MsoNormal\"> <em><span lang=\"EN\" style=\"color:#000000;\">Now there a couple of other ways of looking at whats happening to these sea monsters washing ashore&#8230;.here is one</span></em></p>\n<p class=\"MsoNormal\">The Newcastle Herald reported yesterday: “Ocean’s horror tale gets global audience [...] The story smashed Fairfax Regional Media records, registering 620,000 unique readers on the Herald site by Tuesday afternoon. It appeared on the front page of Reddit on Monday, was trending in Melbourne early Monday afternoon, and was re-tweeted by, among others, Jack Dorsey, the founder and chief executive of Twitter [...]”</p>\n<p class=\"MsoNormal\"> Here’s a small selection of the news outlets that published reports based on the Herald’s October 18th article ‘The ocean is broken‘:</p>\n<p class=\"MsoNormal\"> The Guardian: Yachtsman describes horror at ‘dead’, rubbish strewn Pacific Ocean</p>\n<p class=\"MsoNormal\">USA Today: Sailor’s discovery: ‘The ocean is dead’</p>\n<p class=\"MsoNormal\">    Telegraph: Maritime waste: Our oceans are threatened by a toxic tide</p>\n<p class=\"MsoNormal\">    Salon: “It felt as if the ocean itself was dead”: One sailor’s heartbreaking voyage</p>\n<p class=\"MsoNormal\"> None mention the ongoing nuclear crisis at Fukushima Daiichi, which is “by far the largest discharge of radioactivity into the ocean ever seen.” The Salon article even incorrectly attributes events that occurred after they left Japan for Hawaii to their trip from Australia to Japan:</p>\n<p class=\"MsoNormal\"> [...] “all he’d had to do to catch a fish from the ocean between Brisbane and Japan was throw out a baited line.” On his most recent trip, said Macfadyen, there were no fish to be found: “We hardly saw any living things. We saw one whale, sort of rolling helplessly on the surface with what looked like a big tumour on its head. It was pretty sickening. I’ve done a lot of miles on the ocean in my life and I’m used to seeing turtles, dolphins, sharks and big flurries of feeding birds. But this time, for 3000 nautical miles there was nothing alive to be seen.” More horrifying, even, was what he did see, en route from Japan to California: [tsunami debris] [...]</p>\n<p class=\"MsoNormal\"> Yet, the original Newcastle Herald article specifically mentions radioactive pollution from Fukushima and includes events that deserve closer scrutiny:</p>\n<p class=\"MsoNormal\"> Macfadyen signed up to this scheme while he was in the US, responding to an approach by US academics who asked yachties to fill in daily survey forms and collect samples for radiation testing – a significant concern in the wake of the tsunami and consequent nuclear power station failure in Japan.</p>\n<p class=\"MsoNormal\">    The boat’s vivid yellow paint job, never faded by sun or sea in years gone past, reacted with something in the water off Japan, losing its sheen in a strange and unprecedented way. [Not likely to be tsunami-related, which would have been transported far from Japan's coast by now]</p>\n<p class=\"MsoNormal\">    “After we left Japan, it felt as if the ocean itself was dead.”</p>\n<p class=\"MsoNormal\">    “We hardly saw any living things.”</p>\n<p class=\"MsoNormal\">    “We saw one whale, sort of rolling helplessly on the surface with what looked like a big tumour on its head.”</p>\n<p class=\"MsoNormal\">    “I’ve done a lot of miles on the ocean in my life and I’m used to seeing turtles, dolphins, sharks and big flurries of feeding birds. But this time, for 3000 nautical miles there was nothing alive to be seen.”</p>\n<p class=\"MsoNormal\"> See also: Sailor: &#8220;After we left Japan, it felt as if the ocean itself was dead&#8221; &#8212; Nothing alive for over 3,000 miles &#8212; No longer saw turtles, dolphins&#8230;.</p>\n<p class=\"MsoNormal\"><a href=\"http://enenews.com/sailors-shocking-pacific-journey-goes-viral-smashes-record-picked-up-by-the-guardian-usa-today-many-more-all-fail-to-mention-ongoing-crisis-at-fukushima-by-far-worlds-largest-release-of\"><span style=\"color:blue;\">http://enenews.com/sailors-shocking-pacific-journey-goes-viral-smashes-record-picked-up-by-the-guardian-usa-today-many-more-all-fail-to-mention-ongoing-crisis-at-fukushima-by-far-worlds-largest-release-of</span></a></p>\n<p class=\"MsoNormal\">\n<p class=\"MsoNormal\"><span lang=\"EN\" style=\"color:#000000;\"><em>Either way you choose to see it&#8230;.things are not looking so good for man and beast or fish and fowl. I mentioned above that there was a few ways to look at whats happening and here is the way I see them&#8230;thru the lens of prophecy.</em> </span></p>\n<p class=\"MsoNormal\"><span lang=\"EN\" style=\"color:#000000;\">ALL OF CREATION GROANS UNDER THE WIEGHT OF OUR SIN</span></p>\n<p class=\"MsoNormal\"><span lang=\"EN\" style=\"color:#000000;\">2There is swearing, deception, murder, stealing and adultery. They employ violence, so that bloodshed follows bloodshed. 3Therefore the land mourns, And everyone who lives in it languishes Along with the beasts of the field and the birds of the sky, And also the fish of the sea disappear. 4Yet let no one find fault, and let none offer reproof; For your people are like those who contend with the priest.…Hosea 4:3</span></p>\n<p class=\"MsoNormal\"><span lang=\"EN\" style=\"color:#000000;\">How long will the land lie parched and the grass in every field be withered? Because those who live in it are wicked, the animals and birds have perished. Moreover, the people are saying, &#8220;He will not see what happens to us.&#8221; Jeremiah 12:4</span></p>\n<p class=\"MsoNormal\"><span lang=\"EN\" style=\"color:#000000;\">The land is full of adulterers; because of the curse the land lies parched and the pastures in the wilderness are withered. The prophets follow an evil course and use their power unjustly. Jeremiah 23:10</span></p>\n<p class=\"MsoNormal\"><span lang=\"EN\" style=\"color:#000000;\">The fish in the sea, the birds in the sky, the beasts of the field, every creature that moves along the ground, and all the people on the face of the earth will tremble at my presence. The mountains will be overturned, the cliffs will crumble and every wall will fall to the ground. Ezekiel 38:20</span></p>\n<p class=\"MsoNormal\"><span lang=\"EN\" style=\"color:#000000;\">The earth dries up and withers, the world languishes and withers, the heavens languish with the earth. Isaiah 24:4</span></p>\n<p class=\"MsoNormal\"><em><span lang=\"EN\" style=\"color:#000000;\">Prophecy in Gods word told us to expect such things at the end of the age&#8230;just didnt give us the specifics on how it would come to pass. Now you can chalk all this up to just more myth&#8217;s of men but that would be about as wise as ignoring the old Asian wives tale about sea monsters coming ashore right before an earthquake or dismissing out of hand the warnings of  someone you deem paranoid. </span></em></p>\n<p class=\"MsoNormal\"><em><span lang=\"EN\" style=\"color:#000000;\">A skeptical yet open mind is a prepared mind&#8230;Im not saying so open your brains are falling out&#8230;Im just asking that you have a mind ready to face whatever may come in the days ahead.</span></em></p>\n<p class=\"MsoNormal\"><span lang=\"EN\" style=\"color:#000000;\"> 14Where there is no guidance the people fall, but in abundance of counselors there is victory. Proverbs 11:14</span></p>\n<p class=\"MsoNormal\"><em><span lang=\"EN\" style=\"color:#000000;\">Dont make this mistake&#8230;.</span></em></p>\n<p class=\"MsoNormal\"><span lang=\"EN\" style=\"color:#000000;\">He did evil in the eyes of the LORD, as the house of Ahab had done, for after his father&#8217;s death they&#8230; became his advisers, to his undoing. 2 Chronicles 22:4</span></p>\n<p class=\"MsoNormal\"><span lang=\"EN\" style=\"color:#000000;\">The simple believe anything, but the prudent give thought to their steps Proverbs 14:15</span></p>\n<p><em><span style=\"color:#000000;\">Victory is found in the guidance of many counselors&#8230;so that you are well informed and can distinguish between the wicked and the righteous in judgment. </span></em></p>\n<p class=\"MsoNormal\"><span style=\"color:#000000;\"> Plans fail for lack of counsel, but with many advisers they succeed. Proverbs 15:22 </span></p>\n<p class=\"MsoNormal\"><span style=\"color:#000000;\">The prudent see danger and take refuge, but the simple keep going and pay the penalty. Proverbs 22:3</span></p>\n<p class=\"MsoNormal\"><span lang=\"EN\" style=\"color:#000000;\">And he said to the human race, &#8220;The fear of the Lord&#8211;that is wisdom, and to shun evil is understanding.&#8221; Job 28:28</span></p>\n<p class=\"MsoNormal\"><span lang=\"EN\" style=\"color:#000000;\">Turn from evil and do good; seek peace and pursue it. Psalm 34:14</span></p>\n<p class=\"MsoNormal\"><span lang=\"EN\" style=\"color:#000000;\">Do not be wise in your own eyes; fear the LORD and shun evil. Proverbs 3:7</span></p>\n<p class=\"MsoNormal\"><em><span style=\"color:#000000;\"> Dont take my word for it&#8230;. I only ask that you to test what I say and judge for yourself. I dont speak that of my own mind&#8230;I dont declare my opinion&#8230;I am only repeating what I have heard and found true. </span></em></p>\n<p class=\"MsoNormal\"><span style=\"color:#000000;\"> The LORD is my rock, my fortress and my deliverer; my God is my rock, in whom I take refuge, my shield and the horn of my salvation, my stronghold. Psalm 18:2 </span></p>\n<p class=\"MsoNormal\"><span lang=\"EN\" style=\"color:#000000;\">As for God, his way is perfect: The LORD&#8217;s word is flawless; he shields all who take refuge in him. Psalm 18:30</span></p>\n<p class=\"MsoNormal\"><span lang=\"EN\" style=\"color:#000000;\">For the LORD God is a sun and shield; the LORD bestows favor and honor; no good thing does he withhold from those whose walk is blameless. Psalm 84:11</span></p>\n<p class=\"MsoNormal\"><span lang=\"EN\" style=\"color:#000000;\">He holds success in store for the upright, he is a shield to those whose walk is blameless, Proverbs 2:7</span></p>\n<p class=\"MsoNormal\"><span style=\"color:#000000;\"> …20&#8217;THE SUN WILL BE TURNED INTO DARKNESS AND THE MOON INTO BLOOD, BEFORE THE GREAT AND GLORIOUS DAY OF THE LORD SHALL COME. 21&#8217;AND IT SHALL BE THAT EVERYONE WHO CALLS ON THE NAME OF THE LORD WILL BE SAVED.&#8217; </span></p>\n<p class=\"MsoNormal\"><span lang=\"EN\" style=\"color:#000000;\">22&#8243;Men of Israel, listen to these words: Jesus the Nazarene, a man attested to you by God with miracles and wonders and signs which God performed through Him in your midst, just as you yourselves know&#8211;…</span></p>\n<p class=\"MsoNormal\"><em><span lang=\"EN\" style=\"color:#000000;\">The world attests to the above as fact&#8230; &#8220;Jesus the Nazarene, a man attested to you by God with miracles and wonders and signs which God performed through Him in your midst, just as you yourselves know&#8221; even though they dont believe.</span></em></p>\n<p class=\"MsoNormal\"><em><span lang=\"EN\" style=\"color:#000000;\">Dont make their same mistake when you see all these things coming upon the world. We are told what will be so that we can declare it from the roof tops&#8230;so that when the world see what was said to them coming to pass&#8230;they too might believe that Christ is who He said He is&#8230;and of those who consider this&#8230; it is promised&#8230;WHO SO EVER SHALL CALL UPON THE NAME OF THE LORD SHALL BE SAVED Amen.</span></em></p>\n", "post_id": 393, "location": false, "date": "10-27-2013", "mentions": [], "extracted_features": {}}, {"tags": ["religion", "theology", "quotes", "politics", "christianity", "billows of smoke"], "text": "<p><strong>The word of God tells us that His presence and displeasure will be visible to all who live upon the earth, &#8220;I will show wonders in the heavens above and signs on the earth below, blood and fire and billows of smoke.&#8221;  He equates these things with such times as when He destroyed Sodom and Gomorrah, the days of Noah and when He lead the Hebrews out of Egypt. He tells us that there is nothing new under the sun and that what has been shall be again. He says that there is no temptation that will over take us except that which is common to man. This way we are not caught off guard and can anticipate what He will be doing or allowing to be done.</strong></p>\n<p><strong>And these events are described to us in various ways through out the bible, much of its detail is found in the OT, from Genesis to </strong><strong>Malachi</strong><strong>. He says He spoke of things we need to know about , several times and in various ways so that we understand what He is telling us. His written word to us is one of the ways in which He reveals to His servants what He is going to do before He does it. </strong></p>\n<p><strong>So with this blog I am going to share what He has told us, to the best of my ability , so that you too are equipped to to discern what is happening around you&#8230;so you can decide if it </strong><strong>is that which He said would be happening.</strong></p>\n<p><strong><a href=\"http://ammi2.files.wordpress.com/2013/09/winter-butterfly-copy-2.png\"><img class=\"alignnone size-medium wp-image-6\" alt=\"winter-butterfly - Copy (2)\" src=\"https://ammi2.files.wordpress.com/2013/09/winter-butterfly-copy-2.png?w=300&#038;h=174\" width=\"300\" height=\"174\" /></a></strong></p>\n", "post_id": 4, "location": false, "date": "09-23-2013", "mentions": [], "extracted_features": {}}, {"tags": [], "text": "<div class=\"text_exposed_root text_exposed\" id=\"id_5276f47d8c94c1413568804\"><span style=\"color:#000000;\">I wrote this article a few years back , it was around that time that I had learned about the fragile and fractured geology of the Levant and began making connections between what I had learned and what I knew was said in  prophecy concerning the last days.</span></div>\n<div class=\"text_exposed_root text_exposed\"> </div>\n<div class=\"text_exposed_root text_exposed\"><span class=\"fbPhotosPhotoCaption\" id=\"fbPhotoSnowliftCaption\" style=\"color:#000000;\"><span class=\"hasCaption\">Saudi rumbles-earthquakes and volcanism<br /></span></span></div>\n<div class=\"text_exposed_root text_exposed\"><span style=\"color:#000000;\"> 06/19/09</span><br /><span style=\"color:#000000;\"> The quakes began around 4/18/09 (during our passover/pentecost) season&#8230;and just as islams season of umrah was getting underway&#8230;.the season of umrah that reaches its peak during of all times&#8230;..the month of ramadan.</span><br /><span class=\"text_exposed_show\" style=\"color:#000000;\"> <br /> The quakes are linked to a lava field just north of Medina, &#8220;the city of prophecy&#8221; where the prophets mosque is. Medina is about 210 miles north of Mecca,the holiest city of Islam. Mecca and Madinah are so holy that only Muslims are allowed to step foot in them.</p>\n<p> Imagine&#8230;the officials there at first thought they only had the swine flu to deal with this year as pilgrims the world over begin to flood the areas. But now there is the threat of earthquakes and eruptions during this most holy season for them.</p>\n<p> When I began building this thread&#8230;.I did a lot of work on the northern areas of Israel and Arabia.</p>\n<p> For one as according to prophecy its from the north that the Assyrian comes, 2 if you gonna attack Jerusalem&#8230;due to geography you have to attack from the north if you plan on an invasion of occupation&#8230;.3 its the most studied?<br /> Its where most info can be found for what ever reason.</p>\n<p> There is some research here on the southern areas from (dead sea to red sea) but its slim cause 1. its a very disputed area and 2. you have the cultural and language barriers and the 2 will never come together until the Lords return&#8230;and 3. I just figured they were ignorant about this vast area due to its hostile climate and vastness of it.</p>\n<p> I thought there was no info on the area cause people weren&#8217;t interested and those who were, weren&#8217;t allowed in the areas&#8230;much like archeologists are policed in Egypt&#8230;its an expensive venture and one wrong move or word would have you sent packing. All this of course due to the Arab Israeli conflict.</p>\n<p> Then the Saudi press began talking about these quakes and lava flows occurring north of Medina. And I suddenly realized that the Lord had blinded me to something&#8230;.something very important about the geological make up as well as the prophecy about the area. And it could only have been the Lord blinding me cause the importance of all this was right in front of, not only mine&#8230;but everyone&#8217;s eyes.</p>\n<p> The importance was as easy to see as looking at a map&#8230;.of which I have viewed and posted plenty and of which&#8230;.I looked at once more the other day when the light finally went on.</p>\n<p> The Saudi&#8217;s aren&#8217;t ignorant of the area&#8230;.in fact they are as learned of that area as the Egyptians are of their archeological sites.</p>\n<p> If not more so&#8230;..because its the area of Mecca and Medina.</p>\n<p> In fact, their preachers use this area to proselytize especially Israeli&#8217;s and Christians even&#8230;.with our own OT.</p>\n<p> They preach that the Messiah will come from that area&#8230;&#8230;.</p>\n<p> Hab 3:3<br /> God came from Teman, and the Holy One from mount Paran. Selah. His glory covered the heavens, and the earth was full of his praise.</p>\n<p> Hab 3:4 And his brightness was as the light; he had horns coming out of his hand: and there was the hiding of his power.</p>\n<p> But just like every other deceiver&#8230;&#8230;..they take this bit of information out of context and rely upon the potential converts ignorance of Gods word. Cause when you look at the verses above and below the 2 used by them&#8230;..you see that indeed He is coming from there for the salvation of His own. But He is walking thru that area in His wrath&#8230;.</p>\n<p> Hab 3:5<br /> Before him went the pestilence, and burning coals went forth at his feet.</p>\n<p> Hab 3:6<br /> He stood, and measured the earth: he beheld, and drove asunder the nations; and the everlasting mountains were scattered, the perpetual hills did bow: his ways are everlasting.</p>\n<p> Hab 3:7<br /> I saw the tents of Cushan in affliction: and the curtains of the land of Midian did tremble.</p>\n<p> Interesting eh?</p>\n<p> And even more so when you stop to realize that at this very moment the Saudi officials are worrying over pestilence and burning coals of fire during their most holy season&#8230;..Umrah which peaks at Ramadan&#8230;.a time in which this whole area will be packed to over flowing with worshipers of allah. Worshipers of allah that are required to make that pilgrimage at least once in their life.</p>\n<p> Now&#8230;.imagine this scenario&#8230;.the areas of Medina and mecca destroyed by quakes and volcanism. The 2 most holy sites of Islam&#8230;.what would happen to the season of umrah&#8230;.with culminates in the month of Ramadan?</p>\n<p> There is only one other holy site in Islam that would fit the requirements for Ramadan pilgrimage&#8230;..their 3rd holiest site&#8230;.Jerusalem.</p>\n<p> No&#8230;.the Saudi&#8217;s don&#8217;t keep quiet about the geological problems of Mecca and Medina out of ignorance. Islam doesn&#8217;t talk about it cause it is written&#8230;.that it is destined for destruction.</span></div>\n<div class=\"text_exposed_root text_exposed\"> </div>\n<div class=\"text_exposed_root text_exposed\">\n<blockquote><span><span><span>~The Harrat Lunayyir Volcanic Area is located in the desert of northwestern Saudi Arabia, immediately east of the Red Sea port of Umm Lajj. It is an area of extensive basaltic lava flows and about fifty small volcanic cones (see photo at right).</span></p>\n<p><span>The center of the volcanic field is about thirty miles inland from the Red Sea. Individual lava flows radiate out in all directions from the center of the field. They follow stream valleys through the desert. Two of the flows have reached the Red Sea but they are now covered by sand along the coast.~</span><br /><span>more at link </span><a href=\"http://geology.com/articles/harrat-lunayyir/\" target=\"_blank\" rel=\"nofollow\">http://geology.com/articles/harrat-lunayyir/</a></span></span></p></blockquote>\n</div>\n<div class=\"text_exposed_root text_exposed\"> </div>\n<div class=\"text_exposed_root text_exposed\"><span style=\"color:#000000;\"><span><span>THE LAVA FIELDS OF SAUDI ARABIA </span><span>AND</span><br /><span>THE FORMATION OF THE KISHB LAVA TUBES</span><br /><a href=\"http://www.saudicaves.com/lava/introobl.htm\" target=\"_blank\" rel=\"nofollow\"><span style=\"color:#000000;\">http://www.saudicaves.com/lava/introobl.htm</span></a></span></span></div>\n<div class=\"text_exposed_root text_exposed\"> </div>\n<div class=\"text_exposed_root text_exposed\"><span style=\"color:#000000;\"><strong><a href=\"http://www.saudiaramcoworld.com/issue/200602/volcanic.arabia.htm\" target=\"_blank\" rel=\"nofollow\"><span style=\"color:#000000;\">Saudi Aramco World : Volcanic Arabia</span></a></strong></span></div>\n<div class=\"text_exposed_root text_exposed\"> </div>\n<div class=\"text_exposed_root text_exposed\"><span class=\"text_exposed_show\" style=\"color:#000000;\"><span><span><a href=\"http://www.saudiaramcoworld.com/issue/200602/volcanic.arabia.htm\" target=\"_blank\" rel=\"nofollow\"><span style=\"color:#000000;\">http://www.saudiaramcoworld.com/&#8230;/volcanic.arabia.htm</span></a></span></span></span></div>\n<div class=\"text_exposed_root text_exposed\"> </div>\n<div class=\"text_exposed_root text_exposed\"><span style=\"color:#000000;\"><strong><a href=\"http://www.freerepublic.com/focus/news/928064/posts\" target=\"_blank\" rel=\"nofollow\"><span style=\"color:#000000;\">Mount Sinai Was A Volcano In Saudi Arabia, Says Scientist (Exodus)</span></a></strong></span></div>\n<div class=\"text_exposed_root text_exposed\"> </div>\n<div class=\"text_exposed_root text_exposed\"><span style=\"color:#000000;\"><span><span><a href=\"http://www.freerepublic.com/focus/news/928064/posts\" target=\"_blank\" rel=\"nofollow\"><span style=\"color:#000000;\">http://www.freerepublic.com/focus/news/928064/posts</span></a></span></span></span></div>\n<div class=\"text_exposed_root text_exposed\"> </div>\n<div class=\"text_exposed_root text_exposed\"> </div>\n<div class=\"text_exposed_root text_exposed\"><span style=\"color:#000000;\"><strong><a href=\"http://www.google.com/hostednews/afp/article/ALeqM5g_fGk4i1iYVqhF1GI8a-O38IlCwQ\" target=\"_blank\" rel=\"nofollow\"><span style=\"color:#000000;\">New study sheds light on Saudi volcano risk</span></a></strong></span></div>\n<div class=\"text_exposed_root text_exposed\"><span style=\"color:#000000;\"><span><a href=\"http://www.google.com/hostednews/afp/article/ALeqM5g_fGk4i1iYVqhF1GI8a-O38IlCwQ\" target=\"_blank\" rel=\"nofollow\"><span style=\"color:#000000;\">http://www.google.com/&#8230;/ALeqM5g_fGk4i1iYVqhF1GI8a-O38IlCwQ</span></a></span></span></div>\n<div class=\"text_exposed_root text_exposed\"> </div>\n<div class=\"text_exposed_root text_exposed\"> </div>\n<div class=\"text_exposed_root text_exposed\"><span class=\"text_exposed_show\"><span style=\"color:#000000;\">As you can see in the image below&#8230;the purple areas are massive lava fields, Harrat Ash Shamah buttes right up to Ancient Edom&#8230;what is today the N. Sinai,Egypt &#8211; S. Negev, Israel dessert border area&#8230;.as for Mecca and Medina&#8230;their toast.</span><br /></span></div>\n<div class=\"text_exposed_root text_exposed\"> </div>\n<div class=\"text_exposed_root text_exposed\"><a href=\"http://ammi2.files.wordpress.com/2013/11/551941_10152668799795655_7625666_n.jpg\"><img class=\"size-full wp-image\" id=\"i-419\" alt=\"Image\" src=\"https://ammi2.files.wordpress.com/2013/11/551941_10152668799795655_7625666_n.jpg?w=487\" /></a></div>\n", "post_id": 409, "location": false, "date": "11-04-2013", "mentions": [], "extracted_features": {}}, {"tags": [], "text": "<div class=\"wpcom-reblog-snapshot\"><div class=\"reblogger-note\"><p class=\"reblogger-headline\"><img alt='' src='https://2.gravatar.com/avatar/551d82925f2d535a654aafe1f8182be3?s=32&#038;d=identicon&#038;r=G' class='avatar avatar-32' height='32' width='32' /><a href=\"http://ammi2.wordpress.com/author/ammi2/\">ammi2</a>:</p><div class='reblogger-note-content'><blockquote><p>Also see  <a href=\"http://theextinctionprotocol.wordpress.com/2013/09/02/climate-change-driving-spread-of-crop-pests-and-disease/\" rel=\"nofollow\">http://theextinctionprotocol.wordpress.com/2013/09/02/climate-change-driving-spread-of-crop-pests-and-disease/</a></p>\n</blockquote></div></div><div class=\"reblog-post\"><p class=\"reblog-from\"><img alt='' src='https://0.gravatar.com/avatar/98197f29ac5d92a762d22257df8cb850?s=48&#038;d=identicon&#038;r=G' class='avatar avatar-48' height='48' width='48' />Originally posted on <a href=\"http://theextinctionprotocol.wordpress.com/2013/09/02/did-a-volcanic-eruption-induce-the-summer-cooling-spell/\">The Extinction Protocol </a>:</p><div class=\"reblogged-content\">\n<h5><img class=\"alignnone\" src=\"http://vortex.accuweather.com/adc2004/pub/includes/columns/newsstory/2013/590x585_08291842_screen-shot-2013-08-27-at-3.10.42-pm.png\" height=\"585\" width=\"590\"></h5>\n\n<h5>\n<span style=\"color:#3366ff;\"><strong>September 02, 2013</strong></span>– <span style=\"color:#993366;\"><strong>RUSSIA</strong></span> – Throughout history, large volcanic eruptions have been known to influence climate. This summer, the Midwest experienced a cold wave referred to as  “Julytober” following the June eruption of Mount Sheveluch in Russia. Experts continue to compare this eruption to others from history and debate whether it could have induced the cooler Midwestern weather. “Large Russian volcano eruptions tend to cool the Midwest,” Historical Climatologist Evelyn Browning-Garriss said. When a volcano erupts, if it is large enough, it can send debris miles into the stratosphere. The stratosphere is the atmosphere above where weather takes place, approximately 6-8 miles off the ground. “Sulfur dioxide combines with water in the atmosphere to provide sulfuric acid aerosol droplets that reflect incoming solar radiation,” PhD Research Geophysicist with the U.S. Geological Survey Alaska Volcano Observatory David Schneider said.Although the eruption of Mount Sheveluch in June was minor compared to…</h5>\n</div><p class=\"reblog-source\"><a href=\"http://theextinctionprotocol.wordpress.com/2013/09/02/did-a-volcanic-eruption-induce-the-summer-cooling-spell/\">View original</a> <span class=\"more-words\">141 more words</span></p></div></div>", "post_id": 443, "location": false, "date": "12-07-2013", "mentions": [], "extracted_features": {}}], "edges": [{"data": [0, 0], "type": "comment", "service": "wordpress"}, {"data": [27933907, 14867804, 14867804], "type": "like", "service": "wordpress"}], "metadata": {"services": [{"username": "ammi2", "display_name": "ammi2", "service": "wordpress", "service_url": "https://wordpress.com/", "location": false, "service_id": 21572636, "profile_url": "http://en.gravatar.com/ammi2"}]}}