{"node_id": 28101257, "posts": [{"tags": ["Summer", "theatre", "harmony", "July", "singing", "christmas", "happiness"], "text": "<div id=\"attachment_105\" style=\"width: 222px\" class=\"wp-caption alignleft\"><a href=\"http://1emilyjo.files.wordpress.com/2012/07/309376_10151054156981678_1671666796_n.jpg\"><img class=\"size-medium wp-image-105\" title=\"309376_10151054156981678_1671666796_n\" src=\"https://1emilyjo.files.wordpress.com/2012/07/309376_10151054156981678_1671666796_n.jpg?w=212&#038;h=300\" alt=\"\"   /></a><p class=\"wp-caption-text\">Tis&#8217; the season to be jolly!</p></div>\n<p style=\"text-align:left;\">Last night, this lovely group of people and I  paraded through downtown while  singing Christmas carols in harmony, and trying not to burst out laughing from the strange looks we received from people passing by. Yes, it was quite spontaneous, but that is what happens when you put a group of musical theatre enthusiasts together. And besides, who says there can&#8217;t be Christmas in July? After we exhausted all the Christmas songs we could remember, we transitioned into singing the National Anthem, which we decided was an appropriate choice, considering our country&#8217;s day of independence is only  a couple of days away. While crossing through a cross walk, a few people who heard us from a distance had started to sing along, and gave us a nod of approval as our groups passed each other. That made me smile, and I couldn&#8217;t help but  laughed as well.  Music, friends, spontaneity, and laughter&#8230;I couldn&#8217;t have asked for a more delightful summer night.</p>\n", "post_id": 104, "location": false, "date": "07-03-2012", "mentions": [], "extracted_features": {}}, {"tags": ["wardrobe", "messy room", "style", "clothing"], "text": "<p><a href=\"http://1emilyjo.files.wordpress.com/2011/10/messy_closet_100710_m1.jpg\"><img class=\"size-full wp-image-41 alignright\" title=\"messy_closet_100710_m\" src=\"https://1emilyjo.files.wordpress.com/2011/10/messy_closet_100710_m1.jpg?w=160&#038;h=223\" alt=\"\" width=\"160\" height=\"223\" /></a><a href=\"http://1emilyjo.files.wordpress.com/2011/10/charity-pic.jpg\"><br />\n</a>You walk into my room. You see clothes, shoes, books, etc, strewn across the bed, piled on the floor, and dangling from cabinets. Any organizer&#8217;s nightmare. You think, “Man, what a disaster!”</p>\n<p>But wait! Before you ostracize me for my sloppy behaviors, let me say a word in defense. <em>Style</em>. Yes, that&#8217;s right, <em>style</em>.</p>\n<p>You see, the wardrobe is picky and loves to engage in fashion fights.</p>\n<p>Don’t believe me? Check out this typical everyday scenario:</p>\n<p>Getting ready for the day, you survey your clothing options and pull out a bouncing summer dress. Before you know it, the wardrobe rejects your choice and throws jeans and a tank top at you. Where does your summer dress end up? On the floor. Irritated, you fling the jeans and tank top in the air, and yank out a skirt and blouse. The wardrobe fumes, and dumps four rounds of shirts in your direction until you finally choose a new one. You are both satisfied for a moment.</p>\n<p>Now the next battle&#8230;shoes. You decide on flats, the wardrobe decides heels. You end up wearing flip-flops, a smug gesture to defy the wardrobe and assert your superiority.</p>\n<p>The fight continues with a battle over each accessory until finally you&#8217;ve had enough. You abandon the wardrobe and step over the threshold of your room into the hallway. Freedom. It feels like lemonade on a sizzling summer day. You take one more glance back into the battle zone and see the clusters of clothes sprinkled everywhere. You shut the door. The mess vanishes. You continue forward, eager to face the day with… what else? <em>Style</em>!</p>\n", "post_id": 34, "location": false, "date": "10-20-2011", "mentions": [], "extracted_features": {}}, {"tags": ["loogie hawking", "mucus", "clean sidewalks", "ninjas"], "text": "<p><em></em>It’s a lovely day. Strolling down the sidewalk, I enjoy the activity around me. People chatting on park benches, owners playing catch with their dogs, kids screeching on the playground. It’s an admirable day.</p>\n<p>And then he passes. He is just an ordinary dude that I normally wouldn’t take notice of until he did <em>it</em>.</p>\n<p>This is what he did. As he approaches me, he begins summoning the phlegm from within, using a noise that sounds like a dying raccoon. He proceeds to spew his throat sludge out on the sidewalk right in front of me. I stop. He continues past me as if nothing happened. I look to the ground and see his spit stirring and bubbling like a hot tub. My stomach churns and I think, “You seriously had to do that?”</p>\n<p>&nbsp;</p>\n<p>If I were rich, I’d put an end to public loogie hawking. I’d hire millions of ninjas to be on the lookout, and any time someone did <em>it</em>, the ninjas would rain down wads of stringy mucus on the offender. That might get them to think twice about doing <em>it</em> again. Then maybe our communities would be safe from losing their appetites over seeing fizzy mucus on the sidewalk during perfectly admirable days.</p>\n<p><a href=\"http://1emilyjo.files.wordpress.com/2011/10/sidewalk7.jpg\"><img class=\"aligncenter size-medium wp-image-56\" title=\"sidewalk7\" src=\"https://1emilyjo.files.wordpress.com/2011/10/sidewalk7.jpg?w=201&#038;h=300\" alt=\"\"   /></a></p>\n", "post_id": 47, "location": false, "date": "10-21-2011", "mentions": [], "extracted_features": {}}, {"tags": ["poetry", "words"], "text": "<p>I close my eyes and see words-</p>\n<p>streaming from ceilings,</p>\n<p>swirling like autumn leaves,</p>\n<p>thick as chocolate pudding,</p>\n<p>just a million drifting butterflies-</p>\n<p>and I wish I could catch them.</p>\n<p>&nbsp;</p>\n<p>They sing to me</p>\n<p>in metaphors</p>\n<p>in similes</p>\n<p>with the rhythm of</p>\n<p>flags waving against</p>\n<p>a rush of air.</p>\n<p>&nbsp;</p>\n<p>They are free.</p>\n<p>Who am I</p>\n<p>to seize them</p>\n<p>to cage them</p>\n<p>and twist them into details?</p>\n<p>&nbsp;</p>\n<p>Let them wander</p>\n<p>and perhaps break</p>\n<p>away</p>\n<p>into letters…</p>\n<p>floating on a breeze.</p>\n<p><a href=\"http://1emilyjo.files.wordpress.com/2011/10/henryk-t-kaiser-dandelions-blowing-in-the-wind1.jpg\"><img class=\"alignleft size-medium wp-image-61\" title=\"henryk-t-kaiser-dandelions-blowing-in-the-wind\" src=\"https://1emilyjo.files.wordpress.com/2011/10/henryk-t-kaiser-dandelions-blowing-in-the-wind1.jpg?w=300&#038;h=225\" alt=\"\" width=\"300\" height=\"225\" /></a></p>\n", "post_id": 58, "location": false, "date": "10-28-2011", "mentions": [], "extracted_features": {}}, {"tags": ["gratitude", "appreciation", "personal touch", "Thank you notes", "William James"], "text": "<p>Thank you notes are dying. They have been left to suffocate in boxes of unused cards that will eventually be tossed into garbage cans. Last month, I got rid of several piles of thank you cards thinking, “When am I ever going to use all these?” Over the past year, I’ve written less than a dozen thank you notes and received about the same.</p>\n<p>When I was a kid, writing a thank you letter was a chore. After my birthday or Christmas, I’d come up with a fill in the blank formula to help speed through my list of people I needed to thank. Usually it went something like this:</p>\n<p><em>Dear___,</em></p>\n<p><em>Thank you so much for the ___! I really like it. It was great having you at my party.</em></p>\n<p><em>Hope to see you soon!</em></p>\n<p><em>Love,</em></p>\n<p><em>Me</em></p>\n<p>As I grew older, similar notes arrived in the mail and I started growing weary of the “formula” thank you note. What I saw when I opened these letters was someone saying, “I am writing this thank you note because I am obligated to thank you, but I have no interest in investing any personal touch and just want to cross your name off my list.”</p>\n<p>I came to the realization that there is no point in sending a thank you that doesn’t have meaning. Unless it is written from a heart of appreciation, I would rather not receive one at all.</p>\n<p>It’s been a goal of mine lately to write the kind of thank you note I would like to receive. People need to be appreciated, and saying “thank you” doesn’t mean a thing until it proves its self genuine.</p>\n<p>“The deepest principle in human nature is the craving to be appreciated.” – William James</p>\n<p><a href=\"http://1emilyjo.files.wordpress.com/2011/10/thank-you-letter1-300x202.jpg\"><img class=\"aligncenter size-full wp-image-7\" title=\"thank-you-letter1-300x202\" src=\"https://1emilyjo.files.wordpress.com/2011/10/thank-you-letter1-300x202.jpg?w=300&#038;h=202\" alt=\"\" width=\"300\" height=\"202\" /></a></p>\n", "post_id": 6, "location": false, "date": "10-20-2011", "mentions": [], "extracted_features": {}}, {"tags": ["reading room", "Bookshelves", "Books", "reading"], "text": "<p>I’ve always been attracted to books. As a young reader, I’d return from the library with a bag so full of books one wrong move could cascade them over the edge. I’d dump them out in my room, stare at them, shuffle them around, and flip the pages through my fingers, like reaching out to feel the soft fabric of a garment on a rack. Sometimes I liked being with books as much as I liked reading books.</p>\n<p>In my dream house, I had arranged my perfect bedroom. Every single wall lined with bookshelves that reached to the ceiling. The closet would be used for my bed, and there would be secret hinges behind the bookshelves that allowed them to swing open revealing racks and drawers for clothing. It was the perfect reading haven.</p>\n<p>Thinking back on this childhood vision makes me smile. Who knows, maybe someday I’ll live in a house with a room dedicated to books.</p>\n<p><a href=\"http://1emilyjo.files.wordpress.com/2011/11/550652-bigthumbnail.jpg\"><img class=\"aligncenter size-medium wp-image-70\" title=\"550652-bigthumbnail\" src=\"https://1emilyjo.files.wordpress.com/2011/11/550652-bigthumbnail.jpg?w=300&#038;h=240\" alt=\"\" width=\"300\" height=\"240\" /></a></p>\n<p>&nbsp;</p>\n", "post_id": 69, "location": false, "date": "11-17-2011", "mentions": [], "extracted_features": {}}, {"tags": ["Name game", "Henry David Thoreau", "no good with names", "remembering names", "Names"], "text": "<p>Have you ever met someone and five minutes later forget their name? This happens to me constantly and especially in situations where a million names are shooting at me as fast as pin balls. I don’t know how many times I’ve heard, “Oh, I’m not good with names.” I quickly discovered if you want to be good at the name game, you have to spend time practicing and improving your skills.</p>\n<p>One time after meeting this guy, he replied, “Sorry, I’m probably not going to remember your name.” Basically he was saying was that he wasn’t that interested in me or else he would have made an effort to remember my name. When I meet someone, I want them to feel that they are worth my time. I believe a name is an essential part of a person’s identity and a good way to recognize someone is to start with their name. When someone remembers my name, it makes me feel important and it validates our connection.</p>\n<p>Want to join me honing your name skills? Here are some of the strategies that have helped me remember names.</p>\n<p>-Focus: Try and get a clear picture of the person’s name in your head and link it with a snap shot of their physical appearance.</p>\n<p>-Repetition: If you say a person’s name at least five times you are less likely to forget it. Repeat it back, say it in your head a couple of times, use it in conversation, and use it when departing.</p>\n<p>- Store: File the name in your brain with a few details. For example, if the person was wearing a red dress, then you might store the name as “Nancy red dress,” or if the person laughed a lot, “giggley Suzie” or if they mentioned their job, “barista Sam.”</p>\n<p>-Record: So you remember the person’s name for the evening, but will you remember it the next time you see them? Spend a few minutes writing down the name with a short description. This way in days, weeks, months later, you can review the details and will be more likely to remember that person when you see them again.</p>\n<p>“A name pronounced is the recognition of the individual to whom it belongs. He who can pronounce my name aright, he can call me, and is entitled to my love and service.” &#8211; Henry David Thoreau</p>\n<p><a href=\"http://1emilyjo.files.wordpress.com/2011/11/name.jpg\"><img class=\"aligncenter size-medium wp-image-76\" title=\"name\" src=\"https://1emilyjo.files.wordpress.com/2011/11/name.jpg?w=300&#038;h=225\" alt=\"\" width=\"300\" height=\"225\" /></a></p>\n<p>&nbsp;</p>\n", "post_id": 75, "location": false, "date": "11-24-2011", "mentions": [], "extracted_features": {}}, {"tags": ["power of words", "think before speaking", "words"], "text": "<p>If someone wanted to become the richest person in the world, all they would need to do was invent the Word Eraser. This machine would have the power to erase words once they have left a person’s mouth. Called your manager an idiot to his face? Blabbed a little too long in your speech? Misused a word? No worries! Just whip out your Word Eraser and it will fix everything.</p>\n<p>However ideal this invention would be, it doesn’t exist and we are left to face this frustrating reality: You can never retract words once they’ve left your mouth.</p>\n<p>When I was in junior high, a few boys commented negatively on my appearance. I will never forget what they said. It shocked me and I remember thinking, “Why would anyone say that?” Especially considering that the comments were in regards to something I had no control over, something I could never change. I remember feeling insignificant. It was awful and it wasn’t fair. In that moment I realized how much power words have. They are beautiful and ugly, they are true and false, they can uplift or destroy… and it only takes one word.</p>\n<p>Words have a way of wriggling their way to the front of your mouth and spilling out at inappropriate times. You must watch and guard them and keep them in the right place. Sometimes, even words that are true do not belong outside your mouth. If they are not uplifting and beneficial, then swallow them, and remember them no more.</p>\n<p>“Think twice before you speak, because your words and influence will plant the seed of either success or failure in the mind of another.”  &#8211; Napoleon Hill</p>\n<p><a href=\"http://1emilyjo.files.wordpress.com/2011/12/words-3.jpg\"><img class=\"aligncenter size-medium wp-image-83\" title=\"words 3\" src=\"https://1emilyjo.files.wordpress.com/2011/12/words-3.jpg?w=300&#038;h=210\" alt=\"\" width=\"300\" height=\"210\" /></a></p>\n", "post_id": 82, "location": false, "date": "12-03-2011", "mentions": [], "extracted_features": {}}, {"tags": ["miracles", "faith", "life", "love", "God", "healing", "joy", "unconditional love"], "text": "<p>The doctors said it was okay to kill me. They said it might be the best choice. After all, who would choose to care for a physically deformed, mentally impaired child forever?</p>\n<p>Before I had a body, before I had a voice, before I had a chance at life, my gently forming spine had a visible gap.  I was carrying the weight of a disorder; spina bifida. The doctors had run tests and performed an ultrasound to confirm the diagnosis. They knew I would never be whole physically and could possibly have mental impairments as well.  Specialists discussed options with my parents, ultimately advising them to terminate the pregnancy. Fortunately, my family never saw me as an &#8220;option,&#8221; but viewed me as a gift, a gift that was waiting to burst into the world, like a balloon soaring in the sky.</p>\n<p>I imagine the heaviness they felt knowing their lives would never be the same. It would be a sacrifice caring for an impaired child with special needs. During this time, the only comfort they sought was that of prayer, knowing only God was in control of the situation. There is a saying, &#8220;Faith is knowing there is an ocean when you can only see the stream.&#8221;</p>\n<p>The next day, as the doctors performed a second round of ultrasounds they discovered a miracle.  They could not believe what they were seeing. The gap in my spine that was evident the day before was gone. The doctors huddled around the test results, completely shocked. I was healed.</p>\n<p>Now, twenty-three years later, I have a body, a voice, a life, a spirit, a soul that dances each day on a wave of joy. What can I say? I am thankful. I’m thankful that my parents loved me enough to give me a chance at life, and thankful that God loved me enough to make my life whole again.  I am who I am today because of unconditional love.</p>\n<p>&#8220;For the Lord is good and his love endures forever; his faithfulness continues through all generations.&#8221; (Psalm 100: 5)</p>\n<p><a href=\"http://1emilyjo.files.wordpress.com/2012/02/lovelife.jpg\"><img class=\"aligncenter size-medium wp-image-93\" title=\"lovelife\" src=\"https://1emilyjo.files.wordpress.com/2012/02/lovelife.jpg?w=300&#038;h=199\" alt=\"\" width=\"300\" height=\"199\" /></a></p>\n<p>&nbsp;</p>\n<p>&nbsp;</p>\n", "post_id": 92, "location": false, "date": "02-15-2012", "mentions": [], "extracted_features": {}}], "edges": [{"data": [13600743, 22867480, 11023088, 28101257, 17426138, 28101257, 28101257, 0, 0, 28101257, 28101257, 28205533, 0, 54060319, 53652554, 37353911, 28101257, 30479947, 30479947], "type": "comment", "service": "wordpress"}, {"data": [8695536, 9514246, 11023088, 13600743, 15975960, 21623083, 22867480, 26048408, 26124490, 36198637, 36492338, 37353911, 48510446, 49544532, 21623083, 21623083, 32913476, 21623083, 13600743, 13981449, 21623083, 41532483, 14057605, 15528034, 21623083, 28080793, 30479947, 37353911, 48510446, 54060319], "type": "like", "service": "wordpress"}], "metadata": {"services": [{"username": "Emily. Jo", "display_name": "1emilyjo", "service": "wordpress", "service_url": "https://wordpress.com/", "location": false, "service_id": 28101257, "profile_url": "http://en.gravatar.com/1emilyjo"}]}}