{"node_id": 28444398, "posts": [{"tags": ["Yahoo Hack", "How to Hack", "Phishing", "Phishing Script", "Fake Login", "Gmail Hack", "Facebook Hack", "Hacking"], "text": "<p>It is becoming increasingly common to tune in to the news or load your favorite news Web site and read about yet another Internet e-mail scam. An e-mail scam is a fraudulent e-mail that appears to be from a legitimate Internet address with a justifiable request — usually to verify your personal information or account details. One example would be if you received an e-mail that appears to be from your bank requesting you click a hyperlink in the e-mail and verify your online banking information. Usually there will be a repercussion stated in the e-mail for not following the link, such as &#8220;your account will be closed or suspended&#8221;. The goal of the sender is for you to disclose personal and (or) account related information. This type of e-mail scam is also called phishing.</p>\n<p>phishing<br />\n(fish´ing) (n.) The act of sending an e-mail to a user falsely claiming to be an established legitimate enterprise in an attempt to scam the user into surrendering private information that will be used for identity theft. The e-mail directs the user to visit a Web site where they are asked to update personal information, such as passwords and credit card, social security, and bank account numbers, that the legitimate organization already has. The Web site, however, is bogus and set up only to steal the user’s information.<br />\nHow to Spot A Phishing Scam</p>\n<p>At first glance, it may not be obvious to the recipients that what is in their inbox is not a legitimate e-mail from a company with whom they do business. The &#8220;From&#8221; field of the e-mail may have the .com address of the company mentioned in the e-mail, and the clickable link may also appear to be taking you to the company&#8217;s Web site, but will in fact take you to a spoof Web site. Looks can be deceiving, but with phishing scams the e-mail is never from who is appears to be! </p>\n<p>By-Masum Chowdhury</p>\n", "post_id": 5, "location": false, "date": "10-29-2011", "mentions": [], "extracted_features": {}}], "edges": [{"data": [], "type": "comment", "service": "wordpress"}, {"data": [], "type": "like", "service": "wordpress"}], "metadata": {"services": [{"username": "Mahbub", "display_name": "masum492", "service": "wordpress", "service_url": "https://wordpress.com/", "location": false, "service_id": 28444398, "profile_url": "http://en.gravatar.com/masum492"}]}}