{"node_id": 35798313, "posts": [{"tags": [], "text": "<p>Welcome to <a href=\"https://wordpress.com/\">WordPress.com</a>! This is your very first post. Click the Edit link to modify or delete it, or <a title=\"Direct link to Add New in the Admin Dashboard\" href=\"/wp-admin/post-new.php\">start a new post</a>. If you like, use this post to tell readers why you started this blog and what you plan to do with it.</p>\n<p>Happy blogging!</p>\n", "post_id": 1, "location": false, "date": "05-14-2012", "mentions": [], "extracted_features": {}}, {"tags": [], "text": "<p>Letter from the Division of Assessments, Township of Piscataway, New Jersey To All Property Owners:</p>\n<p>May 2012</p>\n<p>Dear Property Owner:</p>\n<p>The Township of Piscataway will be conducting a complete revaluation of all properties to become effective in 2014.  The revaluation was ordered by the Middlesex County Board of Taxation and has been approved by the Director of the Division of Taxation for the State of New Jersey.  The purpose of the revaluation is to determine &#8220;fair market value&#8221; and to ensure the fair and equitable distribution of the real estate tax burden among all property owners.</p>\n<p>Piscataway has contracted with Realty Appraisal Company to conduct the revaluation.  Realty Appraisal is highly skilled in mass appraisal techniques and comes to the Township with over fifty (50) years experience in municipal revaluations.</p>\n<p>In order to properly assess your property, a complete inspection of the INTERIOR and EXTERIOR of each building is necessary.  Data Collectors will conduct interior inspections as well as measure the exterior of every structure.  Photographs of each property will also be taken.  If your property is rented please make your tenants aware of the upcoming inspection.</p>\n<p>In addition each owner of an income producing property will be required to provide income and expense information at a later date.</p>\n<p>For your protection, each representative/data collector of Reality Appraisal Company will be provided with a letter of identification as well as photographic identification.  The photo identification will be worn by each representative. DO NOT permit anyone who is unable to properly identify him or herself to enter your property.</p>\n<p>At the conclusion of the revaluation each property owner will receive notification of their new assessed value.  Upon your request, a qualified representative of Realty Appraisal will conduct an informal review of the value with you.</p>\n<p>A pamphlet with frequently asked questions is enclosed for your information.  You may also visit the Tax Assessor&#8217;s page on the Township&#8217;s website at: <a href=\"http://www.PISCATAWAYNJ.ORG\">WWW.PISCATAWAYNJ.ORG</a> .  Realty Appraisal&#8217;s website at:  <a href=\"http://www.REALITYAPPRAISAL.NET\">WWW.REALITYAPPRAISAL.NET</a> or view a special taping of: <strong>&#8220;What you should know about the revaluation process&#8221; </strong>on Cablevision Channel 15 and Verizon FiOs Channel 40 (live stream available on PCTV Page of Township&#8221;s website) for additional information.</p>\n<p>Thank you in advance for your cooperation.</p>\n<p>Very truly yours,</p>\n<p>Lisa E. Stephens, CTA Assessor</p>\n<p>Division of Assessments</p>\n<p>Tel: (732) 562-2328</p>\n<p>Fax: (732) 529-2509</p>\n<p>[...to be continued...]</p>\n", "post_id": 3, "location": false, "date": "05-14-2012", "mentions": [], "extracted_features": {}}], "edges": [{"data": [], "type": "comment", "service": "wordpress"}, {"data": [], "type": "like", "service": "wordpress"}], "metadata": {"services": [{"username": "usnveteran", "display_name": "usnveteran", "service": "wordpress", "service_url": "https://wordpress.com/", "location": false, "service_id": 35798313, "profile_url": "http://en.gravatar.com/usnveteran"}]}}