{"node_id": 42412422, "posts": [{"tags": ["relationships", "humor", "love", "education", "thoughts", "inspiration"], "text": "<p>&#8220;The past is the past.&#8221; &#8220;Hindsight is 20/20.&#8221; &#8220;You have to learn to walk before you can run.&#8221; &#8220;Every mistake is a learning experience.&#8221; &#8220;Nothing is ever as bad as it seems&#8221; &#8220;Do you know the muffin&#8230;&#8221; wait.. that last one doesn&#8217;t belong.</p>\n<p>But that&#8217;s how our mind works, doesn&#8217;t it? We spend hours every day rationalizing the decisions we make. We know what makes us happy. We know what to do for others to make them happy. We know how to motivate ourselves to accomplish something small or large. When we make mistakes, we know we&#8217;re supposed to learn from them. We know that no matter how bad things seem, it could always be worse. We know we have to forgive and move forward in order to truly get over something. We know what our boy friend or girl friend needs to say in order for us to feel reassured and loved. We know, we know, we know. So why do we let that little voice in the back of our head get us off track? It doesn&#8217;t belong! Why do we doubt ourselves? Why are we so silly sometimes in how we over think things? I can&#8217;t answer that. But what I do know is those mantras from the beginning of the post are ones that I have to remind myself of often to stay on track.</p>\n<p>As a 24 year old woman, my mind runs at max capacity all day, every day. And there are times when I&#8217;m not proud of what I think and what inevitably comes out of my mouth. But like the mantra in the beginning, I do truly and fully believe that everything is a learning experience- if you let it be one. And that&#8217;s what I hope to share here. Those &#8220;ah-ha&#8221; moments when you realize how crazy you&#8217;re being, because trust me you are, and trust me you&#8217;re not alone. We all lose track of how we want to act and the people we want to be. I do it more often than I&#8217;d like to admit, so hopefully this blog will not only serve you well, but I&#8217;m hoping I&#8217;ll also be able to remember my own advice more easily. I hope to share my own experiences, the experiences of my friends, lessons learned, and how to look back and LAUGH at yourself. If I&#8217;ve learned anything in the last few months from one of the closest people to me, it&#8217;s you HAVE to laugh at yourself. Seriously. We are so silly. Especially Steve Buscemi. I mean just look at him.</p>\n<p><a href=\"http://1girl101thoughts.files.wordpress.com/2012/11/4-9-steve-buscemi1.jpg\"><img class=\"aligncenter size-medium wp-image-30\" title=\"4-9-steve-buscemi1\" alt=\"\" src=\"https://1girl101thoughts.files.wordpress.com/2012/11/4-9-steve-buscemi1.jpg?w=219&#038;h=300\" height=\"300\" width=\"219\" /></a></p>\n", "post_id": 12, "location": false, "date": "11-19-2012", "mentions": [], "extracted_features": {}}, {"tags": ["humor", "funny guy joke", "humor relationships life writing girl"], "text": "<p><a href=\"http://thedoghousediaries.com/4704\">DOGHOUSE | I See What’s Happening Here</a>.</p>\n<p style=\"text-align:center;\"><a href=\"http://thedoghousediaries.com/4704\"><img alt=\"\" src=\"https://1girl101thoughts.files.wordpress.com/2012/11/2012-11-07-a4d183b.png\" /></a></p>\n", "post_id": 21, "location": false, "date": "11-19-2012", "mentions": [], "extracted_features": {}}, {"tags": ["biology", "psychology", "people", "science", "cool", "mind", "brain", "education", "thoughts", "inspiration"], "text": "<p>So, I realize that my post Monday was super long, and wasn&#8217;t planning on posting anything for a few days. Until I saw this. Don&#8217;t worry! It&#8217;s a video&#8230;that&#8217;s 16 minutes long&#8230;unheard of I know. BUT WAIT! Before you go back to your reader, or worse, click &#8220;unfollow&#8221;, I swear it&#8217;s interesting.</p>\n<p>Rick Hanson, a neuropsychologist, argues that we are all pre-programmed to expect the worst and think negatively because of our caveman and hunter-gatherer routes. Back in the &#8220;Jurassic Park days&#8221; we weren&#8217;t relaxing with our feet up. We were going going going looking for food and keeping an eye out for potential attackers (human and animal). We thought about and prepared for the worst because it meant the difference between survival and saber tooth tiger food. Today, we are not cavemans and in order for our brain to adapt to the 21st century lifestyle we&#8217;ve come to know, we have to exercise positive and happy thoughts to strengthen that part of your brain. Literally strengthen. I found it to be a super cool video, and definitely a new take on that &#8220;little voice&#8221;.</p>\n<span class='embed-youtube' style='text-align:center; display: block;'><iframe class='youtube-player' type='text/html' width='640' height='390' src='https://www.youtube.com/embed/a-GJivPkHXk?version=3&#038;rel=1&#038;fs=1&#038;showsearch=0&#038;showinfo=1&#038;iv_load_policy=1&#038;wmode=transparent' frameborder='0' allowfullscreen='true'></iframe></span>\n", "post_id": 214, "location": false, "date": "11-21-2012", "mentions": [], "extracted_features": {}}, {"tags": ["funny", "humor", "silly"], "text": "<p style=\"text-align:left;\">An accurate depiction I&#8217;d say. Click the link for more funnies about your brain! <a style=\"text-align:left;\" href=\"http://theoatmeal.com/pl/brain/memory\">How my brain remembers things &#8211; The Oatmeal</a><span style=\"text-align:left;\">. </span></p>\n<p style=\"text-align:center;\"><a href=\"http://1girl101thoughts.files.wordpress.com/2012/11/memory.png\"><img class=\"aligncenter size-large wp-image-242\" title=\"memory\" alt=\"\" src=\"https://1girl101thoughts.files.wordpress.com/2012/11/memory.png?w=403&#038;h=1024\" height=\"1024\" width=\"403\" /></a></p>\n", "post_id": 236, "location": false, "date": "11-21-2012", "mentions": [], "extracted_features": {}}, {"tags": ["relationships", "funny", "life", "work", "fordham", "inspiration", "new york city", "men", "humor", "lifestyle", "love", "education", "friends", "manhattan", "change", "women"], "text": "<p>It&#8217;s no big surprise that having Manhattan as your playground, home, and/or work place makes you one of the luckiest people in the world. I&#8217;m serious. I love taking the subway one stop in any direction and emerging to what feels and looks like a completely different area. I love knowing that no two people on the street will look the same, and that even goes for all you hipsters out there (side note, is the cold making you guys hibernate or something??? I&#8217;m worried, where are you?).  I love knowing if I need anything at any time of day on any day of the week, that I can find it within 5 minutes.  I love walking around areas like the lower east side with really no destination only to find a small and tucked away bar with plush couches, cards, a short wine and beer list, and an assortment of board games. Similarly, I love knowing that no matter how many people are on the street, no matter how high the buildings may rise, I can still find that tucked away bar and feel at home.</p>\n<p>Many of my wanderings and experiences in this amazing city the last few months have been a result of &#8220;20 seconds of bravery&#8221;. Something we should all try to keep in mind when we are hesitant to step out of that comfort zone. I found myself single a while back for the first time in a while. Having ended a relationship that went on 6 months longer than it should have (been there?) I found myself dying to meet new people. Excited to go to bars and make eye contact and flirt with guys. Run into my dream guy waiting in line for coffee at the deli on the corner by my office (you know you&#8217;ve thought of that scenario too). But after a few months, I hadn&#8217;t met one person. Hadn&#8217;t gotten a smile from one guy (that I noticed). No one offered to buy me a drink at a bar, and I stopped going to that deli on the corner for coffee. I soon realized that after having gone to school in the Bronx and working in Manhattan for 2+ years, I could count on one hand the number of times someone has come up to me or introduced themselves to me and my friends (shout out to my beautiful friends). I started to get really frustrated, thinking &#8220;what am I going to do?? I&#8217;m too young to be a cat lady!&#8221;. I then realized, Kim, if you want something, you have to go after it. Ground breaking right?</p>\n<p>So what did I do? I did something I NEVER thought I&#8217;d do. And for those of you thinking that I&#8217;m about to reveal some mind-blowing, totally original decision, you&#8217;re gonna be let down. I joined an online dating site. I randomly saw a posting about someone&#8217;s experience on the site, and suddenly, before I even knew it, I was typing the URL to the site and signing up. I have never been against dating sites but always thought they were good for &#8220;other people&#8221;. I just never saw myself taking the plunge, being someone who thrives off of the atmosphere and energy when talking to someone in person. I didn&#8217;t think you could have any kind of connection over the internet, so it was far from my mind. After a few weeks, I was having a blast. I enjoyed reading the &#8220;let&#8217;s hang out in my bedroom sometime&#8221; messages and got a kick out of users from other countries trying to reach out. If anything, I felt the love, even from the creeps. With out going into any details, I ended up finding someone who I think is pretty great. In hindsight, I feel pretty silly for closing myself off to something just because I didn&#8217;t think it was for me or would work for me. How do you know something isn&#8217;t for you until you try? I know you&#8217;ve all heard something along those lines before, but how often have you actually applied that logic?</p>\n<p>Over the last few months, I&#8217;ve heard a lot of people complaining about the same thing I used to complain about. Most recently, I was at a bar in Murray Hill hanging out with some great people, drinking some beer, and watching football. I found myself talking to an adorable girl who was going on and on about being single. About how she just wants to meet someone genuine. About how she is tired of being the third wheel all the time. So I asked her, &#8220;have you ever gone to meetups? Have you thought about online dating? Have you thought about speed dating? Have you thought about joining a co-ed sports league?&#8221; Her answer was no to all of those. How can you expect to find something different if you don&#8217;t do anything differently in your life? Seriously, some times all it takes is 20 seconds of bravery for something really beneficial to happen.</p>\n<p>Success in dating aside, the idea of 20 seconds of bravery is something I&#8217;ve really tried to keep in mind since signing up for that online dating site. I have applied it elsewhere in my life  as best as I can. Instead of approaching family issues in a way I had before, I tried something different, and it&#8217;s been working. Instead of sitting here being somewhat disappointed with my professional life and complaining about it all of the time, I&#8217;ve signed up for classes online and in person so I can start fulfilling my own goals, instead of waiting for them to just happen.  Again, this isn&#8217;t mind-blowing advice. We&#8217;ve all been told we have to take risks and step outside of our comfort zone. But it is far easier to say those little mantras than to actually act on them. Each time I have taken a risk in the last 6 months, it has worked out because each time it has been from my gut. I think sometimes we forget how routine our lives are. Even for you people out there that aren&#8217;t &#8220;routine people&#8221;. We all have routines, and they keep us in our comfort zone, where we like to be. But a lot of the time, especially if you&#8217;re in your 20&#8217;s and trying to figure out where you want your life and career to go, we are still left unsatisfied in our comfort zone. So, it&#8217;s not really our comfort zone then is it?</p>\n<p>The gist is this: To all of the single people out there and all of the unfulfilled professionals out there, take a risk. You&#8217;re in control of your life and of the decisions you make. Don&#8217;t complain about not having what you want when you are only making the same efforts over and over again. What you know and are familiar with isn&#8217;t always what works. If you&#8217;re used to going to bars and drinking your face off while looking for a guy/girl and failing, you should probably try a different strategy. If you&#8217;re unhappy working in finance, stop bothering your friends with text messages about how awful it is and how lucky they are that they have great jobs. Make a change. Be brave.</p>\n", "post_id": 260, "location": false, "date": "11-26-2012", "mentions": [], "extracted_features": {}}, {"tags": ["funny", "life", "humor", "joke", "men", "silly", "women"], "text": "<p><a href=\"http://thedoghousediaries.com/2028\"></a></p>\n<p style=\"text-align:left;\">Happy Monday!</p>\n<p><a href=\"http://thedoghousediaries.com/2028\">DOGHOUSE | Olfactory Girl</a>.</p>\n<p style=\"text-align:center;\"><a href=\"http://thedoghousediaries.com/2028\"><img src='https://1girl101thoughts.files.wordpress.com/2012/11/2010-10-22-b64cd1a.png' alt='' /></a></p>\n<p>&nbsp;</p>\n", "post_id": 273, "location": false, "date": "11-27-2012", "mentions": [], "extracted_features": {}}, {"tags": ["love", "sports", "education", "friendship", "hope", "inspiration"], "text": "<p><a href=\"http://espn.go.com/blog/bigeast/post/_/id/39662/video-kick-of-hope\">espn.go.com/blog/bigeast/post/_/id/39662/video-kick-of-hope</a></p>\n<p>Happy December and happy Monday. Take a few minutes and watch as College GameDay profiles Rutgers&#8217; superfan Anthony Starego, who has battled autism and recently kicked a game-winning field goal to help Brick upset Toms River North.</p>\n", "post_id": 283, "location": false, "date": "12-03-2012", "mentions": [], "extracted_features": {}}, {"tags": ["relationships", "humor", "men", "women", "love", "comedy", "hope", "inspiration"], "text": "<p>Thought Catalog is one of my favorite blogs to follow. Not only because it posts hilarious commentary on society and current events, but also because every once and while they post a gem like this one that makes me go &#8220;hell yea&#8221; &#8230; in a way.</p>\n<p><a href=\"http://thoughtcatalog.com/2012/you-need-to-go-after-the-things-you-want/\">You Need To Go After The Things You Want | Thought Catalog</a>.</p>\n<p>In this recent post, the author talks about how we are only hurting ourselves by trying to remain &#8220;cool, calm and collected&#8221; all of the time when it comes to love and emotions. While I maintain that it is important not to become unhinged and some crazy emotional person, the <strong>sentiment</strong> of the article is still something I completely agree with (take everything with a grain of salt, people).</p>\n<p><strong>Embrace</strong> your love for another person.</p>\n<p>Don&#8217;t be afraid to be vulnerable.</p>\n<p>Don&#8217;t try to be the &#8220;cool girl&#8221; or the guy that lets everything roll of their shoulders when you really have something important to say.</p>\n<p>If you love someone, if you want someone, go after them, or you WILL regret it.</p>\n<p>Be you. Don&#8217;t listen to that voice that tells you &#8220;I&#8217;m scared I&#8217;m not ready&#8221; when the only place that voice is coming from is a place of fear.</p>\n<p>&#8220;Let it out. Let the love out.&#8221;</p>\n", "post_id": 293, "location": false, "date": "12-05-2012", "mentions": [], "extracted_features": {}}, {"tags": ["lessons", "relationships", "life", "work", "love", "advice", "men", "stress", "humor", "women", "inspiration"], "text": "<p style=\"text-align:center;\"><a href=\"http://1girl101thoughts.wordpress.com/2012/12/18/relax-youre-fine/2012-12-03-7460ac9/#main\" rel=\"attachment wp-att-314\"><img class=\"aligncenter size-full wp-image-314\" alt=\"2012-12-03-7460ac9\" src=\"https://1girl101thoughts.files.wordpress.com/2012/12/2012-12-03-7460ac9.png?w=640&#038;h=404\" width=\"640\" height=\"404\" /></a></p>\n<p>I was on the phone last night with an old friend talking about work and life and we some how stumbled upon the different kinds of relationships that we have in our lives presently. One of my closest friends complains about things over and over, and brings up issues from years ago and allows those things to still bother them. I do my best to be patient and give advice so they can move on, but more often than not I find myself just throwing my hands up in the air and wanting to walk away because I have no patience for people who don&#8217;t take control of their situations and just &#8220;figure it out&#8221;. Harsh, but to the point. Some will say I&#8217;m justified in doing that because if I&#8217;m friends with someone who constantly rides the drama train, I don&#8217;t need that in my life. But since I like to think I have a pretty big heart, I feel pretty crappy about it. I am pretty sure it&#8217;s a bad habit that I need to break.</p>\n<p>As I mulled this over with my friend, he made a fairly good point- I haven&#8217;t had the easiest life and have been dealing with stress, anxiety, and less than ideal situations for as long as I can remember. So it&#8217;s the norm for me, but it&#8217;s not the norm for the majority of the people in my life. For the most part, I got through pretty much everything with out confiding in anyone or asking for advice. Did I lean on those in my life in different ways as, say, distractions? Yes, but I have never been one to open up and ask for advice. I have a &#8220;do it yourself&#8221; attitude where I hold myself to extremely high expectations and always expect to do things myself (for the record, I&#8217;m aware that this stubbornness has not and will not always work out).</p>\n<p>As a result, it frustrates me when other people allow stress and anxiety to get the best of them for so long. We are all capable of being the best we can be, and I want more than anything for the people closest to me to believe that. But I find myself giving up lately. I often find myself wanting to just say &#8220;deal with it if you&#8217;re not going to fix it.&#8221; I know, again, harsh. But, as someone who always says &#8220;put yourself in the other person&#8217;s shoes&#8221;, I guess I needed last night as a reminder that I&#8217;m not the best all of the time at doing that. I need to stop and remind myself that while giving &#8220;tough love&#8221; is fine, for me to just give up because someone isn&#8217;t used to a crappy situation or stress the way I am is flat out wrong&#8230; right?</p>\n<p><strong>How Kim deals with stress in a few wordy, probably confusing, bullet points.. or something that resembles bullet points:</strong></p>\n<p><strong>DO</strong>  write out all of the things you want to get done in a day, and then split them up between things that are important/necessary, not so important/can live with out, and nice-to-haves. This is a super simple exercise I learned recently. I have always been the type of person who wants to get everything done quickly, and I&#8217;m an instant gratification person (for better or for worse). But looking at my chart of tasks and goals split up between what is actually time-sensitive and important vs what I can live with out having/doing made me feel immediately more focused, and honestly&#8230; silly. Silly for thinking that not being able to go to the gym one afternoon was a reason to get frustrated. I can go to the gym tomorrow! The meeting I had was far more important. So why let my missed gym class frustrate me for 10 minutes, 30 minutes, a few hours, what ever? It&#8217;s a waste of time and energy. Time and energy that could be spent doing something productive.</p>\n<p><strong>DON&#8217;T</strong> push people away or blame others for your stress. Trust me, you&#8217;ll only make things worse. The people closest to you will always know when something is on your mind. If your significant other or friend asks you if everything is okay, or if there is anything you want to talk about, don&#8217;t get defensive. It&#8217;s easy for us to do this, we all have and do. If you don&#8217;t want to talk about it, then don&#8217;t talk about it, but don&#8217;t take it out on them in that moment. Take a deep breath, consider venting, and if it&#8217;s not something you&#8217;re ready to talk about or something you feel you need to talk about, simply say &#8220;I appreciate it, but I&#8217;ll get past it. Thanks for asking.&#8221;  Life happens, bro. You&#8217;re in control of the decisions you make and in turn how you handle those ramifications.</p>\n<p><strong>DO</strong> look on the bright side. I try my best to deal with stress, any kind- in relationships, work, home, finances, you name it- in a way that allows me to see it in <strong>stages</strong>, and see silver linings/improvements/positives within those stages. When you &#8220;look on the brighter side&#8221; of things, you not only become less stressed, but you become more confident, and I firmly believe confidence is the key to handling stress. For example, if you&#8217;re in a relationship that has suffered for a while, it&#8217;s easy to keep focusing on what happened and allow that to make you doubt the future. But if things go relatively well for a sustained period of time, acknowledge it! Look at is as legitimate proof that things are better, getting better, and allow yourself to believe that they will continue to improve. Same goes for work and responsibilities- look at how hard it was in the beginning to take on more tasks and then how much you&#8217;ve accomplished since.</p>\n<p><strong>DON&#8217;T</strong> look at all of the overwhelming negatives and sudden changes as the be-all-end-all. This is where you break things apart into stages. It&#8217;s easy to fall back on the negatives and get down on yourself, punish yourself, what ever the case may be, but you need to make improvements and ACKNOWLEDGE improvements to get past stress and crappy situations. When you do this, everything becomes more manageable. Things aren&#8217;t going to be perfect, because we&#8217;re all human and mess up, and that&#8217;s ok.</p>\n<p><strong>DO</strong> try to learn from everything! I have a super competitive spirit, and I am my harshest critic. This is a blessing and a curse, since I can either use it to my advantage to push myself or belittle myself for not having done enough. It&#8217;s easy to beat myself up and feel unhappy over the slightest slip ups. When <i>you </i>are your toughest critic, you have to make sure you’re at least being constructive with it. It’s easy to be hard on ourselves and become our own confidence killer. Part of the reason why I&#8217;m writing this blog is because a lot of the things I write about/advice I try to share is a result of my own f*ck ups, recent ones and old. I&#8217;m trying to do something constructive with them. The only way to benefit from being hard on yourself is doing so in a productive manner. Understand what you did wrong previously and use that knowledge to make improvements for the future.</p>\n<p><strong>DO laugh at yourself</strong>. Look back on how you thought once, or what you once did, or how you used to act, and laugh about it. Don&#8217;t feel shame about it. Don&#8217;t start the cycle of belittling yourself. Just laugh. <a href=\"http://1girl101thoughts.wordpress.com/2012/11/19/we-are-ridiculous-or-why-i-decided-to-blog/\">We are ridiculous</a>.</p>\n", "post_id": 298, "location": false, "date": "12-18-2012", "mentions": [], "extracted_features": {}}, {"tags": ["insane", "relationships", "life", "humor", "girls", "problems", "health", "silly", "1girl101thoughts", "lifestyle", "education"], "text": "<p>To my closest friends and family, I&#8217;m the one who is pretty much anti-everything-girl. Pink? No thanks. Touching? Don&#8217;t even think about it. Romance? I&#8217;m gonna walk away now. I&#8217;ve hung with the guys since my playground days and I LOVE IT. You know why? Because I&#8217;d always thought girls are bat-sh*t-crazy. That&#8217;s right. Crazy, crazy B-words.</p>\n<p>I spent years sitting on couches unshowered, in sweatpants and an oversized tshirt, munching on chips and drinking bud light (or gatorade pre-college, go antisocial athletes) listening to guys complain about girls (while simultaneously debating the hotness of Megan Fox).</p>\n<p><strong>    &#8220;She&#8217;s so needy dude. Thank god she&#8217;s hot.&#8221;</strong></p>\n<p><strong>    &#8220;She misinterprets everything, I&#8217;m just going to stop talking.&#8221;</strong></p>\n<p><strong>    &#8220;She never wants to hang with my friends, but I ALWAYS have to hang with  </strong></p>\n<p><strong>     hers. You don&#8217;t hear me complaining to her about it!&#8221;</strong></p>\n<p><strong>    &#8220;She never stops complaining about what her friend who I can&#8217;t remember the</strong></p>\n<p><strong>      name of but is really chunky does to her to annoy her.&#8221;</strong></p>\n<p>Do I need to go on? I didn&#8217;t think so.</p>\n<p>When a guy instead comes across a girl who pays attention to the football game in the back of the bar, can practically out drink them and insult their friends (in a charming way of course), they immediately express &#8220;dude, that&#8217;s so cool&#8221;.</p>\n<p><strong>    I think it&#8217;s pretty cool too, bro.</strong></p>\n<p>This girl immediately becomes &#8220;one of the guys&#8221;. And it&#8217;s a great feeling to be one of the guys! Let&#8217;s watch football! Let&#8217;s hang on the couch all day and NOT GOSSIP AT ALL but instead talk about how hot the reporter is! Let&#8217;s watch South Park! I love guys. And I love being one of them.</p>\n<p>Having surrounded myself with guys for so long, when I date someone I inevitably end up expressing to either him or his group of friends that I too dislike girls who whine. I too dislike girls who over think everything. I too dislike girls who start fights based off of a misread text message in stead of calmly asking &#8220;can you please explain what you meant by that?&#8221;. I too dislike girls who don&#8217;t make the effort to become friends with their boy friend&#8217;s friends. I too dislike girls who use guilt to get their way (and are happy about it?!). It&#8217;s all true! So yeah, I agree with you guys on a lot of things about the stereo-typical girl, and I know there are a lot of girls out there who also feel the same way.</p>\n<p>But here&#8217;s where I get in to trouble myself. I can&#8217;t always be one of the guys. Most of the time I am that person who takes a step back and can see things from both sides. I&#8217;ve always been able to remain fairly objective and not get emotional, and I don&#8217;t believe in yelling or insulting to &#8220;express anger&#8221;, that just makes things worse. But, there are going to be times when my character is tested by emotions, we all go through it. There are going to be times when I &#8220;just need a hug&#8221;. There are going to be times when something a guy says is taken the wrong way. There are going to be times when something a guy does  or doesn&#8217;t do hurts and I want to express that. There are also, unfortunately, going to be times when I say something stupid because I was feeling needy, or over-sensitive, or too stubborn to ask for comfort. And that&#8217;s when I worry. I put an immense amount of pressure on myself to constantly keep my cool, never complain about anything, be understanding, be the bigger person, see things from both sides, etc etc etc, that I irrationally assume that if I break those habits for 1 minute, the guy I&#8217;m seeing will POOF! Disappear.</p>\n<p><strong>&#8220;She&#8217;s not who I thought man. She cried for like, 10 minutes because I said something wrong. I feel like I can&#8217;t be myself around her. Should probably end it now.&#8221;</strong></p>\n<p>That is literally how my mind works every time I feel like I&#8217;ve screwed up. Because I&#8217;m bat-sh*t crazy. I set ridiculous standards for myself and assume the expectations of the guy are just as high. I basically end up bottling everything inside of me, because I feel like I can&#8217;t vent or be vulnerable because then I&#8217;ll just be seen as the &#8220;needy emotional girl friend&#8221; that I&#8217;ve heard every guy complain about. I assume it&#8217;s impossible to be the tomboy AND the girl. And I do it all to myself.</p>\n<p><strong>Read: bat-sh*t crazy.</strong></p>\n<p>I beat myself up for a while after any kind of confrontation, because I inevitably think it was my fault.  And in a way, most of the time it is my fault. Ya know why?  It&#8217;s my fault because I bottle everything up to keep my &#8220;cool girl image&#8221;. It&#8217;s not a guys fault if they bring up a sore subject that they don&#8217;t know is sore because I haven&#8217;t shared it with them yet. It&#8217;s not a guys fault that I&#8217;m upset about something difficult going on in my life and they don&#8217;t know to ask &#8220;would you like to spend some time together tomorrow night talking about it?&#8221; if I don&#8217;t TELL them there&#8217;s an issue. Most guys, once they know the details of a problem, will go out of their way to be there for us and give us advice. We just have to let them by letting them in. If we get irrationally mad because they don&#8217;t read our minds, that&#8217;s when they throw their hands up. And I don&#8217;t blame them.</p>\n<p>There&#8217;s a time and a place for everything, and there&#8217;s a way of reaching out to someone that&#8217;s appropriate. If we talk to a guy, and actually talk to him, instead of spewing out a dumpster&#8217;s worth of problems in an emotional tirade that we can&#8217;t believe they didn&#8217;t catch on to or figure out because we made things SSOOOOO OBVIOUS, they&#8217;ll be far more receptive. I&#8217;ve learned that  it is in fact possible to be the tomboy I am at heart as well as a girl, while being emotional, upset, or in need of comfort. And it&#8217;s possible to do it with out alienating a guy if you go about it the right way. And that&#8217;s what I&#8217;ve tried doing for the last couple of years. Am I perfect? Absolutely not. I still need to take my own advice. I messed up recently and am still kicking myself.  But that&#8217;s something we all deal with because when you care about the people in your life, you&#8217;re always going to wish things could have been done differently.</p>\n<p>So, are girls still bat-sh*t crazy? Absolutely, this was only the tip of the iceberg regarding relationships. But we can be happier more confident bat sh*t crazy girls if we just take a step back and remember that no one can read our minds and that we&#8217;re only human. Unfortunately, we are still going to have those ugly moments when we lash out and don&#8217;t think before we speak. And those moments suck. But what matters is figuring out why we did it, how to handle it after, and how to take steps not to let that happen the next time.</p>\n<p>I now propose someone make &#8220;life-lesson post-its&#8221;</p>\n", "post_id": 36, "location": false, "date": "11-19-2012", "mentions": [], "extracted_features": {}}, {"tags": ["lessons", "funny", "life", "philosophy", "love", "positive", "self", "men", "motivation", "personal growth", "women", "hope", "inspiration"], "text": "<p><a href=\"http://1girl101thoughts.files.wordpress.com/2013/03/2012-12-26-ec98550.png\"><img class=\"aligncenter size-full wp-image-815\" alt=\"2012-12-26-ec98550\" src=\"https://1girl101thoughts.files.wordpress.com/2013/03/2012-12-26-ec98550.png?w=640&#038;h=564\" width=\"640\" height=\"564\" /></a></p>\n<p>It’s been a while… Happy New Year! Happy Valentine’s Day! Happy almost spring!</p>\n<p>I have always said that my main driving force in life is to be the best person I can be for myself and for others (shout out to Fordham’s Jesuit tradition right there). Since I’m only 24, I try to focus on being the best person I can be for myself, first, so I can better help others. There are a couple of ways I try to accomplish this.</p>\n<p>First, I try to learn from everything- good, bad, happy, sad, it doesn’t matter. Everything has a lesson you can learn about yourself, life, and others. Figuring out how and why things work fascinates me- I’m like a sponge. I enjoy figuring out how and why someone thinks the way they do, how and why people act the way they do. The number of times I unknowingly psychoanalyze people on a monthly basis makes it clear that I probably should have been a psych major.  If you ask the people closest to me, they’ll tell you that I’m extremely perceptive, and that I can tell within 1 minute if someone I’m with has something on their mind. This at times can be a blessing and a curse. It’s a blessing because I can usually help that person hit on what’s causing them concern and how to remedy it.  It’s a curse because it goes hand in hand with being super sensitive to things- emotional and otherwise. Being super sensitive to things is one of my flaws. Which leads me to the second, and presently the most important and effective, way I try to be the best person for myself:</p>\n<p>I acknowledge, accept, and <strong>own</strong> my flaws, and in turn acknowledge, accept, and own <strong>who I am. </strong>For a more eloquent and succinct blog post about this, head over to <a title=\"The Heartbeat Blog\" href=\"http://blog.heartbeat.com/2013/03/05/the-virtue-of-vulnerability/\" target=\"_blank\">The Virtue of Vulnerability | Heartbeat Blog</a>. written by someone I’ve had the pleasure of meeting and speaking with, and is the reason for this over-due post (thanks for being patient, you loyal 20 followers you). By accepting my flaws and owning them, I’m embracing my full self, which in turn lets me work on being the best person I can be.</p>\n<p>This all sounds like hippie talk, right? It is in a way, but as a result, I know the person I am, and I know the person I’m going to be. As stated in the above post from Heartbeat,  don’t try to be someone you’re not or base the person you want to be off of someone else, or who you think you “should be”. Being the best person and version of ourselves starts with just <strong>being</strong> ourselves. Owning who we are, flaws and all, and who we know we’re going to be. I’m not the most confident person you’ll meet, but when it comes to the person I am and the person I’m going to continue to be, I’m 100% confident.  I’m going to be the girl friend, wife, mother, friend, what have you, that never asks for anything but love and respect.  I’m already the type of person who never asks for anything, never complains, and supports herself and the people around her, and that will continue through out the different stages of my life- whether it’s supporting my friends, kids, husband, it doesn’t matter.</p>\n<p>By nature, I’m a supportive, motherly type figure. But I couldn’t be that person, and continue to grow into a better version of that person, unless I own my flaws and open myself up to being vulnerable. For a long time, I ran from my flaws- we all do! It’s natural. But when you run from your flaws, you’re halting your own personal growth. You make the same mistakes over and over. You’re doing yourself and others a disservice by closing yourself off to being vulnerable and reflective. Being vulnerable isn’t being weak. Running from your flaws isn’t being strong. Having flaws doesn’t mean you’re not capable of accomplishing what you want or being a better person. As stated in the article,</p>\n<p align=\"center\"><em>“Our willingness to be vulnerable conveys the greatest respect for ourselves and others. It is through that fullness of personality that we truly connect with another. Authenticity happens when we are unapologetic about who we are while being open and receptive at the same time. This allows us to see ourselves through the eyes of others and grow from that insight.”</em></p>\n<p>I’ve never felt more at peace with myself, and more confident in myself, than when I stared my flaws in the face and said “you suck. You’re a part of me, but I’m better than you, and I’m gonna teach myself to keep you at bay and I&#8217;m gonna surround myself with people who will call me out when you come to the surface.” I truly appreciate it when faced with an experience that brings my flaws to the surface- while it’s frustrating and sometimes embarrassing to look back and see how I acted, at the end of the day, I take it as a learning experience and know what to do next time. Same goes for the people in my life who call me out on my flaws- I appreciate you more than you know, you make me a better person.</p>\n<p>This is all obviously waaayyy easier said than done, and has taken me years of practice and reflection- and I&#8217;ve still got plenty to learn! It probably would have taken a shorter amount of time if I’d let other people in and talked things out, but, one of my other flaws is that I don’t let people in all that often. See! Another flaw.</p>\n<p>That being said, the hardest part is taking that plunge into being vulnerable. Opening yourself up to another person or just yourself in an honest, no judgement kind of way can be scary, but it&#8217;s 100% worthwhile at the end of the day. If you choose to do it alone like I did for so long, stay strong, it&#8217;s going to take a while. If I could go back in time I&#8217;d tell a younger version of myself to open up to someone, anyone, even a stranger, because asking for help is sometimes necessary. Take 5 minutes of complete honesty and just be open. If you choose to be vulnerable to someone, then the right person won&#8217;t judge you when they&#8217;re listening or calling you out on your flaws. They won&#8217;t sit there and try to fix things for you, because that&#8217;s not their responsibility.  The right person will give it to you straight, a little tough love action, but will support you and accept you while you work to become a better version of yourself. At least, those are the type of people I surround myself with, and that&#8217;s the type of person I try to be for others.</p>\n<p>We’re all a work in progress, but I firmly, truly, strongly believe that we all have within us the capacity to be the best version of ourselves. I believe that by nature humans are inherently good, and we shape ourselves by experiencing and reflecting (John Locke? Anyone? #PretentiousJesuitEducationMoment).</p>\n", "post_id": 805, "location": false, "date": "03-07-2013", "mentions": [], "extracted_features": {}}], "edges": [{"data": [41708382, 0, 41708382, 1182472, 42412422, 42057439], "type": "comment", "service": "wordpress"}, {"data": [15506136, 21138138, 34520506, 37943412, 41708382, 42057439, 42442879, 34520506, 40471114, 41708382, 15551898, 26531592, 31106034, 34520506, 34931742, 39916009, 41708382, 42595816, 42774329, 15499264, 25975438, 26531592, 27681762, 34520506, 34931742, 38380433, 41708382, 42595816, 1182472, 7359255, 21970412, 31106034, 40578652, 41708382, 46417749, 7359255, 10529084, 25975438, 27681762, 34520506, 34526985, 37357082, 37635390, 38313166, 40578652, 41708382, 281523, 31106034, 41708382, 42064920, 46417749, 1182472, 10529084, 15551898, 16523324, 20834823, 24058931, 26048408, 34520506, 34931742, 37943412, 39916009, 40578652, 42774329, 46417749, 1182472, 15551898, 22510978, 23356802, 33544430, 34520506, 38778107, 39916009, 41708382, 42965774, 46417749, 7359255, 9523778, 29536507, 31106034, 34520506, 41708382, 42057439, 42562524, 42595816, 42774329, 618743, 7359255, 12652077, 30264529, 35429659, 35889557, 36624455, 38892576, 41708382, 42462682, 43390560, 43504928, 46417749], "type": "like", "service": "wordpress"}], "metadata": {"services": [{"username": "1girl101thoughts", "display_name": "kpbouton", "service": "wordpress", "service_url": "https://wordpress.com/", "location": {"location_name": "New York, New York"}, "service_id": 42412422, "profile_url": "http://en.gravatar.com/kpbouton"}]}}