{"node_id": 44197930, "posts": [{"tags": ["Family", "skyla", "grave situation", "Science Fiction", "Book", "Adventure", "steel rod", "Tragedy"], "text": "<p>I had seen such a horrifying incident for the first time&#8230; As a bullet pierced through Harry&#8217;s chest when he was coming to rescue us. He was yelling with pain as he fell down. I could see him, trembling with pain&#8230;and slowly dying. I couldn&#8217;t believe my eyes, I was wet with tears&#8230;They had shot my brother  in-front of my eyes. I could see the pain in his body, but he was still trying to fight them&#8230;intending to save us. His body was covered, with blood, but he was brave&#8230; he slowly stood up, and he marched towards the aliens&#8230;hitting one, on the head with a steel rod. But those heartless aliens&#8230; they shot another bullet, which hit his neck and passed through it. He was dead. He fell down on the ground&#8230;blood was flowing out of his body.</p>\n<p>&#8220;Harry&#8230; No, You can&#8217;t die&#8221; I screamed, and was trying to break through the &#8216;<em>plasma-grills</em>&#8216; where we were held captive&#8230;and  wanted to rush towards him. Along with me, were my cousins Paul and Skyla. They were dumb-founded&#8230;and stood like statues, watching him tremble. We couldn&#8217;t do anything&#8230;we were behind the bars, held captive by the Aliens.</p>\n<p>I could not watch him tremble like this.. I was full of Anger, I wanted to kill all of them&#8230;leaving none, alive.</p>\n<p>&#8220;You, just leave me&#8230;them you&#8217;ll see&#8221; I said vigorously shaking  the bars angrily. &#8220;I will kill you all&#8230;&#8221;but that was not possible at the moment. I had no weapon, nothing. On the other hand, they had advanced weapons. I didn&#8217;t stand a chance, but I couldn&#8217;t just stand there and watch the commotion. I burst out in tears&#8230;I just couldn&#8217;t watch it. Skyla was still suffering a setback&#8230;and was watching the incident, horrified. Paul was angry, but he couldn&#8217;t do anything.</p>\n<p>They took away his body from there, along with all the soldiers, that were  killed in the War&#8230; and soon, one by one&#8230;all the soldiers were also gone, leaving only us&#8230;alone. I was still in tears, still unable to believe the incident. Skyla was crying&#8230;Paul was silent. We were in a grave situation. If we didn&#8217;t hurry, then the world would soon be captured by the Aliens and the people would be made their slaves. But, the situation here&#8230;we were still in a set-back. I was grief-stricken. I could not believe that, the same Harry..who was my best friend and brother, who always took my side&#8230;who helped me in every way he could, who was the most loving and caring brother, was no more.</p>\n<p>I was sitting on the floor&#8230;remembering how we used to have fun, and how we enjoyed, but now it was all over. I was still looking at him, hoping him, to wake up from his sleep&#8230;but he was gone, forever. I still couldn&#8217;t believe it. It all started that fateful day&#8230;&#8230;&#8230;&#8230;&#8230;&#8230;&#8230;&#8230;&#8230;&#8230;&#8230;&#8230;&#8230;&#8230;&#8230;&#8230;&#8230;&#8230;&#8230;&#8230;&#8230;&#8230;&#8230;&#8230;&#8230;</p>\n", "post_id": 20, "location": false, "date": "01-06-2013", "mentions": [], "extracted_features": {}}], "edges": [{"data": [25295264, 40675305, 23479307, 42675679, 44197930], "type": "comment", "service": "wordpress"}, {"data": [444936, 3453864, 8140212, 9365062, 13404287, 18598190, 19688558, 24427850, 25295264, 35795460, 35859462, 39560649, 39642460, 40908927, 42675679, 43033860, 44188033, 44197930], "type": "like", "service": "wordpress"}], "metadata": {"services": [{"username": "kamakhyadeori420", "display_name": "kamakhyadeori420", "service": "wordpress", "service_url": "https://wordpress.com/", "location": false, "service_id": 44197930, "profile_url": "http://en.gravatar.com/kamakhyadeori420"}]}}