{"node_id": 45291087, "posts": [{"tags": ["#WordPlay #romanticcomedy #satire #publishingindustry #amaliesilver"], "text": "<p><a href=\"https://www.goodreads.com/book/show/20700340-word-play\"><img src=\"https://amaliesilver.files.wordpress.com/2014/05/monica-musings-header2-copy.jpg\" class=\"size-full\" alt=\"Word Play Ecxerpt 1 - Monica Musings Interview with The Persnickety Reader\" /></a></p>\n<p>Monica’s Musings<br />\nBlog post #314</p>\n<p>Throughout the past few years, I’ve interviewed several different people within our industry. Bloggers, authors, editors, readers, and more. I’ve handpicked these gems to share with you. I hope you find them as amusing as I did.</p>\n<p>Interview One: The Persnickety Reader<br />\nInterviewer: Monica Singer<br />\nInterviewee: Angelica P. from Atlanta, GA</p>\n<p>To: Monica Singer<br />\nFrom: angelicap@gmail.com<br />\nSubject: RE: Interview</p>\n<p>Q1: What are your favorite books to read?<br />\nRomance </p>\n<p>Q2: Any particular books you won’t read?<br />\nI won’t read books that have:<br />\ncliffhangers<br />\nUnprotected sex<br />\nDrug use<br />\nparanormal<br />\nangst<br />\nsex in public places<br />\nBDSM<br />\nCharacters that have allergies to medications<br />\nBooks that are shorter than 325 pages<br />\nBooks with anyone named Ryan, Max, or Charlie<br />\nRough sex<br />\nBooks about firemen<br />\nBooks that give a thorough description of the scrotum sac<br />\nBooks based on true stories<br />\nBooks with too much lovey-dovey stuff in them<br />\nBooks were someone dies<br />\nBooks that have sports in them<br />\nBooks written in third person<br />\nBooks written more than three years ago<br />\nBooks that talk about diseases<br />\nPenises described as velvety steel<br />\nAny books with old people<br />\nBooks that talk about poop, pee, or describe any bodily fluid that expels.<br />\nBooks that use excessive expletives (like, the F word)<br />\nNo shy or socially awkward people<br />\nNo redheads<br />\nNo college students<br />\nOh, and cheating. I won’t read about cheating.</p>\n<p>Q3: Do you every find it difficult to find books you enjoy reading?<br />\nNo. Not really.</p>\n", "post_id": 13, "location": false, "date": "05-24-2014", "mentions": [], "extracted_features": {}}, {"tags": ["#amaliesilver #wordplay #romanticcomedy #satire"], "text": "<p>I’m a visual guy. I won’t deny it. If you gave me the choice between a video and a piece of erotica, I’d choose the video every time. I wouldn’t care if the fiction was a literary fucking masterpiece, there’s just something about seeing two plump lips wrapped around a cock—taking one for the team—that’ll win that prize every time. I almost wanted to give the girl a hug.</p>\n<p>It didn’t take long until I was begging for release. In fact, I’d say this girl had done this once or twice before. She stood and pulled a condom from her purse, ripping it open in haste. Slipping it onto me, she discarded the foil on the floor. I yanked up her skirt and pressed my fingers inside of her, ensuring she was ready.</p>\n<p>I’d seen this done in the movies—I’m pretty sure Armond did it in book two, as well—and even though this woman couldn’t have weighed much more than a hundred and twenty pounds, this was a hell of a lot harder than I thought it’d be. I pulled her up onto me, fumbling and crashing against the wall. Three minutes passed before my arms started burning at the attempt to keep her in place. By that point, I was so far gone that I just wanted this whole thing to be done with. It was sexy, but it was exhausting.</p>\n<p>I pumped into her, keeping one hand gripping her knee and the other against the wall behind her shoulder. She yelped in pain—in pleasure—over and over, crying the name <em>Christoph.</em></p>\n<p><em>       </em>“Fuck,” I muttered, feeling the orgasm build. That was another thing I’d have to reconsider when writing sex scenes: Having an orgasm while standing? Not. Fucking. Easy. I was so focused on keeping her upright, keeping my dick from slipping out, making sure that if anyone walked in the door that I was being quiet enough, all the while still thrusting, still breathing, still trying to keep my facial expression somewhat attractive as I hit the peak, that I wasn’t really concentrating on blowing my load. And dammit, my arms were about to burst into fucking flames.</p>\n<p>“Sí, sí Armond,” she whispered.</p>\n<p>And that’s all it took. I didn’t have to come up with the perfect character response. And I didn’t have to plan the dialogue, timeline, or worry about the flow of my narrative. The world that Christoph Strong lived in wasn’t something <em>I’d</em> created—it was real—and it surrounded me at that very moment.</p>\n<p>I snapped. I stopped thinking about the pain; I stopped worrying about whether or not someone would walk in. I was no longer concerned with whether or not I’d say the right thing or be the right person. I stopped thinking about writing the character, and <em>became</em> him.</p>\n<p>I nipped ferociously at her bottom lip, grating my teeth against it as she cried out again. A sneer spread across on my face as I grabbed the backs of her thighs, slapping them against the tile. The velvety skin of her thighs displayed before me, like the in-flight wings of a monarch as I pinned the beautiful creature against the wall.</p>\n", "post_id": 28, "location": false, "date": "06-27-2014", "mentions": [], "extracted_features": {}}, {"tags": [], "text": "<p><a href=\"https://amaliesilver.files.wordpress.com/2014/08/bigballs-copy.jpg\"><img class=\"aligncenter size-medium wp-image-42\" src=\"https://amaliesilver.files.wordpress.com/2014/08/bigballs-copy.jpg?w=187&#038;h=300\" alt=\"BIGBALLS copy\" width=\"187\" height=\"300\" /></a></p>\n<p style=\"text-align:center;\">Big Balls<br />\n© Amalie Silver 2014<br />\nNighttides anthology</p>\n<p><strong><em>Prologue</em></strong></p>\n<p>The first thing you need to know about the Beavers is that we’re not quitters.</p>\n<p>We live the game.<br />\nWe breathe the game.<br />\nWe own it.</p>\n<p>Win or lose, it brings a spontaneous rush of adrenaline. A reflex. Something our bodies were designed to do.</p>\n<p>Fast-pitch softball was our way of life. And we aimed to perfect our game.</p>\n<p>I’d spent three seasons with these ladies, and none of us would ever turn our backs on each other.</p>\n<p>Ever.</p>\n<p><strong><em>Chapter 1</em></strong></p>\n<p><strong>April 14<br />\nGame 24<br />\n79 degrees Fahrenheit</strong><br />\n“Everybody in!” I called, taking off my catcher’s mask.<br />\nOne by one the ladies jogged toward me, ceasing their warm-ups and stretches. Ponytails flopped loosely behind red caps, cleats crunched over the gravel, and gloves were taken off and tucked into armpits.<br />\n“All right. ladies. The game starts in five minutes. Up until last week, we were undefeated. So there are a couple of things I don’t want repeated.” I panned the field, looking for any stray red uniforms.<br />\n“Kelly, get your ass over here! And fix your pants.” She walked over, and I lowered my voice to a rumble. “Your camel toe is so obvious I feel like I should lead you to water.”<br />\nThe ladies snickered.<br />\n“Okay, like I was saying… We made some obvious mistakes last game. So Lilah,” I looked to my left, letting my chin drop and my brow rise, “if I catch you checking your manicure during a game when your eye should be on the ball, I’m going to rip every one of those things off your fingers with a needlenose. Understood?”<br />\nShe shamefully nodded.<br />\n“Good. Jessy.” My eyes shifted to the blonde standing at Lilah’s side. “I understand that we all have our personal problems. But you are to never again bring a breakup onto the field. Leave that shit at home.”<br />\n“Sorry, Jacky,” Jessy said, twisting her hair and looking down toward the grass.<br />\n“If you’re going to date during the season, that’s up to you. Just don’t let it affect the team,” I said with a tight nod.<br />\n“And Becky,” I added, finding her at my side. “Get a sports bra. This isn’t a striptease.”<br />\nShe went to defend herself, but I put up my hand. “I don’t want to get into another discussion about the poor craftsmanship of our uniform’s buttons.”<br />\nBecky chewed the inside of her cheek and dropped her shoulders in defeat.<br />\n“Tonight is a doubleheader,” I continued. “Back to back, same team. We gotta show them who’s boss right out of the gates. Remember,” I pointed to my head, “this game is ninety percent psychological and twenty percent skill. I want to see everyone’s one-hundred-and-ten out there tonight.”<br />\nThey all swiftly nodded.<br />\n“Good. Hands in!”<br />\nWe piled our hands over each others’. “On three. Ready?”<br />\nIn unison, we shouted, “One. Two. Three. Beavers!”<br />\nHome team had its advantages. Being first in the field meant we’d close the game batting. Which would be necessary if we were behind by the ninth inning, but I had no intentions of letting it get to that point.<br />\nThat evening we were playing the Cougars.<br />\nThey were tough.<br />\nBut we were tougher.<br />\nWe’d played them in the Division Championship last year, and we handed them their asses. We took the College World Series, too. But a lot of our seniors graduated last season, and a slew of freshmen and sophomores were added to our starting team. And although we had a strong team, we’d still need a lot of work if we stood a chance at winning it all again this year.<br />\nNow, more than ever, it was vital that we stay focused and committed.<br />\nOur coach’s name is Marny. She chews tobacco, wears cologne, and walks like she has a pair of testicles. She’s not much of a talker and only pulls one of us aside if she notices a flaw in our technique. Otherwise she usually sits quietly keeping score on the bench.<br />\nThe team took their positions on the field. I was catcher. Izzy stood on the pitching mound, while Jessy jogged over to first base. Wanda stopped on her way to second base to pull up her sock, and Lilah was in the infield at shortstop tightening the knots on her shoes. Becky sat at third, smoothed the wrinkles from her uniform, and winked at a group of guys in the bleachers.<br />\nBut even with the hustle onto the field and the sounds of nearby traffic, birds chirping, children laughing, and the pings of aluminum bats at surrounding fields, I knew that as soon as the umpire walked onto the gravel, the girls could morph into fast-pitch softball killing machines.<br />\nFierce.<br />\nDetermined.<br />\nGreedy.<br />\nFocused.<br />\nOnce the outfielders got into position, I surveyed the team. The umpire walked from behind the backstop and I watched as each lady put on her game face. The heat of the evening was still bearing down, but I could feel a slight lift to the humidity as the sun began to set.<br />\nThe Cougars were dressed in their bright orange uniforms, and each one stood behind the backstop rooting for their first up to bat. Cleats were perched between the fencing, and fingers gripped the wire. They all chewed big wads of bubble gum and gave us the stink eye. Those girls looked a lot tougher than they were.<br />\nI squatted behind the plate and nodded to Izzy. Her eyes flickered toward the umpire and waited for his words.<br />\n“Play ball!” he shouted.<br />\nMy insides flipped as I wiped the sweat from my brow just before sliding on my mask. I took one last look at the ladies, ensuring they were all in position.<br />\nEach one of them crouched; their eyes remained glued to the batter walking into the infield.<br />\nKayla was the first up to bat on the opposing team. Not that I didn’t already know who she was, the position she played, and her batting average, but her teammates were behind me calling her name.<br />\nI took a deep breath and signaled the pitch. Izzy nodded and stood straight, keeping the ball and glove close to her chest.<br />\nWith a whip-like arm, she pulled it swiftly in a circular motion and took one step toward me, releasing the ball. But before I could feel it hit my glove, I heard the plinking echo of the ball making contact with the bat.<br />\nKayla had hit a line drive straight to Lilah at shortstop.</p>\n<p>Unfortunately for Lilah, she didn’t move her glove fast enough.<br />\nI heard the crunch of her kneecap from behind home plate just before I watched her fall to the ground.<br />\n“Holy fuck!” I yelled, running toward her and flipping off my mask. Lilah lay in the dirt, gripping her knee with both hands, as the ball rolled off into foul territory. She screamed, and then choked on her own vomit.<br />\n“Call the fucking paramedics!” I shouted and looked around at the stunned crowd surrounding the field.<br />\nWhen no one moved, I screamed even louder, “Now!”</p>\n<p><em>To read the rest of this novella, along with nine other sexy summer stories, visit the links below.</em></p>\n<p><span class=\"text_exposed_show\">US Amazon: <a href=\"http://l.facebook.com/l.php?u=http%3A%2F%2Fwww.amazon.com%2Fdp%2FB00MF4IEM0%2F&amp;h=JAQGBIaR-&amp;s=1\" target=\"_blank\" rel=\"nofollow nofollow\">http://www.amazon.com/dp/B00MF4IEM0/</a><br />\nUK Amazon: <a href=\"http://www.amazon.com/Nighttides-Lisa-Suzanne-ebook/dp/B00MF4IEM0/ref=sr_1_2?s=books&amp;ie=UTF8&amp;qid=1407225589&amp;sr=1-2&amp;keywords=nighttides\" target=\"_blank\" rel=\"nofollow nofollow\">http://www.amazon.com/Nighttides-Lisa-Suzanne-ebook/dp/B00MF4IEM0/ref=sr_1_2?s=books&amp;ie=UTF8&amp;qid=1407225589&amp;sr=1-2&amp;keywords=nighttides</a><br />\nBN: <a href=\"http://www.barnesandnoble.com/w/nighttides-lisa-suzanne-m-c-cerny/1120055655?ean=2940149651085\" target=\"_blank\" rel=\"nofollow nofollow\">http://www.barnesandnoble.com/w/nighttides-lisa-suzanne-m-c-cerny/1120055655?ean=2940149651085</a><br />\nKOBO: <a href=\"http://l.facebook.com/l.php?u=http%3A%2F%2Fstore.kobobooks.com%2Fen-US%2Febook%2Fnighttides&amp;h=RAQFGxy3k&amp;s=1\" target=\"_blank\" rel=\"nofollow nofollow\">http://store.kobobooks.com/en-US/ebook/nighttides</a></span></p>\n", "post_id": 43, "location": false, "date": "08-30-2014", "mentions": [], "extracted_features": {}}, {"tags": ["#amaliesilver #hotforteacher #anthology #novella"], "text": "<p><a href=\"https://amaliesilver.files.wordpress.com/2014/10/debating-number-10-final.jpg\"><img class=\"alignnone size-medium wp-image-56\" src=\"https://amaliesilver.files.wordpress.com/2014/10/debating-number-10-final.jpg?w=187&#038;h=300\" alt=\"debating number 10 final\" width=\"187\" height=\"300\" /></a></p>\n<p><strong>Debating Number Ten</strong><br />\n<strong> © Amalie Silver</strong><br />\nHot for Teacher Anthology</p>\n<p><strong>Chapter One</strong><br />\nPresent Day</p>\n<p>Red toenails.<br />\nHigh arches.<br />\nThin ankles.<br />\nBlack stockings.<br />\nI had never wanted a woman more than I wanted Katie Shields—or ‘Miss Shields,’ as I had been forced to always call her.<br />\nUntil this moment.<br />\nMy eyes wander higher to her calves, knees, and thighs as she sits on a white Chippendale chair at her vanity. I can almost taste her desperation from across the room as she stares me down with her hungry eyes.<br />\nWe’ve both waited for this moment for too long.<br />\nAs she stands, she wastes no time in removing her clothes, and my dick twitches as I continue to watch from my place on the bed. She’s putting on this show for me: each movement thought out, a slow torture.<br />\nAfter her clothes come off she stands in front of me with one finger in her mouth, looking down innocently at the bra and panties that remain. But if my prediction is correct, she’ll leave them on for a while to taunt my imagination.<br />\nHer hand trails from her mouth to her cleavage, and her fingers brush between her perfect tits. My eyes sweep across her flat stomach and down to her black panties, where her thighs rub together in anticipation.<br />\n“Touch me, Simon,” she pleads.<br />\nMy eyes remain hooded as I rise from the bed. I take my time strolling toward her, staying in control the entire time, reassuring her that I’m in command of this. The air leaves her chest, defining her ribs, making her breasts peak and her stance straighten.<br />\nThere’s a slight apprehension in her eyes, an excited fear of the unexpected. It’s a suspense that tickles both of our insides. And the smallest sound, taste, smell, or touch makes our skin feel like it’s on sensory overload.<br />\nI reach my hand out to tuck a dark tendril of hair behind her ear, and her eyes flutter shut at my touch. I grip her chin and jerk her eyes to mine.<br />\n“Shame on you for making me wait so long.” My firm hold keeps her head still, and I wait until her eyes grow lazy in submission before I appraise her body. Her skin is tan and supple, her lips red and plump. And her nipples poke through the satin of her bra.<br />\nI motion with a flick of my chin toward the bed. “Lie down.”<br />\nShe nods timidly and crawls on top of the sheets.<br />\n“Stay there. Just like that.” Her ass is straight up in the air and her thighs are spread slightly as she waits for me.<br />\nShe’s so beautiful. Everything about her is perfection. She’s my ideal woman in every way: from the small divot in her chin to her long black silky hair. To think I’ve come as far as I have since the first day I laid eyes on her makes my chest expand with pride. But I need to take this slow—slower than my greedy hands and dick have planned.<br />\nTo think about a woman for so long, so hard, and with such intensity; I’ve played this moment over in my head thousands of times. Now that I’m finally here, I need to savor her so that she’s guaranteed to return for more. I can’t blow this.<br />\nI strip down, removing my shirt, pants, and boxers, and crawl onto the bed. She’s still lying submissively, her lips parted, her arms above her, and her eyes on me. My fingers dip underneath the thread of her panties, and her back arches as she exhales. With one yank I have the silk down to her knees, and her bare ass is in view. My eyes close and I sit back on my heels, privately thanking any god who can hear me. Miss Shields must hear me make a sound, because she giggles, and my eyes open.<br />\n“Turn over, Katie.”<br />\nShe quickly follows my orders and lies on her back. I remove her panties slowly until she has nothing on but her bra. “Take it off,” I demand.<br />\nReaching behind, she unclasps her bra, letting the material hover over her chest as a tease, and I know she’s enjoying every second of this.<br />\n“I’ve wanted you for so long, Simon.” Her words sing to me and echo in my ears.<br />\n“I know, baby.” I snatch her bra away and throw it to the floor. For a moment she looks shy, covering herself with her forearms. I ease myself on top of her and pin her arms to her sides, just before taking her dark nipple into my mouth.<br />\nI can’t seem to slow myself; I’m too needy for her. I want all of her at once: her skin, her hair, her tits, her pussy, and that beautiful ass—everything she’ll give me. Even though I know she’s a woman I should take my time with, I feel ravenous and Katie Shields is my only satisfaction. I open her thighs wide, and dip down to taste her. Shuddering, I delight in her exquisite flavor.<br />\nHer body is immaculate, tender, and ripe for me as I dip my tongue inside her. She’s drenched, and I feel another stab of pride knowing that I was the one to get her there. I hum a vibration against her, and she rewards me by whispering my name.<br />\nHer hips begin to move against me and her fingers find my hair. She pulls gently, rocking against my face and uttering small, sweet groans. A smile spreads across my face as I stop and look up at her.<br />\nGliding her hands down to her nipples, she tweaks and twists them, and I think briefly about asking her to pleasure herself for me. But I realize there’s no way I’d allow it; I want to be buried deep inside of her.<br />\nI slam my body forward, keeping her knees at my shoulders. Her body shifts quickly with mine and she grunts unexpectedly, causing my smile to turn wicked. I can feel her pussy at the tip of my cock, begging for me to intrude her, but instead I tease her with it.<br />\nHer lips stay parted in surprise, and I take my opportunity to indulge in a kiss. I keep a firm hold of her thighs at my shoulders while I take her mouth onto mine.<br />\nIt’s frenzied and eager, and I make no apologies for it. My mouth is wet, and tastes like my Katie. This seems to make her appetite shift into overdrive, and she’s just as impatient when she kisses me back.<br />\nWithout notice I thrust myself inside of her, and the sensation shocks her. She holds her breath and throws her head back.<br />\nShe’s tighter than I thought she’d be—or perhaps she’s waited all these years for only me.<br />\nI ease out of her slowly and back in again. Jesus, she’s wet. I take my mouth away from hers and watch her face contort in pained gratification. Her eyes are squinted and she’s lets out a breath. Black hair cascades on the pillow, and she catches her bottom lip between her teeth. I move my hips slowly at first, and she moans with pleasure.<br />\nI pick up the pace, grinding myself in deeper—harder—and I know there’s no way either of us will last long. Our bodies are too damn perfect for one another’s for more than five minutes of this. So I close my eyes and soak in every moment I can.<br />\n“Simon,” she whispers.<br />\nMy pace is vigorous, and I barely hear her. My tongue is circling her areola, and when I hear the echo of her voice, my thrust quickens even more as I trap her small nipple between my teeth, feeling it pucker.<br />\nI’m so damn close—within seconds of coming. I feel the orgasm build as waves of euphoria encompass me.<br />\n“Simon?”<br />\n“Holy shit,” I sputter, unable to tame it any longer. She grips my hair harder, my thrusts become fiercer, and I lose any semblance of control as I pound into her, reveling as the last of the orgasm rips through. I grind my body against hers and I come quietly, yet crudely.</p>\n<p>“Simon? You in there?” I hear the voice again along with a knock at my door. My heart races wildly as I open my eyes up and reach for the towel on the floor.<br />\n“Yeah, Ma. I’m here. I’m…resting,” I manage to choke out, feeling hot and flustered.<br />\n“Okay, I’ll leave you alone. We just got home and we’re going to go to bed,” Mom says quietly through the door.<br />\nI swallow. “Okay. Goodnight.” I clean myself off and throw the towel on my nightstand, knocking over the bottle of lotion, which makes me roll my eyes.<br />\nAfter putting my boxers back on, I climb into my empty bed and close my laptop, still feeling frustrated.<br />\nI don’t know how much longer this fantasy of my teacher will suffice. I want her so desperately sometimes that I wonder if my dick will explode if I don’t feel her wrapped around it soon.<br />\nI turn on to my side and close my eyes, thinking of her gorgeous face when I’ll see her at debate next week.</p>\n<p><strong>CONTINUE READING: </strong><a href=\"http://www.amazon.com/dp/B00OYUMKD2/\" rel=\"nofollow\">http://www.amazon.com/dp/B00OYUMKD2/</a><strong><br />\n</strong></p>\n<p><strong>SEE MORE SNIPPETS FROM OTHER STORIES IN THE HOT FOR TEACHER ANTHOLOGY HERE:</strong> <a href=\"http://www.wickedwomenbooksandmore.com/hot-for-teacher-anthology/\">Hot For Teacher Anthology!</a>. ( &lt;&#8212;click on the link!)</p>\n", "post_id": 52, "location": false, "date": "10-29-2014", "mentions": [], "extracted_features": {}}, {"tags": ["#worplay #amaliesilver #romanticerotica #erotica #satire #romanticcomedy #ebook #fiction #publishingindustry #book"], "text": "<p><a href=\"https://www.goodreads.com/book/show/20700340-word-play\"><img src=\"https://amaliesilver.files.wordpress.com/2014/05/wordplay-ebook-cover-only1.jpg\" class=\"size-full\" alt=\"Word Play\" /></a></p>\n<p>Smut sells.</p>\n<p>Michael Rourke learned this the hard way.</p>\n<p>Struggling to make ends meet as a mystery writer, he sold his soul &#8211; and his pride &#8211; as he pedaled sex and lust writing under the pen name Christoph Strong.</p>\n<p>No one knew he was the one behind the steamy stories on the bestsellers lists. And he planned to keep it that way.</p>\n<p>Until he met her.</p>\n<p>Monica Singer, an infamous blogger, is keen to discover the truth of his secret identity.</p>\n<p>During a chance meeting at a book convention, Michael and Monica form an instant connection. And soon, an innocent online friendship becomes something so much more.</p>\n<p>But as Michael starts to let his guard down, he doesn’t realize that the person he&#8217;s learning to trust may be hiding secrets of her own.</p>\n<p>Secrets that could ultimately destroy everything.</p>\n<p>**Expected release date: Summer of 2014<br />\n***Word Play is a romantic satire about the publishing industry</p>\n", "post_id": 6, "location": false, "date": "05-12-2014", "mentions": [], "extracted_features": {}}], "edges": [{"data": [], "type": "comment", "service": "wordpress"}, {"data": [45069497, 45205830, 50449880], "type": "like", "service": "wordpress"}], "metadata": {"services": [{"username": "Amalie Silver", "display_name": "amyjq", "service": "wordpress", "service_url": "https://wordpress.com/", "location": {"location_name": "Minnesota"}, "service_id": 45291087, "profile_url": "http://en.gravatar.com/amyjq"}]}}