{"node_id": 52393591, "posts": [{"tags": ["family", "toddler", "stroller outing", "eastern market", "detroit"], "text": "<p>Moms, babies and toddlers love to get out and enjoy the sunshine. Eastern Market is the perfect place to do it, especially for the new Tuesday market. The Tuesday market is like the &#8220;best of&#8221; from the massive Saturday market, from my &#8220;mommy&#8221; perspective. I <em>looove</em> Saturdays at Eastern market for the sheer volume and amazing vibe, but I can barely weave my way through the crowd myself, let alone with a stroller! </p>\n<p>You <em>might</em> not grab a Bloody Mary at Viviano&#8217;s with little ones in tow, but you&#8217;ll have your choice of locally sourced grass fed beef burgers with homemade buns at Ned&#8217;s food truck (totally cool converted airstream) with their farm fresh <em>accouterment</em>. Of course what kid doesn&#8217;t love macaroni and cheese?!? The Mac Shack has the most decadent options I&#8217;ve ever seen on this comfort food classic, a must-try.    </p>\n<p>Tuesdays market has all of my favorites. Coffee from the caboose cart, fresh leafy greens from Vang&#8217;s, made-that-morning bread and bouquets of gorgeous flowers to brighten any day.<br />\nWe tasted artisanal cheese, strawberry rhubarb jam, kale chips, pickles and even had a go on the xylophone! <em>You can&#8217;t get THAT at the zoo! </em><br />\n<img src=\"https://adventuresofadetroitfamily.files.wordpress.com/2013/08/20130801-002812.jpg\" alt=\"20130801-002812.jpg\" class=\"alignnone size-full\" /></a><br />\nIf the little ones may ask for a cool treat on a sunny day, don&#8217;t deny them (or you). It doesn&#8217;t have to be a market day for you to enjoy Michigan&#8217;s own Hudsonville ice cream from Mootown Ice Cream shoppe. Try a double decker sundae, smoothie or even quesadillas! </p>\n<p><a href=\"http://adventuresofadetroitfamily.files.wordpress.com/2013/08/20130801-014203.jpg\"><img src=\"https://adventuresofadetroitfamily.files.wordpress.com/2013/08/20130801-014203.jpg\" alt=\"20130801-014203.jpg\" class=\"alignnone size-full\" /></a><br />Grandma holding B while he tried his hand as a street performer.</p>\n<p><a href=\"http://adventuresofadetroitfamily.files.wordpress.com/2013/08/20130801-015300.jpg\"><img src=\"https://adventuresofadetroitfamily.files.wordpress.com/2013/08/20130801-015300.jpg\" alt=\"20130801-015300.jpg\" class=\"alignnone size-full\" /></a></p>\n<p>Bathroom details: Bringing a potty training toddler anywhere can be daunting. &#8220;Potty Breaks&#8221; are frequent and it&#8217;s important to know where the good potty spots are. I chose the bathroom in DeVries (formerly R. Hirt Jr.) which lies between Shed 2 and Viviano&#8217;s. Head to the back wall of their delicious shop for a one person private toilet which your stroller might actually fit into. Otherwise, it&#8217;s rural rest stop accommodations in the public stalls next to the Welcome Center in Shed 3. </p>\n<p>Bonus: Shed 3 was open but not full of vendors like on a Saturday. It was an enclosed wide open safe space to let the toddlers run. There were some street performers from a Krav Maga  studio which were pretty interesting. There was even a business making an attempt at a &#8220;kid zone&#8221; offering a bean bag toss and face painting. I&#8217;ll be honest, I really didn&#8217;t go over to investigate because if B saw something he could throw he would&#8217;ve hurt someone or something. Plus, face painting gives me the heebeejeebee&#8217;s. </p>\n<p>Parking: At 10am on a Tuesday it was easier to find parking than on 7am Saturday. We got lucky with a spot directly in front of Viviano&#8217;s.</p>\n<p>By an hour and a half we had filled our market baskets and sampled our way through the entire market. A quick side trip to Whole Foods (literally around the corner on Mack Ave)  and it was a fun and filling morning.</p>\n<p>B returning our cart at Whole Foods.</p>\n<p><a href=\"http://adventuresofadetroitfamily.files.wordpress.com/2013/08/20130801-024841.jpg\"><img src=\"https://adventuresofadetroitfamily.files.wordpress.com/2013/08/20130801-024841.jpg\" alt=\"20130801-024841.jpg\" class=\"alignnone size-full\" /></a></p>\n<p>Me and B enjoying our tasty lunch, YUM!</p>\n<p><a href=\"http://adventuresofadetroitfamily.files.wordpress.com/2013/08/20130801-025223.jpg\"><img src=\"https://adventuresofadetroitfamily.files.wordpress.com/2013/08/20130801-025223.jpg\" alt=\"20130801-025223.jpg\" class=\"alignnone size-full\" /></a></p>\n", "post_id": 100, "location": false, "date": "08-01-2013", "mentions": [], "extracted_features": {}}, {"tags": ["green space", "botanical garden", "Heritage Park", "family concert series", "toddler outing"], "text": "<p>Filling a bucket with water, dumping it out, squishing mud and sorting pebbles, oh yeah, &#8220;these are a few of B&#8217;s faaavorite things&#8221;! B and I joined some of our mommy crew and set out to donate some time to enhance the beauty of Metro Detroit. The <a href=\"http:/taylorconservatory.org/\">http://taylorconservatory.org/</a> is nearly 100% volunteer based and offers a community garden, fairy garden and botanical garden. While we wanted the children to get hands on experience with growing plants and donating their time, we also were lucky to get a beautiful day of perfect weather and sunshine. </p>\n<p><a href=\"http://adventuresofadetroitfamily.files.wordpress.com/2013/08/20130805-015757.jpg\"><img src=\"https://adventuresofadetroitfamily.files.wordpress.com/2013/08/20130805-015757.jpg\" alt=\"20130805-015757.jpg\" class=\"alignnone size-full\" /></a></p>\n<p><a href=\"http://adventuresofadetroitfamily.files.wordpress.com/2013/08/20130805-015829.jpg\"><img src=\"https://adventuresofadetroitfamily.files.wordpress.com/2013/08/20130805-015829.jpg\" alt=\"20130805-015829.jpg\" class=\"alignnone size-full\" /></a></p>\n<p>Potty Deets:<br />\nThere is a clean baby friendly bathroom inside the building across the parking lot (about two ABC song verses away) that houses the Petting Farm entrance. We brought our froggy potty this day however. </p>\n<p>Food:<br />\nIt is completely BYO and there are so many picturesque spots to enjoy a meal or a snack, my vote goes to the wooden log benches by the by the slate floor pavilion. </p>\n<p>Cost:<br />\nFREE<br />\n*if you choose to check out the Petting Farm it&#8217;s $4/person 1 &amp; up. Cash only.</p>\n<p><em>But wait, there&#8217;s more</em>!<br />\nThere is a brand new playscape (built summer 2012) next to another pavilion with picnic tables that B and I have enjoyed when he was just one year old and still getting the hang of walking. I have also seen someone rent a bouncy house and have it installed right next to the play scape and host her daughters fifth birthday party under the pavilion. It looked AMAZING! </p>\n<p><strong>Where is your favorite green space to take your family on a perfect picnic weather day?</strong><em></em></p>\n", "post_id": 108, "location": false, "date": "08-05-2013", "mentions": [], "extracted_features": {}}, {"tags": ["story time", "indoor activity", "book club", "toddler", "preschool craft"], "text": "<p><a href=\"http://adventuresofadetroitfamily.files.wordpress.com/2013/08/20130807-064845.jpg\"><img src=\"https://adventuresofadetroitfamily.files.wordpress.com/2013/08/20130807-064845.jpg\" alt=\"20130807-064845.jpg\" class=\"alignnone size-full\" /></a><br />\nSchmutz the dog is our new favorite pet. He looks like our doggies, smells like our doggies, but lives in a book on the activity table. He&#8217;s inspired us to get bits and baubles from our craft trunk and create some of our own family portraits.</p>\n<p><a href=\"http://adventuresofadetroitfamily.files.wordpress.com/2013/08/20130807-065439.jpg\"><img src=\"https://adventuresofadetroitfamily.files.wordpress.com/2013/08/20130807-065439.jpg\" alt=\"20130807-065439.jpg\" class=\"alignnone size-full\" /></a></p>\n<p>Covering the table with our pirates booty of treasures we laid out the book for inspiration. Once we decided our base would be a paper plate we squirted glue where the necessary body  parts would be adhered and discussed the function of those parts (eyes for seeing, nose for smelling, mouth for tasting). B was deep in thought as I started using scissors to cut strips from some yarn and ribbon.</p>\n<p><a href=\"http://adventuresofadetroitfamily.files.wordpress.com/2013/08/20130807-070240.jpg\"><img src=\"https://adventuresofadetroitfamily.files.wordpress.com/2013/08/20130807-070240.jpg\" alt=\"20130807-070240.jpg\" class=\"alignnone size-full\" /></a></p>\n<p>Voila! Our masterpieces!! (Sort of) I am still working on mine. We had a great talk about body parts, senses and buttons. B used his fine motor and decision making skills. I would say we made the best of this gloomy day&#8230;</p>\n", "post_id": 113, "location": false, "date": "08-07-2013", "mentions": [], "extracted_features": {}}, {"tags": ["hard cider", "with or without kids", "wine tasting", "Date night"], "text": "<p><a href=\"http://adventuresofadetroitfamily.files.wordpress.com/2013/08/20130812-023354.jpg\"><img src=\"https://adventuresofadetroitfamily.files.wordpress.com/2013/08/20130812-023354.jpg\" alt=\"20130812-023354.jpg\" class=\"alignnone size-full\" /></a></p>\n<p>The Northville Cider Mill and Winery was a perfect spot for a Saturday night date with my hubby. We went for a tasting (yes, I bought a LivingSocial deal, I know, I&#8217;m addicted) and found a place we&#8217;d love to return to again with or without a toddler in tow. </p>\n<p><a href=\"http://adventuresofadetroitfamily.files.wordpress.com/2013/08/20130812-023745.jpg\"><img src=\"https://adventuresofadetroitfamily.files.wordpress.com/2013/08/20130812-023745.jpg\" alt=\"20130812-023745.jpg\" class=\"alignnone size-full\" /></a></p>\n<p>The outdoor space is absolutely charming with hand painted adirondack chairs and live music (check schedule). The menu states you can bring a picnic or order a pizza and get it delivered, love it! The atmosphere is artsy but not stuffy. VERY laid back staff are chatty, cynical and intuitive, as needed. </p>\n<p><a href=\"http://adventuresofadetroitfamily.files.wordpress.com/2013/08/20130812-024139.jpg\"><img src=\"https://adventuresofadetroitfamily.files.wordpress.com/2013/08/20130812-024139.jpg\" alt=\"20130812-024139.jpg\" class=\"alignnone size-full\" /></a><br />\nThe crowd was varied, which I love. 20&#8217;s- senior citizens were all mingling happily. Some were tasting, many were just enjoying a bottle of their fabulous hard cider or local red wine.  The whole place has a very &#8220;come as you are&#8221; attitude. Attire was everything from flip flops and t-shirts to polo&#8217;s and pressed khaki&#8217;s. The parking lot had everything from beach cruiser bicycles to muscle cars to range rovers. Truly, &#8220;come one, come all and enjoy&#8221; could be their motto. </p>\n<p><a href=\"http://adventuresofadetroitfamily.files.wordpress.com/2013/08/20130812-024722.jpg\"><img src=\"https://adventuresofadetroitfamily.files.wordpress.com/2013/08/20130812-024722.jpg\" alt=\"20130812-024722.jpg\" class=\"alignnone size-full\" /></a></p>\n<p>Although my husband and I were in and out before any real &#8220;standing room only&#8221; crowds converged, it was a bustling bistro. I overheard one group saying how they had been there the past weekend really late and it was like &#8220;tailgating at a polo match&#8221;. That brought some vivid imagery of Julia Roberts mixed with Prince William to my crazy mind, but it sounded fun at any rate! </p>\n<p>Deets:<br />\nLocation: 630 Baseline Rd., Northville, MI (one block south of Novi Rd. and 8 mile Rd. intersection on the residential block of Baseline)</p>\n<p>The party is Friday 6-10 pm &amp; Saturday 4-11pm only (<em>for now</em>) </p>\n<p>The bathroom: clean and family friendly</p>\n<p>The front patio/open green space: perfect for relaxing on a picnic blanket nibbling treats (or pizza delivery) and sipping locally sourced and bottled hard cider and wine.</p>\n<p>We brought home a bottle of Rockin&#8217; Hard Cock Cider (<em>yeah, the taste was great but the name, hysterical!</em>) to take to our out- of- state family the next time we visit. We need to represent Detroit and show them how we do it!! Ha!!\n<p><a href=\"http://thenorthvillewinery.com/\">http://thenorthvillewinery.com/</a></p>\n<p><em>Disclaimer: I was not in anyway compensated to write this review. I visited this establishment and I am simply offering my genuine opinions. </em></p>\n", "post_id": 119, "location": false, "date": "08-12-2013", "mentions": [], "extracted_features": {}}, {"tags": ["toddler", "Family day", "summer bucket list"], "text": "<p><a href=\"http://adventuresofadetroitfamily.files.wordpress.com/2013/08/20130813-055028.jpg\"><img src=\"https://adventuresofadetroitfamily.files.wordpress.com/2013/08/20130813-055028.jpg\" alt=\"20130813-055028.jpg\" class=\"alignnone size-full\" /></a></p>\n<p>Our first air show as a family was a hit! I hadn&#8217;t been to an air show in years and was happily surprised at how much they had to offer. Three generations of our family enjoyed a perfect weather day celebrating America. </p>\n<p>Amazing planes from the last century parked on the Tarmac for all to see and TOUCH! V<em>ery cool for B!</em> Then later, these same planes were started up <em>(hello gas and fumes!)</em> and flown through the sky with finesse. </p>\n<p>My favorite was a re-enactment camp depicting accommodations, weaponry and tactical gear from each of the major American wars from the last century complete with veterans in their official uniforms to tell their war stories. Another surprise was a WWII battle re-enactment with cannon fire and an ambush by the Germans. It seemed to be a HUGE hit for the young boys ages 7-9 years old (even more so than the bouncy house area)! </p>\n<p><a href=\"http://adventuresofadetroitfamily.files.wordpress.com/2013/08/20130813-060206.jpg\"><img src=\"https://adventuresofadetroitfamily.files.wordpress.com/2013/08/20130813-060206.jpg\" alt=\"20130813-060206.jpg\" class=\"alignnone size-full\" /></a></p>\n<p><a href=\"http://adventuresofadetroitfamily.files.wordpress.com/2013/08/20130813-060342.jpg\"><img src=\"https://adventuresofadetroitfamily.files.wordpress.com/2013/08/20130813-060342.jpg\" alt=\"20130813-060342.jpg\" class=\"alignnone size-full\" /></a></p>\n<p><a href=\"http://adventuresofadetroitfamily.files.wordpress.com/2013/08/20130813-060422.jpg\"><img src=\"https://adventuresofadetroitfamily.files.wordpress.com/2013/08/20130813-060422.jpg\" alt=\"20130813-060422.jpg\" class=\"alignnone size-full\" /></a></p>\n<p>We brought a picnic of fruit, trail mix and PB&amp;J sandwiches, a blanket, some folding chairs and enjoyed five hours of non-stop fun. B barely made it to the car before he fell asleep<br />\n(<em>Very unlike him!)</em> from the running around, sun and yes, bouncy houses. The Kid Zone was worth the trip in B&#8217;s opinion.</p>\n<p>The real action was in the skies however, the aerobatic planes were incredible. Just watching from my spot on the ground made my stomach turn, I could only imagine actually being up there! AMAZING!!</p>\n<p><a href=\"http://adventuresofadetroitfamily.files.wordpress.com/2013/08/20130813-061052.jpg\"><img src=\"https://adventuresofadetroitfamily.files.wordpress.com/2013/08/20130813-061052.jpg\" alt=\"20130813-061052.jpg\" class=\"alignnone size-full\" /></a></p>\n<p><a href=\"http://adventuresofadetroitfamily.files.wordpress.com/2013/08/20130813-061134.jpg\"><img src=\"https://adventuresofadetroitfamily.files.wordpress.com/2013/08/20130813-061134.jpg\" alt=\"20130813-061134.jpg\" class=\"alignnone size-full\" /></a></p>\n<p>Deets:<br />\nAdmission is FREE for kids 15 &amp; under. Adults $35 but I bought a Living Social deal for half off plus a deal on parking (usually $15). All told I spent $77 for four adults and one child to park and enjoy. I felt like I got MORE than my money&#8217;s worth! </p>\n<p>For additional fees you could take a ride in an actual plane or dine in air conditioned comfort in a special luxe tented gallery. We did spend $10 for an all day pass, versus $3 per jump, for B to jump in the bouncy houses, which, in my opinion was 100% worth it. There were also rock climbing, bungee swings, tennis and other kid-centered activities. I feel confident that any child or adult could find something to spark their interest here. The day was perfect enough, where even an indifferent teen could simply relax and soak up the sun while the family browsed around. There was certainly enough security, military and fire safety personnel present to put a parents mind at ease. </p>\n<p>Food: Check their website for any changes but this year (2013) you could bring in anything that did not require a cooler. No alcohol or barbecues of course <span class='wp-smiley wp-emoji wp-emoji-smile' title=':)'>:)</span></p>\n<p>No Smoking! They real reason was because the planes on the Tarmac were going in the air and were fully fueled up causing fumes that are extremely flammable. I just thought it was great to be at an outdoor event and not have to choke through clouds of smoke &#8211; blech!</p>\n<p>Bathroom: Port-a-poetry&#8217;s only for the general admission folks. There were running water portable sinks to wash hands at every cluster and they weren&#8217;t disgusting (as far a port-a-potty&#8217;s go) . B got to use his first urinal, because there was no way I was going to try to balance my toddler over an open hole of excrement. I was impressed at his skill! Of course he let daddy take him potty after that. </p>\n<p>Charitable: Proceeds from the event went to funding the Yankee Air Museum <a href=\"http://yankeeairmuseum.org/\">http://yankeeairmuseum.org/</a> and the bomber plant where the original &#8220;Rosie the Riveter&#8221; became a National hero. </p>\n<p><strong>Have you ever been to an air show? </strong><em></em></p>\n", "post_id": 127, "location": false, "date": "08-13-2013", "mentions": [], "extracted_features": {}}, {"tags": ["at home", "craft", "toddler", "dollar store"], "text": "<p>We are attempting to do <del>no</del> reduced screen time and we found such a quick, easy, cute craft for these gloomy days at the Dollar store! Everything was included for $1.00. The paintbrush, paints and the light catcher. </p>\n<p><a href=\"http://adventuresofadetroitfamily.files.wordpress.com/2013/08/20130816-022737.jpg\"><img src=\"https://adventuresofadetroitfamily.files.wordpress.com/2013/08/20130816-022737.jpg\" alt=\"20130816-022737.jpg\" class=\"alignnone size-full\" /></a></p>\n<p>We popped open our learning tower, tossed on our apron, laid down a drop cloth/towel and set to creating. </p>\n<p><a href=\"http://adventuresofadetroitfamily.files.wordpress.com/2013/08/20130816-022931.jpg\"><img src=\"https://adventuresofadetroitfamily.files.wordpress.com/2013/08/20130816-022931.jpg\" alt=\"20130816-022931.jpg\" class=\"alignnone size-full\" /></a></p>\n<p>B loved getting messy!</p>\n<p><a href=\"http://adventuresofadetroitfamily.files.wordpress.com/2013/08/20130816-023020.jpg\"><img src=\"https://adventuresofadetroitfamily.files.wordpress.com/2013/08/20130816-023020.jpg\" alt=\"20130816-023020.jpg\" class=\"alignnone size-full\" /></a></p>\n<p>Amazingly, we finished our craft and the sun came out!</p>\n<p><em><br />\nWhat are you doing with your little ones as you strive to reduce screen time?</em><strong></strong></p>\n", "post_id": 132, "location": false, "date": "08-16-2013", "mentions": [], "extracted_features": {}}, {"tags": ["family", "Dichotomy", "Detroit river", "river walk", "detroit", "pessimist", "bikes", "carousel", "optimist"], "text": "<p>Detroit is two-faced! <em>Or is it us that is two- faced toward her? </em>I suppose your opinion would be based on your most recent experience. </p>\n<p>You may be in <em>love</em> with the D today because your summer taxes are paid, the weather is perfect and you just had a fantastic lunch outdoors at your favorite local spot. Whereas, tomorrow you <em>hate</em> her because you ran over a broken bottle, got a flat tire AND a parking ticket (as a result of not moving your disabled vehicle) and the Tigers lost to the frighin Royals, <em>ugh</em>!! </p>\n<p><em>Are you an optimist or a pessimist? Is the glass half full or half empty? </em></p>\n<p>I chose to love the city on Sunday. I chose to be an optimist. Even though my dear hubby was stuck at work, I took a picnic lunch to him for his break and then took B to the River Walk to burn off some of his boundless toddler energy. I parked near my old building (free parking on Sundays) and walked through the Renaissance Center (because who doesn&#8217;t like a good puzzle on a Sunday) to the gleaming blue waters of the Detroit River.</p>\n<p><em>Free Parking</em> </p>\n<p><a href=\"http://adventuresofadetroitfamily.files.wordpress.com/2013/08/20130820-012703.jpg\"><img src=\"https://adventuresofadetroitfamily.files.wordpress.com/2013/08/20130820-012703.jpg\" alt=\"20130820-012703.jpg\" class=\"alignnone size-full\" /></a></p>\n<p><em>Gerbil Tubes Shooting off the RenCen</em></p>\n<p><a href=\"http://adventuresofadetroitfamily.files.wordpress.com/2013/08/20130820-013015.jpg\"><img src=\"https://adventuresofadetroitfamily.files.wordpress.com/2013/08/20130820-013015.jpg\" alt=\"20130820-013015.jpg\" class=\"alignnone size-full\" /></a></p>\n<p><em>Enjoying the sunshine and watching the boats.</em></p>\n<p><a href=\"http://adventuresofadetroitfamily.files.wordpress.com/2013/08/20130820-013446.jpg\"><img src=\"https://adventuresofadetroitfamily.files.wordpress.com/2013/08/20130820-013446.jpg\" alt=\"20130820-013446.jpg\" class=\"alignnone size-full\" /></a></p>\n<p><em>We sauntered down the River Walk past all of the pooches on the pet walk, the joggers and even one brave woman on rollerblades speedily pushing a stroller (woah!) to Wheelhouse Detroit where you can rent any bike complete with gear, <strong>totally awesome!</strong></em></p>\n<p><a href=\"http://adventuresofadetroitfamily.files.wordpress.com/2013/08/20130820-013631.jpg\"><img src=\"https://adventuresofadetroitfamily.files.wordpress.com/2013/08/20130820-013631.jpg\" alt=\"20130820-013631.jpg\" class=\"alignnone size-full\" /></a></p>\n<p><em>The fountain and carousel were a big hit with B! </em></p>\n<p><a href=\"http://adventuresofadetroitfamily.files.wordpress.com/2013/08/20130820-014005.jpg\"><img src=\"https://adventuresofadetroitfamily.files.wordpress.com/2013/08/20130820-014005.jpg\" alt=\"20130820-014005.jpg\" class=\"alignnone size-full\" /></a></p>\n<p>The outdoor seating was plentiful, the grills were turning out some quality eats and the sun was beaming. We had just eaten our picnic lunch with Big Daddy, but once B caught sight of that slushie machine, there was NO WAY he was leaving without one. Sooo, my little man got his &#8220;special treat&#8221; of red dye #40 and he couldn&#8217;t have been happier. </p>\n<p><a href=\"http://adventuresofadetroitfamily.files.wordpress.com/2013/08/20130820-015328.jpg\"><img src=\"https://adventuresofadetroitfamily.files.wordpress.com/2013/08/20130820-015328.jpg\" alt=\"20130820-015328.jpg\" class=\"alignnone size-full\" /></a></p>\n<p>The playscape was just big enough for B to get his &#8220;swing on&#8221; but not get lost in an intricate web of shoots and ladders like some we&#8217;ve been to. It had beautiful benches, flowers, waste receptacles and clean, kid friendly bathrooms. There was also a HUGE free parking lot two feet away. <em>Note to self, park there next time if not bringing a stroller! </em></p>\n<p><a href=\"http://adventuresofadetroitfamily.files.wordpress.com/2013/08/20130820-015543.jpg\"><img src=\"https://adventuresofadetroitfamily.files.wordpress.com/2013/08/20130820-015543.jpg\" alt=\"20130820-015543.jpg\" class=\"alignnone size-full\" /></a></p>\n<p>Here is the dichotomy: All of this beauty, cheer, food and fancy drawing your eyes to the river and the joys of being near it, but if you turn around&#8230; It&#8217;s a chained off, barren, seagull infested blight. </p>\n<p><a href=\"http://adventuresofadetroitfamily.files.wordpress.com/2013/08/20130820-020030.jpg\"><img src=\"https://adventuresofadetroitfamily.files.wordpress.com/2013/08/20130820-020030.jpg\" alt=\"20130820-020030.jpg\" class=\"alignnone size-full\" /></a><br />\n<em><br />\nThis is where we make our choice</em> to love her or hate her, or <em>maybe</em> the third option is just allow ourselves to feel <em>both</em>. Isn&#8217;t that what a relationship is all about? </p>\n<p><strong>What are your most recent experiences in Detroit?</strong><em></em></p>\n", "post_id": 143, "location": false, "date": "08-20-2013", "mentions": [], "extracted_features": {}}, {"tags": [], "text": "<div class=\"wpcom-reblog-snapshot\"><div class=\"reblogger-note\"><p class=\"reblogger-headline\"><img alt='' src='https://0.gravatar.com/avatar/384b769726f6dc339fa4bffd8d5c3dae?s=32&#038;d=identicon&#038;r=G' class='avatar avatar-32' height='32' width='32' /><a href=\"http://adventuresofadetroitfamily.com/author/adventuresofadetroitfamily/\">DetroitFamilyFun</a>:</p><div class='reblogger-note-content'><blockquote><p>Former Avalon baker starting a doughnut shop in Harmonie Park using all-natural and organic ingredients?!? AWESOME!!</p>\n</blockquote></div></div><div class=\"reblog-post\"><p class=\"reblog-from\"><img alt='' src='https://0.gravatar.com/avatar/62eff995de4fc23fe35bd671cb934f76?s=48&#038;d=identicon&#038;r=G' class='avatar avatar-48' height='48' width='48' />Originally posted on <a href=\"http://theshadycity.com/2013/08/30/detroit-doughnut-shop-to-honor-producer-j-dilla/\"></a>:</p><div class=\"reblogged-content\">\n<p><a href=\"http://theshadycitycom.files.wordpress.com/2013/08/20130830-231914.jpg\"><img class=\"size-full aligncenter\" src=\"http://theshadycitycom.files.wordpress.com/2013/08/20130830-231914.jpg\" alt=\"20130830-231914.jpg\"></a></p>\n\n<p style=\"text-align:center;\"><strong>Dilla’s Delights, a new coffee and doughnut shop that will open in Harmonie Park this fall.</strong></p>\n\n<p style=\"text-align:center;\"><strong><a href=\"http://dlvr.it/3skd9Q\">READ FULL STORY HERE:</a></strong></p>\n</div><p class=\"reblog-source\"><a href=\"http://theshadycity.com/2013/08/30/detroit-doughnut-shop-to-honor-producer-j-dilla/\">View original</a></p></div></div>", "post_id": 145, "location": false, "date": "08-31-2013", "mentions": [], "extracted_features": {}}, {"tags": ["Pennsylvania", "Michigan", "Virginia", "Labor Day weekend", "Family road trip", "Ohio"], "text": "<p>Six hundred and seventy-eight miles one-way in a car, <em>twice</em> in five days&#8230; Just me and my toddler&#8230; TOP TEN:</p>\n<p>1. I love the rest stops on the Ohio Turnpike. </p>\n<p>2. I hate the tolls on the Pennsylvania Turnpike (holy $28!!).</p>\n<p>3. I hate driving in the rain. Especially when I have to keep adjusting the speed of my windshield wipers.</p>\n<p>4. I hate driving next to trucks when there is no shoulder, we are on a mountain, in a tunnel AND in a construction zone. I blame having watched too many action movies where things tip over and blow up!</p>\n<p>5. I get extremely aggravated, irritated and irrationally angered by people who leave their blinker on for MILES!! C&#8217;mon people, don&#8217;t you HEAR it, SEE it?!? I mean, HOW, HOW do you not know?</p>\n<p>6. I love that the Maryland Welcome Center rest stop has a Play scape!! INGENIOUS!! Note: the two people we saw both times through this past week keep this place as immaculate as Italian grandparents kept their tomato gardens&#8230; a true beacon on the long, long road.</p>\n<p>7. I love that B must have two quarters and a shiny penny to crank out those &#8220;penny pincher&#8221; commemorative pennies at each and every opportunity. Unfortunately, I&#8217;ve discovered half of the machines are not working (at least the ones we encountered between Michigan and Virginia).</p>\n<p>8. I love the ocean, <em>buuuut</em> the beach is sandy. Sandy in such a way that no matter WHAT you are wearing, eating, drinking or laying/sitting on, you will be getting sand in your mouth and every other unmentionable, uncomfortable crevice possible. I always forget this when I enthusiastically plan a day at the beach.</p>\n<p>9. Hotel pools feel SO chlorinated that I always want to do a Silkwood-style scrub down afterward. (It&#8217;s an 80&#8217;s movie, called Silkwood, <em>watch</em> it)</p>\n<p>10. I love my family. They came in from three states just to hang out for a weekend. I love my sisters gourmet, no-carb, perfectly portioned dinners (I think I lost weight, thanks sis!). I love my brothers constant joking about how he hates the water and hates heights, but he is special forces in the Navy and jumps out of airplanes INTO water for his <em>job</em>! I love the scruff of my dads beard on my cheek when he gives me a BIIIIG hug every time I see him.</p>\n<p><a href=\"http://adventuresofadetroitfamily.files.wordpress.com/2013/09/20130901-221221.jpg\"><img src=\"https://adventuresofadetroitfamily.files.wordpress.com/2013/09/20130901-221221.jpg\" alt=\"20130901-221221.jpg\" class=\"alignnone size-full\" /></a></p>\n<p><a href=\"http://adventuresofadetroitfamily.files.wordpress.com/2013/09/20130901-224019.jpg\"><img src=\"https://adventuresofadetroitfamily.files.wordpress.com/2013/09/20130901-224019.jpg\" alt=\"20130901-224019.jpg\" class=\"alignnone size-full\" /></a></p>\n<p><a href=\"http://adventuresofadetroitfamily.files.wordpress.com/2013/09/20130901-224453.jpg\"><img src=\"https://adventuresofadetroitfamily.files.wordpress.com/2013/09/20130901-224453.jpg\" alt=\"20130901-224453.jpg\" class=\"alignnone size-full\" /></a></p>\n<p><a href=\"http://adventuresofadetroitfamily.files.wordpress.com/2013/09/20130901-224517.jpg\"><img src=\"https://adventuresofadetroitfamily.files.wordpress.com/2013/09/20130901-224517.jpg\" alt=\"20130901-224517.jpg\" class=\"alignnone size-full\" /></a></p>\n<p><a href=\"http://adventuresofadetroitfamily.files.wordpress.com/2013/09/20130901-224606.jpg\"><img src=\"https://adventuresofadetroitfamily.files.wordpress.com/2013/09/20130901-224606.jpg\" alt=\"20130901-224606.jpg\" class=\"alignnone size-full\" /></a></p>\n<p>My hubby had to work this Holiday weekend so I called my long distance family and arranged a last minute gathering of a few of us in Virginia Beach. I&#8217;m glad we came!</p>\n<p><em>Tell me about YOUR Labor Day weekend&#8230;</em><strong></strong></p>\n", "post_id": 151, "location": false, "date": "09-02-2013", "mentions": [], "extracted_features": {}}, {"tags": ["summer", "play", "family", "Detroit river", "school", "detroit", "Waldorf", "slide", "playground", "eastern market", "swing", "RiverWalk", "toddler"], "text": "<p><a href=\"http://adventuresofadetroitfamily.files.wordpress.com/2013/09/20130916-075527.jpg\"><img src=\"https://adventuresofadetroitfamily.files.wordpress.com/2013/09/20130916-075527.jpg\" alt=\"20130916-075527.jpg\" class=\"alignnone size-full\" /></a></p>\n<p>Another beautiful day in Detroit. Seventy-seven degrees, slight breeze, sunny blue skies smiling down on everyone, it is a MUST to get down to the Detroit Riverfront before cool Autumn comes rolling in. The playscape is beautifully designed with parents and kids of all sizes in mind. Benches in both sun and shade, clean, lined trash bins and a spectacular backdrop. </p>\n<p><a href=\"http://adventuresofadetroitfamily.files.wordpress.com/2013/09/20130916-080612.jpg\"><img src=\"https://adventuresofadetroitfamily.files.wordpress.com/2013/09/20130916-080612.jpg\" alt=\"20130916-080612.jpg\" class=\"alignnone size-full\" /></a></p>\n<p>The perfect spot for swinging and sliding! </p>\n<p>As we are still in full potty training mode, it was extra nice to be able to park within a few feet in the Rivard parking lot (free). We are still lugging our froggy potty around with us everywhere so B has a familiar spot to relieve himself. However, he did also use the public facilities here today, exercising his new found ability to pee standing up. The restrooms were clean and fully stocked. There was no kiddie potty like at schools or museums, but it was a public restroom that didn&#8217;t induce the gag reflex, always a good thing.</p>\n<p>We played for about an hour and then headed over to visit Eastern Markets Tuesday vendors in Shed 2. Food trucks, live street performances and of course sampling of all the delicious jams, pickles, sweet breads and fruits. The smells and sounds are a treat for the senses and we always walk away with both our belly and our mind on FULL. </p>\n<p><a href=\"http://adventuresofadetroitfamily.files.wordpress.com/2013/09/20130916-084607.jpg\"><img src=\"https://adventuresofadetroitfamily.files.wordpress.com/2013/09/20130916-084607.jpg\" alt=\"20130916-084607.jpg\" class=\"alignnone size-full\" /></a></p>\n<p>So much to do! The staff at <a href=\"http://www.detroiteasternmarket.com/\">Eastern Market</a> are amazing at inspiring and utilizing local talent giving creativity a direct pipeline to the lucky foot traffic twice a week.</p>\n<p><a href=\"http://adventuresofadetroitfamily.files.wordpress.com/2013/09/20130916-085604.jpg\"><img src=\"https://adventuresofadetroitfamily.files.wordpress.com/2013/09/20130916-085604.jpg\" alt=\"20130916-085604.jpg\" class=\"alignnone size-full\" /></a></p>\n<p>We even got to see the championship <a href=\"http://www.detroitwaldorf.com/\">Detroit Waldorf School</a> jump rope team in action! They performed some amazing feats and then opened it up for everyone to get a try. Totally cool.<br />\n<strong><br />\nWhat&#8217;s your favorite &#8220;last days of Summer&#8221; thing to do?</strong><em></em></p>\n", "post_id": 159, "location": false, "date": "09-16-2013", "mentions": [], "extracted_features": {}}, {"tags": ["Mai Tiki Resort", "family", "weekend", "Michigan", "getaway", "detroit", "vacation", "Tawas", "up north", "toddler", "beach", "Oscoda"], "text": "<p>Beach, bonfires, brisket and Paul Bunyan combined with Tiki huts, sand volleyball and waves&#8230; am I still in Michigan?!? Yes, about three hours north of Detroit (give or take traffic). We took a little family weekend getaway to Oscoda, MI and had a BLAST! </p>\n<p><a href=\"http://adventuresofadetroitfamily.files.wordpress.com/2013/09/20130922-113240.jpg\"><img src=\"https://adventuresofadetroitfamily.files.wordpress.com/2013/09/20130922-113240.jpg\" alt=\"20130922-113240.jpg\" class=\"alignnone size-full\" /></a><br />\nIt was pleasantly Autumn weather in northern Michigan. The water was chilly, but not polar bear and refreshing  to feel the waves lapping at your feet and soothing your soul.</p>\n<p><a href=\"http://adventuresofadetroitfamily.files.wordpress.com/2013/09/20130922-113619.jpg\"><img src=\"https://adventuresofadetroitfamily.files.wordpress.com/2013/09/20130922-113619.jpg\" alt=\"20130922-113619.jpg\" class=\"alignnone size-full\" /></a><br />\nWe tossed around a frisbee, zipped down a twelve foot high metal slide (it was AWESOME) and tried our hand at some beach volleyball. </p>\n<p><a href=\"http://adventuresofadetroitfamily.files.wordpress.com/2013/09/20130922-114008.jpg\"><img src=\"https://adventuresofadetroitfamily.files.wordpress.com/2013/09/20130922-114008.jpg\" alt=\"20130922-114008.jpg\" class=\"alignnone size-full\" /></a><br />\nThe resort is made up of vibrantly colored little cottages on the beach where you can step outside your front door and stick your toes in the sand. Mother Nature put on an awe-inspiring light show at sunset. (<em>We took this picture with our iPhone, imagine it in living color, insane!)</em></p>\n<p><a href=\"http://adventuresofadetroitfamily.files.wordpress.com/2013/09/20130922-114459.jpg\"><img src=\"https://adventuresofadetroitfamily.files.wordpress.com/2013/09/20130922-114459.jpg\" alt=\"20130922-114459.jpg\" class=\"alignnone size-full\" /></a><br />\nA mix of sun and clouds wasn&#8217;t exactly August beach weather, but we were happy to play in the sand, building and demolishing sand castles. <em>Sand toys, balls and frisbees were all available for free to guests</em>.</p>\n<p><a href=\"http://adventuresofadetroitfamily.files.wordpress.com/2013/09/20130922-115814.jpg\"><img src=\"https://adventuresofadetroitfamily.files.wordpress.com/2013/09/20130922-115814.jpg\" alt=\"20130922-115814.jpg\" class=\"alignnone size-full\" /></a><br />\nThe town hosted a Paul Bunyan Festival the weekend of our trip (September 20-22, 2013) with bountiful sights to see! A doggie costume contest, a brisket and ribs contest (yum), a wood carving contest (think chainsaws and bear statues) and plenty of carnival food and rides. There was even a real life Paul Bunyan giving free axe throwing lessons, now THAT was a sight to see! </p>\n<p><a href=\"http://adventuresofadetroitfamily.files.wordpress.com/2013/09/20130922-122924.jpg\"><img src=\"https://adventuresofadetroitfamily.files.wordpress.com/2013/09/20130922-122924.jpg\" alt=\"20130922-122924.jpg\" class=\"alignnone size-full\" /></a><br />\nThere was a huge wooden slab target surrounded by massive hay bales to arrest any wayward axe tosses. Most people landed the target with no problem. Paul Bunyan&#8217;s favorite advice to give is often something I say to my two and a half year old, &#8220;finesse not force&#8221;. We sat and watched men and women of all ages and physical stature give the axe throwing a try, it was definitely something I will not soon forget.</p>\n<p>Resort Details:<br />\n<a href=\"http://www.maitikiresort.com/\">Mai Tiki Resort</a><br />\n3322 N. US Route 23<br />\nOscoda, MI 48570<br />\n989-739-9971</p>\n<p><strong>We liked:</strong></p>\n<p>The beach</p>\n<p>The kids pay area</p>\n<p>The full kitchen</p>\n<p>There was a bonfire on the beach every night with wood and chairs provided</p>\n<p>The box fan in the unit (there is central air, but the fan helped as a noise buffer for our toddlers bedroom)</p>\n<p>The charcoal BBQ grill for each unit</p>\n<p>Free wifi</p>\n<p>Flat screen TV with cable that also accepted a DVD player (movies for our toddler to watch as needed, it rained for about two hours one day).</p>\n<p><strong>We brought:</strong></p>\n<p>Food to grill and snacks to munch </p>\n<p>Marshmallows and sticks to roast them<br />\n(There is a Walmart, other chain stores and mom &amp; pop shops within a few miles north and south of the resort to buy whatever you need)</p>\n<p>Charcoal and lighter fluid</p>\n<p>Paper towels, plates and napkins because there is no dishwasher </p>\n<p>Kitchen towels, bath towels AND beach towels (we will also bring tupperware for food storage and our own sponges for dish washing next time)</p>\n<p>Oh yes, we brought beer and wine too</p>\n<p><a href=\"http://adventuresofadetroitfamily.files.wordpress.com/2013/09/20130922-125117.jpg\"><img src=\"https://adventuresofadetroitfamily.files.wordpress.com/2013/09/20130922-125117.jpg\" alt=\"20130922-125117.jpg\" class=\"alignnone size-full\" /></a></p>\n<p>Sure, I would have liked an updated decor with tile floors and new <em>everything</em>, but for the price and locale, it really was a good value. I can appreciate that sand and lake weather can beat down the exterior and interior of a place more than I could imagine, but the manager/owner seemed to take care with heart. There was always a friendly helpful answer to every question we had both before and during our stay. Even when we locked ourselves out, he was kind and gentle with helping us back in.</p>\n<p><strong>We really liked our stay and would go back again</strong><em></em>. </p>\n<p><em>In no way did the resort compensate me to write this review, as always, these are just my opinions.</em></p>\n<p><em><strong>Where was your last weekend getaway?</strong><em></em></em></p>\n", "post_id": 168, "location": false, "date": "09-22-2013", "mentions": [], "extracted_features": {}}, {"tags": [], "text": "<div class=\"wpcom-reblog-snapshot\"><div class=\"reblogger-note\"><p class=\"reblogger-headline\"><img alt='' src='https://0.gravatar.com/avatar/384b769726f6dc339fa4bffd8d5c3dae?s=32&#038;d=identicon&#038;r=G' class='avatar avatar-32' height='32' width='32' /><a href=\"http://adventuresofadetroitfamily.com/author/adventuresofadetroitfamily/\">DetroitFamilyFun</a>:</p><div class='reblogger-note-content'><blockquote><p>Check this out!!!</p>\n</blockquote></div></div><div class=\"reblog-post\"><p class=\"reblog-from\"><img alt='' src='https://1.gravatar.com/avatar/73b6ff13e8df40966576ac8ccc508910?s=48&#038;d=identicon&#038;r=G' class='avatar avatar-48' height='48' width='48' />Originally posted on <a href=\"http://hometownhistorytours.com/2013/09/22/notorious-313-true-crime-ghost-bus-tour/\">HOMETOWN HISTORY TOURS</a>:</p><div class=\"reblogged-content\">\n<h2><span style=\"color:#000000;\">Notorious 313 True Crime / Ghost “Bus” Tour</span></h2>\n\n<h3><span style=\"color:#ff0000;\">Where the real crime is not taking this tour!</span></h3>\n\n<p><strong>Sunday, October 27 / 1 – 5 PM / $39</strong></p>\n\n<p><strong>Discount Code: <span style=\"color:#ff6600;\">HALLOWEEN</span> saves you <span style=\"color:#339966;\">$10 off ticket price</span>.</strong> Use discount code when ordering tickets online or mention it when ordering by phone.</p>\n\n<p><strong>Tours depart <em>promptly</em> </strong>from<strong> <a href=\"http://theparkshelton.com/\">The Park Shelton</a> </strong>lobby located at<strong> 15 E. Kirby </strong><em>(Kirby at Woodward),</em><strong> Detroit, MI 48202.</strong> The Park Shelton offers secure parking for $5 inside the adjacent parking structure (Woodward Avenue entrance). Additional public parking available in nearby lots. <em><strong>For tour information, contact  Hometown History Tours at 734.642.5712,</strong> not the Park Shelton.</em></p>\n\n<h2 style=\"text-align:center;\"><a href=\"http://hometownhistorytours.com/virtual-ticket-office/\">Book tour now</a></h2>\n\n\n<div id=\"attachment_3510\" style=\"width: 271px\" class=\"wp-caption alignleft\"><a href=\"http://hometownhistorytours.files.wordpress.com/2012/10/me.jpg\"><img class=\"size-medium wp-image-3510\" src=\"http://hometownhistorytours.files.wordpress.com/2012/10/me.jpg?w=261&#038;h=300\" height=\"300\" width=\"261\" alt=\"Our Mistress of Darkness is ready to show you the sinister side of the city. \"></a><p class=\"wp-caption-text\">Our Mistress of Darkness is ready to show you the sinister side of the city.</p></div>\n\n\n<p><strong>Ripped from the headlines of Detroit’s past, <em>and not so distant past</em>, this chilling look at the city’s sinister side reveals a reality that’s…</strong></p>\n</div><p class=\"reblog-source\"><a href=\"http://hometownhistorytours.com/2013/09/22/notorious-313-true-crime-ghost-bus-tour/\">View original</a> <span class=\"more-words\">392 more words</span></p></div></div>", "post_id": 170, "location": false, "date": "09-22-2013", "mentions": [], "extracted_features": {}}, {"tags": [], "text": "", "post_id": 172, "location": false, "date": "09-24-2013", "mentions": [], "extracted_features": {}}, {"tags": ["family outings", "July", "Fourth of July", "to do in Metro Detroit"], "text": "<p><a href=\"http://adventuresofadetroitfamily.files.wordpress.com/2013/07/20130704-102827.jpg\"><img src=\"https://adventuresofadetroitfamily.files.wordpress.com/2013/07/20130704-102827.jpg\" alt=\"20130704-102827.jpg\" class=\"alignnone size-full\" /></a></p>\n<p><a href=\"http://adventuresofadetroitfamily.files.wordpress.com/2013/07/20130704-102842.jpg\"><img src=\"https://adventuresofadetroitfamily.files.wordpress.com/2013/07/20130704-102842.jpg\" alt=\"20130704-102842.jpg\" class=\"alignnone size-full\" /></a></p>\n<p><a href=\"http://adventuresofadetroitfamily.files.wordpress.com/2013/07/20130704-102911.jpg\"><img src=\"https://adventuresofadetroitfamily.files.wordpress.com/2013/07/20130704-102911.jpg\" alt=\"20130704-102911.jpg\" class=\"alignnone size-full\" /></a></p>\n<p><a href=\"http://adventuresofadetroitfamily.files.wordpress.com/2013/07/20130704-102927.jpg\"><img src=\"https://adventuresofadetroitfamily.files.wordpress.com/2013/07/20130704-102927.jpg\" alt=\"20130704-102927.jpg\" class=\"alignnone size-full\" /></a></p>\n<p><a href=\"http://adventuresofadetroitfamily.files.wordpress.com/2013/07/20130704-102935.jpg\"><img src=\"https://adventuresofadetroitfamily.files.wordpress.com/2013/07/20130704-102935.jpg\" alt=\"20130704-102935.jpg\" class=\"alignnone size-full\" /></a>\n<p>\nWestland Splash Pad<br />\nClosest cross street: Ford Rd. &amp; Venoy</p>\n<p>\nFree family splash fun all summer long!</p>\n<p>\nRestroom: Port-a-potty only (eek!)</p>\n<p>\nPlay: Great playscape for little ones (2-4) and a GIANT playscape for the older kiddos. </p>\n<p>\nEat:<br />\nPicnic tables are sparsely scattered but I would recommend bringing a picnic blanket and possibly a beach umbrella or tent for shade. Lots of open green space and thick mulch under the play structures but not many trees.</p>\n<p>\nBONUS: We found a festival in full swing quite by accident on Wednesday July 3rd. It had carnival rides, a petting farm, pony rides and fried food. Uniquely it had exotic animals to get photos with. A capuchin monkey even had his own little show. There was a stage set up for music acts to jam through the night. FREE to enter, rides and everything else were all separate fees.</p>\n", "post_id": 18, "location": false, "date": "07-04-2013", "mentions": [], "extracted_features": {}}, {"tags": ["apple cider", "Apple", "family", "apple pie", "cider", "Michigan", "Erie orchards", "apple picking", "cider doughnuts", "pure Michigan", "toddler", "Monroe", "play date"], "text": "<p>Apples, apple cider, apple cider slushies, apple cider doughnuts, apple butter, apple cake, applesauce, apple pie&#8230; I felt like the character Bubba from the movie Forest Gump, except no shrimp! I want B to know where his food comes from. Since he eats about five apples a week, I want him to know they grow on trees and not believe they somehow form from the big fruit bowl on our kitchen counter. </p>\n<p><a href=\"http://adventuresofadetroitfamily.files.wordpress.com/2013/09/20130925-154324.jpg\"><img src=\"https://adventuresofadetroitfamily.files.wordpress.com/2013/09/20130925-154324.jpg\" alt=\"20130925-154324.jpg\" class=\"alignnone size-full\" /></a><br />\nAll told, it took about thirty minutes for my two and a half year old to pick a half <em>BUSHEL</em> of johnagold, red delicious, macintosh and fuji apples. That&#8217;s about fifty apples. All from the trees themselves, any he picked off the ground were rejected from the bag (<em>someone&#8217;s got to do quality control!)</em>. It seemed like that part should&#8217;ve taken longer. </p>\n<p>Since we had driven an hour to get to the orchard and the weather was more Indian Summer than Autumn, we set out to see the rest of the sprawling orchard and seek out more toddler friendly fun.</p>\n<p><a href=\"http://adventuresofadetroitfamily.files.wordpress.com/2013/09/20130925-155226.jpg\"><img src=\"https://adventuresofadetroitfamily.files.wordpress.com/2013/09/20130925-155226.jpg\" alt=\"20130925-155226.jpg\" class=\"alignnone size-full\" /></a><br />\nThere were chickens to feed&#8230;</p>\n<p><a href=\"http://adventuresofadetroitfamily.files.wordpress.com/2013/09/20130925-155310.jpg\"><img src=\"https://adventuresofadetroitfamily.files.wordpress.com/2013/09/20130925-155310.jpg\" alt=\"20130925-155310.jpg\" class=\"alignnone size-full\" /></a><br />\nGoats to be amused by&#8230;</p>\n<p><a href=\"http://adventuresofadetroitfamily.files.wordpress.com/2013/09/20130925-155358.jpg\"><img src=\"https://adventuresofadetroitfamily.files.wordpress.com/2013/09/20130925-155358.jpg\" alt=\"20130925-155358.jpg\" class=\"alignnone size-full\" /></a><br />\nCool, old tractors to explore&#8230;</p>\n<p><a href=\"http://adventuresofadetroitfamily.files.wordpress.com/2013/09/20130925-155713.jpg\"><img src=\"https://adventuresofadetroitfamily.files.wordpress.com/2013/09/20130925-155713.jpg\" alt=\"20130925-155713.jpg\" class=\"alignnone size-full\" /></a><br />\nApple cider AND apple cider doughnuts made it home with us, <strong>barely</strong><em></em>&#8230;</p>\n<p><a href=\"http://adventuresofadetroitfamily.files.wordpress.com/2013/09/20130925-155826.jpg\"><img src=\"https://adventuresofadetroitfamily.files.wordpress.com/2013/09/20130925-155826.jpg\" alt=\"20130925-155826.jpg\" class=\"alignnone size-full\" /></a><br />\nWe each enjoyed (<em>thoroughly</em>) an apple cider doughnut and a shared apple cider slushie (<em>which I never knew existed, </em>new Fall craving MUST HAVE) while browsing their amply stocked apple-everything country store.  </p>\n<p>It was a relaxing, windows-down kind of day. All the way home we talked about goats, chickens, tractors and trees. We also talked about how yummy a fresh baked apple pie would be for dessert that night. When we arrived home, we set out on the task of doing just that. </p>\n<p><a href=\"http://adventuresofadetroitfamily.files.wordpress.com/2013/09/20130925-161356.jpg\"><img src=\"https://adventuresofadetroitfamily.files.wordpress.com/2013/09/20130925-161356.jpg\" alt=\"20130925-161356.jpg\" class=\"alignnone size-full\" /></a><br />\n<em>Rollllllllllll it&#8230;</em></p>\n<p><a href=\"http://adventuresofadetroitfamily.files.wordpress.com/2013/09/20130925-161528.jpg\"><img src=\"https://adventuresofadetroitfamily.files.wordpress.com/2013/09/20130925-161528.jpg\" alt=\"20130925-161528.jpg\" class=\"alignnone size-full\" /></a><br />\nPat it&#8230;</p>\n<p><a href=\"http://adventuresofadetroitfamily.files.wordpress.com/2013/09/20130925-161618.jpg\"><img src=\"https://adventuresofadetroitfamily.files.wordpress.com/2013/09/20130925-161618.jpg\" alt=\"20130925-161618.jpg\" class=\"alignnone size-full\" /></a><br />\nand give it a milk and sugar wash (<em>old bakery trick</em>)&#8230;</p>\n<p><a href=\"http://adventuresofadetroitfamily.files.wordpress.com/2013/09/20130925-161732.jpg\"><img src=\"https://adventuresofadetroitfamily.files.wordpress.com/2013/09/20130925-161732.jpg\" alt=\"20130925-161732.jpg\" class=\"alignnone size-full\" /></a><br />\nMark it with an &#8220;A&#8221; (not a &#8220;B&#8221; as in the nursery rhyme) for apple, then put it in the oven for my family and me!!!!</p>\n<p><a href=\"http://www.erieorchards.com/?pg=home\">Erie Orchards</a> was definitely worth the trip for all of the family fun it provided. No fees to park or play, just pay for the apples you pick.  On weekends there are pony rides, hay rides, a pumpkin shaped bounce house and always an act performing (see their events page). I prefer the quiet peace of a weekday morning, personally. Bathrooms are port-a-johns only, but some of the nicest I&#8217;ve ever encountered. We shall be back!</p>\n<p><strong>Have you been to an orchard to pick apples with your family? What are your family Fall traditions&#8230;<br />\n</strong><em></em></p>\n", "post_id": 184, "location": false, "date": "09-25-2013", "mentions": [], "extracted_features": {}}, {"tags": ["hiking", "nature", "Michigan", "detroit", "rocks", "skipping stones", "parks", "outdoors", "family time", "toddler", "beaches"], "text": "<p>Sometimes you just need to get outside and get immersed in nature. Deep forest, marshlands, estuaries, lakes, water fowl and everything that goes along with it. Without traveling more than 30 minutes from Greektown, you can find peace and tranquility in the form of Metro Parks.</p>\n<p> <a href=\"http://www.inmetrodetroit.com/outdoors/metro_parks.htm\">Detroit Metro Parks</a> are as diverse as the city itself. Many have Nature Centers with turtle tanks and local wildlife hides for show and tell. We&#8217;ve attended many pre-registered events for a meager $3.00 that gave B inspiration for weeks of imaginative play. </p>\n<p>There are paved running trails that are stroller friendly and more rugged trails lined with mulch. Whether you like a colorful playscape or a deep, dark forest, there is something for everyone! </p>\n<p>One of our favorites is <a href=\"http://www.michigan.org/property/lake-erie-metropark/\">Lake Erie Metro Park</a> because of the children&#8217;s play area and tiny beach nearby to throw rocks into the lake (B&#8217;s favorite pastime). This past Saturday morning was absolutely gorgeous weather and the park was the perfect place to stretch our legs. We packed a picnic lunch and spent a few hours climbing, swinging, digging, sliding and skipping.</p>\n<p><a href=\"http://adventuresofadetroitfamily.files.wordpress.com/2013/10/20131001-144804.jpg\"><img src=\"https://adventuresofadetroitfamily.files.wordpress.com/2013/10/20131001-144804.jpg\" alt=\"20131001-144804.jpg\" class=\"alignnone size-full\" /></a><br />\nAnother favorite of ours for toddler-sized nature walks is <a href=\"http://gocitykids.parentsconnect.com/attraction/oakwoods-metropark-17845-savage-road-belleville-mi-48111-us\">Oakwoods Metro Park</a> where the 700ft. nature trail surrounding the Nature Center is perfect for B&#8217;s interests, legs and attention span.</p>\n<p><a href=\"http://adventuresofadetroitfamily.files.wordpress.com/2013/10/20131001-150256.jpg\"><img src=\"https://adventuresofadetroitfamily.files.wordpress.com/2013/10/20131001-150256.jpg\" alt=\"20131001-150256.jpg\" class=\"alignnone size-full\" /></a><br />\nA balcony overlooking the river/estuary was perfect for skipping stones with B. </p>\n<p><a href=\"http://adventuresofadetroitfamily.files.wordpress.com/2013/10/20131001-150446.jpg\"><img src=\"https://adventuresofadetroitfamily.files.wordpress.com/2013/10/20131001-150446.jpg\" alt=\"20131001-150446.jpg\" class=\"alignnone size-full\" /></a><br />\nThe path was perfect for exploring. We searched for different sizes, shapes and colors of leaves for our seasonal nature table. We found leaves, insects, spiders and birds to observe quietly. We collected acorns, chestnuts and bark that had fallen around the trail. It was punctuated enough for B and diverse enough to hold the adults interest for the morning. </p>\n<p><a href=\"http://adventuresofadetroitfamily.files.wordpress.com/2013/10/20131001-152013.jpg\"><img src=\"https://adventuresofadetroitfamily.files.wordpress.com/2013/10/20131001-152013.jpg\" alt=\"20131001-152013.jpg\" class=\"alignnone size-full\" /></a><br />\n<strong>Do you have a favorite spot in nature that you love to spend family time?</strong><em></em></p>\n", "post_id": 190, "location": false, "date": "10-01-2013", "mentions": [], "extracted_features": {}}, {"tags": [], "text": "<div class=\"wpcom-reblog-snapshot\"><div class=\"reblogger-note\"><p class=\"reblogger-headline\"><img alt='' src='https://0.gravatar.com/avatar/384b769726f6dc339fa4bffd8d5c3dae?s=32&#038;d=identicon&#038;r=G' class='avatar avatar-32' height='32' width='32' /><a href=\"http://adventuresofadetroitfamily.com/author/adventuresofadetroitfamily/\">DetroitFamilyFun</a>:</p><div class='reblogger-note-content'><blockquote><p>Great information on Detroit and Belle Isle Zoo:</p>\n</blockquote></div></div><div class=\"reblog-post\"><p class=\"reblog-from\"><img alt='' src='https://1.gravatar.com/avatar/ade7e11bb81d89ee5a8de61b3ae2eed3?s=48&#038;d=identicon&#038;r=G' class='avatar avatar-48' height='48' width='48' />Originally posted on <a href=\"http://woodwardspine.com/2013/09/27/grey-seal-georgie-joins-other-rescued-seals-at-arctic-ring-of-life/\">The Woodward Spine</a>:</p><div class=\"reblogged-content\">\n<div id=\"attachment_4895\" style=\"width: 1034px\" class=\"wp-caption aligncenter\"><a href=\"http://thewoodwardspine.files.wordpress.com/2013/09/georgie-the-grey-seal-7eb5704e4775e8ff.jpg\"><img class=\"size-large wp-image-4895\" src=\"http://thewoodwardspine.files.wordpress.com/2013/09/georgie-the-grey-seal-7eb5704e4775e8ff.jpg?w=1024&#038;h=698\"   alt=\"Tom Roy | Detroit Zoological Society\"></a><p class=\"wp-caption-text\">Tom Roy | Detroit Zoological Society</p></div>\n\n<p>ROYAL OAK, Mich. – Things are looking a little less grey for a seal that has arrived from the Marine Animal Rehabilitation Center at the University of New England to her new, permanent home at the Detroit Zoo’s Arctic Ring of Life.</p>\n\n<p>The female grey seal pup – estimated to be less than a year old – was found stranded on the coast of Georgetown, Maine, by Marine Mammals of Maine. She was deemed non-releasable to the wild by NOAA (National Oceanic and Atmospheric Administration) due to severely compromised eyesight.</p>\n\n<p>The seal has been named Georgie after the Maine coastal city where she was found. Weighing only 87 pounds at the time of her arrival in June, Georgie is thriving under the Zoo’s care and now weighs about 140 pounds. She joins grey seal Kiinaq, harp seal Pequot and harbor seals Sidney and Freita…</p>\n</div><p class=\"reblog-source\"><a href=\"http://woodwardspine.com/2013/09/27/grey-seal-georgie-joins-other-rescued-seals-at-arctic-ring-of-life/\">View original</a> <span class=\"more-words\">283 more words</span></p></div></div>", "post_id": 192, "location": false, "date": "10-01-2013", "mentions": [], "extracted_features": {}}, {"tags": ["Michigan", "Date night", "one-eyed Betty", "Ferndale"], "text": "<p>Date night in fabulous Ferndale! One mile north of the city limit at 9 mile &amp; Woodward Ave. is the hopping little city center of Ferndale. I&#8217;ve been following <a href=\"http://thehungrydudes.com/\">The Hungry Dude</a>and based on some eye-popping pics he posted I have been trying to get to <a href=\"http://oneeyedbettys.com/about/\">One- Eyed Betty&#8217;s</a> for months. </p>\n<p>Finally, one of my hubby&#8217;s favorite bands <a href=\"https://m.facebook.com/halflightmusic?id=71680497794&amp;_rdr\">Half Light Music</a>  was playing at <a href=\"http://www.themagicbag.com/welc.htm\">The Magic Bag</a> so I convinced him to have a beer and some appetizers first.</p>\n<p><a href=\"http://adventuresofadetroitfamily.files.wordpress.com/2013/10/20131003-145043.jpg\"><img src=\"https://adventuresofadetroitfamily.files.wordpress.com/2013/10/20131003-145043.jpg\" alt=\"20131003-145043.jpg\" class=\"alignnone size-full\" /></a><br />\nIt was a Friday night around 8ish so we had to wait awhile for a table, but that was just perfect for me to get to taste MORE of their <em>enormous</em> beer menu (yahoo!). We sat down to friendly, helpful servers who guided our selection of two different beers and two apps (<em>our eyes were DEFINITELY bigger than our stomachs!)</em> it was all amazing! I&#8217;m not sure if it was the fact we were out alone for the first time in a month, the high alcohol content of the beer or the fabulous food, but I was experiencing Nirvana when the Pork Belly Poutine and the cutting board sampler came to the table.<br />\n<br /><a href=\"http://adventuresofadetroitfamily.files.wordpress.com/2013/10/20131003-145807.jpg\"><img src=\"https://adventuresofadetroitfamily.files.wordpress.com/2013/10/20131003-145807.jpg\" alt=\"20131003-145807.jpg\" class=\"alignnone size-full\" /></a><br />\nThis photo does the food absolutely no justice&#8230;it was salty, crunchy, gooey, cheesy AND savory&#8230;<br />\n<br /><a href=\"http://adventuresofadetroitfamily.files.wordpress.com/2013/10/20131003-150131.jpg\"><img src=\"https://adventuresofadetroitfamily.files.wordpress.com/2013/10/20131003-150131.jpg\" alt=\"20131003-150131.jpg\" class=\"alignnone size-full\" /></a><br />\nI hadn&#8217;t even noticed the horrible glare off the menu when I took this picture because my eyes were tearing up in delight!</p>\n<p><strong><em>What&#8217;s your favorite date night spot or one you&#8217;ve been eyeing??</em></strong></p>\n", "post_id": 194, "location": false, "date": "10-03-2013", "mentions": [], "extracted_features": {}}, {"tags": ["parent-tot class", "toddler", "family", "Michigan", "early childhood", "Waldorf", "detroit", "education", "pre-school"], "text": "<p>Seasonal scents of applesauce and soups dance down the hallways with the sounds of children singing and making music. As my little guy leans his head on my shoulder, still not sure about coming back to &#8220;school&#8221;, his tense muscles begin to relax and he starts to peek up. Slowly, he asks to slide down so he can walk on his own as we approach Miss Maggie&#8217;s Parent-Tot Classroom. </p>\n<p>Leaving our shoes and bags in a cubby outside the room entrance, Miss Maggie greets us warmly, washing B&#8217;s hands for him with a cloth warmed with lavender and water. I wash my hands too and bring the cloth to the tot-sized table as we take a seat and begin to chat with our neighbors while peeling and slicing apples from the mounding bowl on the table. Everyone joins in as an easy rhythym begins and the children start to lose interest in the apple slicing and explore the simple wooden toys in a peacefully muted play area. </p>\n<p><a href=\"http://adventuresofadetroitfamily.files.wordpress.com/2013/10/20131005-203844.jpg\"><img src=\"https://adventuresofadetroitfamily.files.wordpress.com/2013/10/20131005-203844.jpg\" alt=\"20131005-203844.jpg\" class=\"alignnone size-full\" /></a><br />\nMiss Maggie invites the class to sing the &#8220;Good Morning song&#8221; with lots of big movements that encourage the children to stretch and giggle. This easily transitions into holding hands for a lively game of Ring-Around-the-Rosie where the &#8220;cows are in the meadow eating buttercups&#8221; (B&#8217;s <em>faaaavorite</em> part). After independent play and quiet parent observation she offers some talking points about the development and education of our tots and then prepares the table for snack. </p>\n<p>I absolutely love that we MADE our own snack from scratch, have been smelling it cooking the entire morning and will now get to share it with our friends!  I was nervous at first about the bowls and teacups being &#8220;real&#8221;, in other words they would break if they dropped, but it feels very special and sweet to be sipping out of them. The very shape and weight of a teacup seems to encourage delicacy.</p>\n<p>Of course the children should have &#8220;real&#8221; tools to work with, and in twelve weeks I&#8217;ve never seen one break once. A candle is lit and a non-denominational &#8220;blessings on our snack&#8221; is said before we pour water or tea from glass pitchers into our <em>grandmother-esque</em> teacup and pass a bowl of almonds or berries around the table to top our freshly made applesauce. What a treat!</p>\n<p>A relaxing, bonding and educational morning for my son and myself. I feel a collective &#8220;sigh&#8221; as class comes to a close and we pick up our bags and our tots to head outside to the beautifully natural play area. </p>\n<p><a href=\"http://adventuresofadetroitfamily.files.wordpress.com/2013/10/20131006-092044.jpg\"><img src=\"https://adventuresofadetroitfamily.files.wordpress.com/2013/10/20131006-092044.jpg\" alt=\"20131006-092044.jpg\" class=\"alignnone size-full\" /></a><br />\n<a href=\"http://www.detroitwaldorf.org/parent_child.html\">The Detroit Waldorf School</a> has given my son and I a local opportunity to connect with nature and our neighbors once a week. The six week parent-tot sessions are short enough to get a good sized sample of the Waldorf education model and early childhood curriculum without a huge commitment. It&#8217;s definitely been a joy for us. </p>\n<p><a href=\"http://adventuresofadetroitfamily.files.wordpress.com/2013/10/20131006-105921.jpg\"><img src=\"https://adventuresofadetroitfamily.files.wordpress.com/2013/10/20131006-105921.jpg\" alt=\"20131006-105921.jpg\" class=\"alignnone size-full\" /></a></p>\n", "post_id": 209, "location": false, "date": "10-06-2013", "mentions": [], "extracted_features": {}}, {"tags": ["nutrition", "cookies", "snack", "baking", "toddler recipes", "healthy", "dairy-free", "Egg-free", "egg less", "healthy baking", "toddler", "vegetables"], "text": "<p>I couldn&#8217;t believe it when I read the <a href=\"http://spouseinthehouse.wordpress.com/2013/10/05/sneaky-veggie-cookies-for-toddlers/\">Spouse in the House</a> blog this morning. Veggie cookies?!? Since all my little guy does is bite a carrot or broccoli and spit it out, I needed a new way to add more vegetables into his day. I&#8217;ve been using <a href=\"http://doitdelicious.com/cookbooks/deceptively_delicious\">Deceptively Delicious</a> for macaroni and cheese, meatballs and sauce as well as morning pancakes but a &#8220;cookie&#8221; really kicks it up a notch. So, I walked straight into the kitchen and started pulling ingredients out.  I didn&#8217;t have zucchini or carrot but I did have puréed apple and a small bag of frozen kale left over from our CSA basket. </p>\n<p><a href=\"http://adventuresofadetroitfamily.files.wordpress.com/2013/10/20131006-143414.jpg\"><img src=\"https://adventuresofadetroitfamily.files.wordpress.com/2013/10/20131006-143414.jpg\" alt=\"20131006-143414.jpg\" class=\"alignnone size-full\" /></a><br />\n<strong>Here is what I did:</strong><br />\n2 cups oatmeal (<em>or more to get a cookie dough consistency</em>)<br />\n2 bananas (<em>the browner the better</em>)<br />\n1/3 cup apples (<em>I had a ton from apple picking so I just used a few cubes that I had puréed and froze</em>n)<br />\n1/4 teaspoon vanilla extract<br />\n1/2 teaspoon cinnamon<br />\n1/2 teaspoon ground ginger<br />\n1/2 cup kale (<em>I minced it in my mini food processor</em>)<br />\n3 Tablespoons Raw honey (<em>mine was from a hive at a raspberry farm &#8211; yummy</em>)<br />\n1 pint blueberries  (<em>had them around, so I figured I would toss them in</em>)</p>\n<p>Preheat oven to 350 degrees.</p>\n<p>I added everything into one big bowl and mashed it with a potato masher. It was a little watery so I added about a half cup more oatmeal. </p>\n<p>I lined a cookie sheet with parchment paper and patted twelve &#8220;cookies&#8221; into shape. I wasn&#8217;t sure if they&#8217;d be spreading or staying put, so I spread them out. </p>\n<p>Bake for 15 minutes</p>\n<p><a href=\"http://adventuresofadetroitfamily.files.wordpress.com/2013/10/20131006-144328.jpg\"><img src=\"https://adventuresofadetroitfamily.files.wordpress.com/2013/10/20131006-144328.jpg\" alt=\"20131006-144328.jpg\" class=\"alignnone size-full\" /></a><br />\nThey did not spread at all and came out of the oven in 15 minutes firm on the outside and cake-like on the inside. Perfect.</p>\n<p><a href=\"http://adventuresofadetroitfamily.files.wordpress.com/2013/10/20131006-145041.jpg\"><img src=\"https://adventuresofadetroitfamily.files.wordpress.com/2013/10/20131006-145041.jpg\" alt=\"20131006-145041.jpg\" class=\"alignnone size-full\" /></a><br />\n I &#8220;shared&#8221; three hot out of the oven with B. He said they were yummy too!<br />\nThank you <a href=\"http://spouseinthehouse.wordpress.com/2013/10/05/sneaky-veggie-cookies-for-toddlers/\">Spouse in the House</a>, please go to their blog and check out the original recipe I found that inspired me to write two blogs in one day!!<br />\n<strong><br />\nDo you have a healthy veggie recipe that&#8217;s a hit at your house? </strong><em></em></p>\n", "post_id": 214, "location": false, "date": "10-06-2013", "mentions": [], "extracted_features": {}}, {"tags": [], "text": "<p><a href='http://adventuresofadetroitfamily.wordpress.com/about/'>About</a>.</p>\n", "post_id": 22, "location": false, "date": "07-05-2013", "mentions": [], "extracted_features": {}}, {"tags": ["play", "Michigan", "Halloween", "dress-up", "detroit", "autumn", "family fun", "costume", "toddler"], "text": "<p>You might get ticketed by the costume police when you&#8217;ve got a matching vehicle as a part of the design. We &#8220;spared no expense&#8221; as they said on Jurassic Park&#8230; Oy! I justify the expense by telling myself, &#8220;I only have one child and there are a finite amount of Halloweens&#8230;yadda, yadda&#8221;, you know the lies we tell ourselves.<br />\n<br /><a href=\"http://adventuresofadetroitfamily.files.wordpress.com/2013/10/20131015-222921.jpg\"><img src=\"https://adventuresofadetroitfamily.files.wordpress.com/2013/10/20131015-222921.jpg\" alt=\"20131015-222921.jpg\" class=\"alignnone size-full\" /></a><br />\nI fell in love with it at first sight! I love the hat, the boots, the badge, I love it all! Not to mention, B seems to like it too. </p>\n<p><a href=\"http://adventuresofadetroitfamily.files.wordpress.com/2013/10/20131015-223406.jpg\"><img src=\"https://adventuresofadetroitfamily.files.wordpress.com/2013/10/20131015-223406.jpg\" alt=\"20131015-223406.jpg\" class=\"alignnone size-full\" /></a><br />\nA tip &#8216;o the hat and my heart swooned. No warm blooded mommy could say no to this, right? </p>\n<p><a href=\"http://adventuresofadetroitfamily.files.wordpress.com/2013/10/20131015-223622.jpg\"><img src=\"https://adventuresofadetroitfamily.files.wordpress.com/2013/10/20131015-223622.jpg\" alt=\"20131015-223622.jpg\" class=\"alignnone size-full\" /></a><br />\nThere he goes, having stolen my poor heart! </p>\n<p><strong><em>What costumes are your kiddos wearing this year</em>?</strong></p>\n", "post_id": 220, "location": false, "date": "10-16-2013", "mentions": [], "extracted_features": {}}, {"tags": ["cookies", "family", "simple", "dairy-free", "gluten-free", "toddler"], "text": "<p>3 ingredient, gluten-free peanut butter cookies:</p>\n<p>Preheat oven to 350 degrees.</p>\n<p>1 egg<br />\n1 cup of sugar<br />\n1 cup of peanut butter</p>\n<p><a href=\"http://adventuresofadetroitfamily.files.wordpress.com/2013/10/20131021-012430.jpg\"><img src=\"https://adventuresofadetroitfamily.files.wordpress.com/2013/10/20131021-012430.jpg\" alt=\"20131021-012430.jpg\" class=\"alignnone size-full\" /></a><br />\nMix all ingredients into one bowl. Stir until well-combined. Roll into balls. Place on a well-greased or parchment-lined cookie sheet and press down with the tines of a fork to make the classic peanut butter cookie criss-cross pattern.</p>\n<p><a href=\"http://adventuresofadetroitfamily.files.wordpress.com/2013/10/20131021-012759.jpg\"><img src=\"https://adventuresofadetroitfamily.files.wordpress.com/2013/10/20131021-012759.jpg\" alt=\"20131021-012759.jpg\" class=\"alignnone size-full\" /></a><br />\nBake for 11 minutes, or until slightly browned. Allow to set for a few minutes, then place on a cooling rack.</p>\n<p><a href=\"http://adventuresofadetroitfamily.files.wordpress.com/2013/10/20131021-013000.jpg\"><img src=\"https://adventuresofadetroitfamily.files.wordpress.com/2013/10/20131021-013000.jpg\" alt=\"20131021-013000.jpg\" class=\"alignnone size-full\" /></a><br />\nI double dog dare you NOT to eat these all in one night!<br />\n<strong><br />\n<em>What&#8217;s your favorite gluten-free dessert recipe?</em></strong></p>\n", "post_id": 226, "location": false, "date": "10-21-2013", "mentions": [], "extracted_features": {}}, {"tags": ["October", "family", "autumn", "seasons", "kids", "fall", "preschooler", "toddler"], "text": "<p><a href=\"http://farmercharleys.com/planVisit.php\">Farmer Charley&#8217;s </a> off Nadeau Rd. and interstate 75 is our favorite place for family fun for two reasons&#8230; The HOPPER and the Pumpkin CANNON! </p>\n<p>The Hopper is a HUGE bounce house floor (25 yards X 10 yards, maybe?) buried in what looks like a sandy beach volleyball court next to their corn maze. Our kid looooves a bounce house and this one is huge and more importantly, well-monitored by a staff member. Only a few kids of equal size allowed on for two minute intervals. You may not, but I have an <em>unusual</em> fear of a head injury being caused by this &#8220;kid-friendly&#8221; activity, but here, I feel SAFE(er), <em>more than anywhere else </em>at least.</p>\n<p><a href=\"http://adventuresofadetroitfamily.files.wordpress.com/2013/10/20131028-080355.jpg\"><img src=\"https://adventuresofadetroitfamily.files.wordpress.com/2013/10/20131028-080355.jpg\" alt=\"20131028-080355.jpg\" class=\"alignnone size-full\" /></a></p>\n<p><a href=\"http://adventuresofadetroitfamily.files.wordpress.com/2013/10/20131028-080605.jpg\"><img src=\"https://adventuresofadetroitfamily.files.wordpress.com/2013/10/20131028-080605.jpg\" alt=\"20131028-080605.jpg\" class=\"alignnone size-full\" /></a><br />\nThe pumpkin cannon is something we cannot find anywhere else and we talk about ALL YEAR!  The crew welded their own metal pieces together, painted it army green and powered it with an air compressor (so no &#8220;kick back&#8221; like a real big gun/cannon, <em>for those of you who may be familiar)</em>.  For $20 we got about twenty minutes of punkin&#8217; chunkin&#8217; fun! </p>\n<p><a href=\"http://adventuresofadetroitfamily.files.wordpress.com/2013/10/20131028-081512.jpg\"><img src=\"https://adventuresofadetroitfamily.files.wordpress.com/2013/10/20131028-081512.jpg\" alt=\"20131028-081512.jpg\" class=\"alignnone size-full\" /></a><br />\nThe farm even has huge wooden &#8220;targets&#8221; cut out and painted for Halloween. There is something so satisfying about having those mini pumpkins SMACK and SPLATTER against the face of a jack-o-lantern.</p>\n<p><a href=\"http://adventuresofadetroitfamily.files.wordpress.com/2013/10/20131028-081739.jpg\"><img src=\"https://adventuresofadetroitfamily.files.wordpress.com/2013/10/20131028-081739.jpg\" alt=\"20131028-081739.jpg\" class=\"alignnone size-full\" /></a><br />\nI&#8217;ll be honest, this is something we ALL look forward to! </p>\n<p>They have a smorgasbord of activities at this family farm that are all kitschy and totally awesome. I couldn&#8217;t get pictures of everything and still enjoy my family because it&#8217;s a thrill a minute!</p>\n<p>1) Pig races with an announcer and prizes.<br />\n2) Hayrides back to the pumpkin patch<br />\n3) A very challenging corn maze that was laser cut into their field to look like Spider-Man this year. They take a poll on their Facebook page every year.<br />\n4) Barrel train rides with a souped up riding mower as the engine driven by a descendent of Mario Andretti.<br />\n5) A huge firepit is lit every night that you can warm up to or buy s&#8217;mores kits at their bakery and roast &#8216;em up!<br />\n6) Their bakery has apple cider slushies, warm apple cider, hot cocoa, coffee and every type of fancy cookie and doughnut you may be craving.<br />\n7) A massive dirt/sand box with toys<br />\n8) A few tether ball poles (the only thing my kid likes more than jumping is hitting/throwing a ball)</p>\n<p>We practiced roping cattle&#8230;</p>\n<p><a href=\"http://adventuresofadetroitfamily.files.wordpress.com/2013/10/20131028-082816.jpg\"><img src=\"https://adventuresofadetroitfamily.files.wordpress.com/2013/10/20131028-082816.jpg\" alt=\"20131028-082816.jpg\" class=\"alignnone size-full\" /></a><br />\nRacing rubber duckies&#8230;</p>\n<p><a href=\"http://adventuresofadetroitfamily.files.wordpress.com/2013/10/20131028-082942.jpg\"><img src=\"https://adventuresofadetroitfamily.files.wordpress.com/2013/10/20131028-082942.jpg\" alt=\"20131028-082942.jpg\" class=\"alignnone size-full\" /></a></p>\n<p><a href=\"http://adventuresofadetroitfamily.files.wordpress.com/2013/10/20131028-083048.jpg\"><img src=\"https://adventuresofadetroitfamily.files.wordpress.com/2013/10/20131028-083048.jpg\" alt=\"20131028-083048.jpg\" class=\"alignnone size-full\" /></a><br />\nThere is a tent where they make fresh kettle corn right in front of you. Next door is a snack shack you can order any number of artery-clogging fried goodies, including corn dogs on a stick, quite a novelty! You may not bring your own food, <em>so try to eat beforehand.</em> There is a huge tent with lots of picnic tables however, if the mood strikes you to sit and nosh on some carnival-esque foods.</p>\n<p>The fun was everywhere to be had, even in the most simple of things. They had tractors from a nearby dealership that we loved exploring, pushing buttons and honking the horn.</p>\n<p><a href=\"http://adventuresofadetroitfamily.files.wordpress.com/2013/10/20131028-083938.jpg\"><img src=\"https://adventuresofadetroitfamily.files.wordpress.com/2013/10/20131028-083938.jpg\" alt=\"20131028-083938.jpg\" class=\"alignnone size-full\" /></a><br />\nWe rolled around and around all over the great lawn in plastic drainage tubes.  This idea was genius! </p>\n<p><a href=\"http://adventuresofadetroitfamily.files.wordpress.com/2013/10/20131028-084104.jpg\"><img src=\"https://adventuresofadetroitfamily.files.wordpress.com/2013/10/20131028-084104.jpg\" alt=\"20131028-084104.jpg\" class=\"alignnone size-full\" /></a><br />\nOf course, no farm would be complete without farm animals. We enjoyed petting, feeding and talking to the goats, cow and sheep.</p>\n<p><a href=\"http://adventuresofadetroitfamily.files.wordpress.com/2013/10/20131028-084243.jpg\"><img src=\"https://adventuresofadetroitfamily.files.wordpress.com/2013/10/20131028-084243.jpg\" alt=\"20131028-084243.jpg\" class=\"alignnone size-full\" /></a><br />\nThursday nights are family night, so if you bring a can/box of non-perishable food you can get a discounted admission. It was also not as crowded (read, less lines) on a Thursday night versus a weekend afternoon. We purchased &#8220;bounce back&#8221; tickets at half price before we left to visit again.<br />\nI hope we get to use them again this week, my trigger finger is getting itchy <span class='wp-smiley wp-emoji wp-emoji-wink' title=';)'>;)</span></p>\n<p>Potty details:<br />\nPort-a-John use only, but they are not totally horrible. Plus, my kid looooves a urinal. Hey, anything to encourage potty-training, right?</p>\n<p><em><strong>What&#8217;s your favorite Fall Family Fun place to visit</strong>?</em></p>\n", "post_id": 238, "location": false, "date": "10-28-2013", "mentions": [], "extracted_features": {}}, {"tags": ["kids", "family", "detroit", "family fun", "playground", "preschooler", "Dearborn", "toddler", "playscape"], "text": "<p>Greenfield Village is an authentic time machine that can transport you into Edison&#8217;s workshop and the very chair he used while inventing the incandescent light bulb or into the Wright brothers family kitchen. Take a horse and buggy ride, cruise in a model T Ford or chug along on a steam train. </p>\n<p>The one hundred year old carousel is magical and the village green is the perfect spot for a family game of &#8220;tag&#8221;. You can bring your own picnic lunch or enjoy a healthy snack (most likely grown or made in the Village) from one of their shops. With all of that, they&#8217;ve gone and topped it!</p>\n<p><em>Introducing</em> (drum roll, please) <em>the <strong>new</strong> playscape! </em></p>\n<p><a href=\"http://adventuresofadetroitfamily.files.wordpress.com/2013/10/20131028-232921.jpg\"><img src=\"https://adventuresofadetroitfamily.files.wordpress.com/2013/10/20131028-232921.jpg\" alt=\"20131028-232921.jpg\" class=\"alignnone size-full\" /></a><br />\nA huge Firestone tire replica spins round and round in one corner and the two-story water tower shines in the weak October sun, highlighting three ways to go up and down!  It&#8217;s fully fenced in with a staff member at the entrance/exit to guide young explorers. It has something for every age group, even the adults! Our first time there we spent two hours and only explored half of the playscape! </p>\n<p><a href=\"http://adventuresofadetroitfamily.files.wordpress.com/2013/10/20131028-233617.jpg\"><img src=\"https://adventuresofadetroitfamily.files.wordpress.com/2013/10/20131028-233617.jpg\" alt=\"20131028-233617.jpg\" class=\"alignnone size-full\" /></a><br />\nOf course there&#8217;s a Ford flatbed truck! Climb in the drivers seat, turn on the engine and imagine yourself trolling along. Just in front of its bumper is the sandbox, of course it wouldn&#8217;t be complete without a life-size excavator, right? Then there is the ten foot high pumping station that spits out real water (even at the end of October) and the swing set that will delight infants and gymnasts alike. </p>\n<p><a href=\"http://adventuresofadetroitfamily.files.wordpress.com/2013/10/20131029-000006.jpg\"><img src=\"https://adventuresofadetroitfamily.files.wordpress.com/2013/10/20131029-000006.jpg\" alt=\"20131029-000006.jpg\" class=\"alignnone size-full\" /></a><br />\nYou can sing &#8220;row, row, row your boat&#8221; at the top of your lungs!</p>\n<p><a href=\"http://adventuresofadetroitfamily.files.wordpress.com/2013/10/20131029-000147.jpg\"><img src=\"https://adventuresofadetroitfamily.files.wordpress.com/2013/10/20131029-000147.jpg\" alt=\"20131029-000147.jpg\" class=\"alignnone size-full\" /></a><br />\nLearn about the physics of water flow&#8230;</p>\n<p><a href=\"http://adventuresofadetroitfamily.files.wordpress.com/2013/10/20131029-000327.jpg\"><img src=\"https://adventuresofadetroitfamily.files.wordpress.com/2013/10/20131029-000327.jpg\" alt=\"20131029-000327.jpg\" class=\"alignnone size-full\" /></a><br />\nPlace different shaped wood pieces at different intervals to create a damn or a waterfall&#8230;</p>\n<p><a href=\"http://adventuresofadetroitfamily.files.wordpress.com/2013/10/20131029-000504.jpg\"><img src=\"https://adventuresofadetroitfamily.files.wordpress.com/2013/10/20131029-000504.jpg\" alt=\"20131029-000504.jpg\" class=\"alignnone size-full\" /></a><br />\nRegardless of your intent, you won&#8217;t be able to stop the mystical time tunnel that is, <a href=\"http://m.thehenryford.org/\">Greenfield Village</a>.</p>\n<p><a href=\"http://adventuresofadetroitfamily.files.wordpress.com/2013/10/20131029-000749.jpg\"><img src=\"https://adventuresofadetroitfamily.files.wordpress.com/2013/10/20131029-000749.jpg\" alt=\"20131029-000749.jpg\" class=\"alignnone size-full\" /></a><br />\nPotty details:<br />\nProper restrooms with changing tables, family restrooms with rockers for nursing and real soap and towels to dry are everywhere throughout the village. </p>\n<p>Cost:<br />\nThis place is not cheap. We do get a membership each year with ride passes and at nearly $370.00, it is triple the cost of our zoo or science center memberships, <em>but completely worth it</em>. </p>\n<p>Parking:<br />\nEasy and free if you are a member. Easy, still, even if you&#8217;re not a member, they just add the cost onto your ticket,</p>\n<p><em><strong>As always, these are simply my own opinions and observations. I did not in ANY way get compensated for this review. </strong></em></p>\n<p>Do you have a favorite play area around town? Write it in the replies, or if you&#8217;ve already written about it, post your link <span class='wp-smiley wp-emoji wp-emoji-smile' title=':)'>:)</span></p>\n", "post_id": 247, "location": false, "date": "10-29-2013", "mentions": [], "extracted_features": {}}, {"tags": ["kids", "parent", "family", "rainy day play", "Bowling", "toddler"], "text": "<p>It&#8217;s a rainy day and our active family cannot be cooped up at home for long or we start to get crabby. So we tried a bowling alley in Allen Park, MI.</p>\n<p><a href=\"http://www.rooseveltlanes.com/open.html\" rel=\"nofollow\">http://www.rooseveltlanes.com/open.html</a></p>\n<p>A friend had pointed us in their direction because it is small, clean and family owned and operated, my kind of place. </p>\n<p>For less than $5 our toddler got shoes, a ball he could lift (6 pounds) and an open lane. The staff gave us an apparatus that is used by bowlers in a wheelchair but it worked perfect for our two year old. They raised the &#8220;bumpers&#8221; on the lane so no matter how B threw the bowling ball, it would make it down the lane. </p>\n<p>After a few rolls, B wanted to try to throw it down the lane like Daddy does. Now, Daddy has two 300 rings from league play, so, I think it&#8217;s safe to say, we&#8217;d all like to throw the ball like him, but regardless, B was done with the handicap ramp. He rolled the ball as hard as could down the lane and it literally took so long to get to the pubs the roll didn&#8217;t even register! Too funny! It was about as fun as watching paint dry but B got his silly&#8217;s out and we all had a few laughs.</p>\n<p><a href=\"http://adventuresofadetroitfamily.files.wordpress.com/2013/07/20130705-135733.jpg\"><img src=\"https://adventuresofadetroitfamily.files.wordpress.com/2013/07/20130705-135733.jpg\" alt=\"20130705-135733.jpg\" class=\"alignnone size-full\" /></a></p>\n<p>We played two games and B was beyond done. It took about an hour to complete the two games. Then we went into the &#8220;game room&#8221;. B doesn&#8217;t have the skills or interest to really play, so we saved our quarters but he had about another twenty minted of fun just clicking buttons and touching all if the games with their blinking lights. </p>\n<p>We are potty training B now, so the bathroom is a really big deal when we go somewhere. When it was &#8220;time&#8221;, B was able to relieve himself with daddy in a clean bathroom, always a positive. No kiddy potty or step stool at the sink but, we still rated it high. There was also a changing table for the needs of tiny ones.</p>\n", "post_id": 25, "location": false, "date": "07-05-2013", "mentions": [], "extracted_features": {}}, {"tags": ["kids", "family tradition", "pumpkin carving", "preschoolers", "Halloween", "toddler"], "text": "<p>There are certain things you remember, big moments that, upon reflection were turning points in your life. Learning to tie your shoes, ride a bike, pour your own milk <em>and</em> using sharp objects to cut. Scissors were first, then butter knives, then real knives and now a pumpkin saw. You know you&#8217;ve arrived when you can be trusted with sharp objects.</p>\n<p>First, you&#8217;ve got to choose the right pumpkin. B had three that he had chosen in early October and have been lying in wait on our front porch deflecting squirrels daily just to get the chance to be chosen as his FIRST carved pumpkin, quite an honor! We opened the fancy pumpkin carving kit, examined our tools and decided on a template. For obvious reasons, we went with &#8220;beginner&#8221; level for the carving. </p>\n<p><a href=\"http://adventuresofadetroitfamily.files.wordpress.com/2013/10/20131029-215849.jpg\"><img src=\"https://adventuresofadetroitfamily.files.wordpress.com/2013/10/20131029-215849.jpg\" alt=\"20131029-215849.jpg\" class=\"alignnone size-full\" /></a><br />\nDaddy guiding B&#8217;s wee hand along the top cut.</p>\n<p><a href=\"http://adventuresofadetroitfamily.files.wordpress.com/2013/10/20131029-220131.jpg\"><img src=\"https://adventuresofadetroitfamily.files.wordpress.com/2013/10/20131029-220131.jpg\" alt=\"20131029-220131.jpg\" class=\"alignnone size-full\" /></a><br />\nOkay, so we didn&#8217;t totally surrender cutting this massive squash to our (almost) three year old. We&#8217;re not totally crazy, but B got the V.I.P knife talk and he definitely sawed that gourd.<br />\nHe did seem to enjoy the gutting part the most however.</p>\n<p><a href=\"http://adventuresofadetroitfamily.files.wordpress.com/2013/10/20131029-220419.jpg\"><img src=\"https://adventuresofadetroitfamily.files.wordpress.com/2013/10/20131029-220419.jpg\" alt=\"20131029-220419.jpg\" class=\"alignnone size-full\" /></a><br />\nHe cut, rolled and tapped his pumpkin head until the design was done. Then we set it out on the front porch with the others. I had purchased some &#8220;safety&#8221; battery operated flicker lights, much to B&#8217;s sadness. Knives were a lot for one day&#8230; be patient my son&#8230; one day we will teach you to command fire too. <em>You have much to learn little one.</em> For now, just smile at the camera so mommy can commemorate (sniff, sniffle) another milestone. </p>\n<p><a href=\"http://adventuresofadetroitfamily.files.wordpress.com/2013/10/20131029-220918.jpg\"><img src=\"https://adventuresofadetroitfamily.files.wordpress.com/2013/10/20131029-220918.jpg\" alt=\"20131029-220918.jpg\" class=\"alignnone size-full\" /></a></p>\n<p><strong><em>What are your favorite family traditions on Halloween?</strong><br />\n</em></p>\n", "post_id": 253, "location": false, "date": "10-30-2013", "mentions": [], "extracted_features": {}}, {"tags": ["hot chocolate", "kids", "Winter", "family", "easy recipe", "preschooler", "toddler", "children", "preschool"], "text": "<p>Thanks to <a href=\"http://www.100daysofrealfood.com\">www.100daysofrealfood.com</a> for posting this homemade hot cocoa recipe on their Facebook page. Tried it today and it was so yummy!! Plus I didn&#8217;t feel guilty about sharing it with my little guy!</p>\n<p><a href=\"http://adventuresofadetroitfamily.files.wordpress.com/2013/12/20131205-174351.jpg\"><img src=\"https://adventuresofadetroitfamily.files.wordpress.com/2013/12/20131205-174351.jpg\" alt=\"20131205-174351.jpg\" class=\"alignnone size-full\" /></a></p>\n<p>A few moments of warming the milk while stirring it on the stovetop and voila!</p>\n<p><a href=\"http://adventuresofadetroitfamily.files.wordpress.com/2013/12/20131205-174515.jpg\"><img src=\"https://adventuresofadetroitfamily.files.wordpress.com/2013/12/20131205-174515.jpg\" alt=\"20131205-174515.jpg\" class=\"alignnone size-full\" /></a></p>\n<p>There wasn&#8217;t a drop left! Just a teeny tiny puff of foamy goodness to spoon out. </p>\n<p><a href=\"http://adventuresofadetroitfamily.files.wordpress.com/2013/12/20131205-174642.jpg\"><img src=\"https://adventuresofadetroitfamily.files.wordpress.com/2013/12/20131205-174642.jpg\" alt=\"20131205-174642.jpg\" class=\"alignnone size-full\" /></a></p>\n", "post_id": 258, "location": false, "date": "12-05-2013", "mentions": [], "extracted_features": {}}, {"tags": ["kids", "detroit", "Santa", "preschooler", "toddler", "children", "preschool", "Henry Ford"], "text": "<p>Writing a letter to Santa has an entirely different meaning today than ever before. As a child it was a letter of hope and optimism. As a parent I am holding my breath, smiling through my teeth and hoping my child writes down what we bought him because if not, we&#8217;re screwed! <em>Luckily, he did ask for the big gift we bought- whew!</em></p>\n<p>Visiting <a href=\"http://www.hfmgv.org/events/holidaysMuseum.aspx\">The Henry Ford Museum</a> is our family tradition to write our letters and visit with Santa. It&#8217;s also a fantastic place to explore for my little guy. Drive a huge combine machine, change the tires or muffler on a car in a Texaco shop or build Legos to your hearts content, there are hours of cold weather fun to be had! Older kids (a.k.a parents) can fold paper into a model airplane and launch it in a &#8220;test area&#8221; or power a light bulb with a crank.  Literally hundreds of planes, trains and automobiles to touch, sit in, climb on and discover. </p>\n<p><a href=\"http://adventuresofadetroitfamily.files.wordpress.com/2013/12/20131206-072157.jpg\"><img src=\"https://adventuresofadetroitfamily.files.wordpress.com/2013/12/20131206-072157.jpg\" alt=\"20131206-072157.jpg\" class=\"alignnone size-full\" /></a><br />\nStep 1: Write a letter to Santa</p>\n<p><a href=\"http://adventuresofadetroitfamily.files.wordpress.com/2013/12/20131206-072316.jpg\"><img src=\"https://adventuresofadetroitfamily.files.wordpress.com/2013/12/20131206-072316.jpg\" alt=\"20131206-072316.jpg\" class=\"alignnone size-full\" /></a><br />\nStep 2: Check it twice </p>\n<p><a href=\"http://adventuresofadetroitfamily.files.wordpress.com/2013/12/20131206-072409.jpg\"><img src=\"https://adventuresofadetroitfamily.files.wordpress.com/2013/12/20131206-072409.jpg\" alt=\"20131206-072409.jpg\" class=\"alignnone size-full\" /></a><br />\nStep 3: Send it to the North Pole</p>\n<p>Seems simple.</p>\n<p>I&#8217;m glad it worked out this year. I still feel like just a little bit of Christmas magic was in play. Tis&#8217; the season!</p>\n<p><strong><em>What Christmas traditions do you have in your family</em>?</strong></p>\n", "post_id": 263, "location": false, "date": "12-06-2013", "mentions": [], "extracted_features": {}}, {"tags": ["kids", "snow", "sensory", "indoor activity", "preschooler", "toddler", "Christmas"], "text": "<p>It&#8217;s snowing!!!! Big beautiful fluffy flakes, look look!!! </p>\n<p>5 minutes later</p>\n<p>It stopped. Nooooo <span class='wp-smiley wp-emoji wp-emoji-sad' title=':('>:(</span></p>\n<p>We live in Michigan, so there is a certain amount of snow expected. However, for the past three winters we haven&#8217;t even gotten enough to build a snowman in Wayne County. We plan on heading to some snow hills this winter but my child is ever-increasingly interested in playing in the snow (I can&#8217;t blame him).</p>\n<p>So, like all good parents, when presented with a challenge, I turn to the Internet <span class='wp-smiley wp-emoji wp-emoji-smile' title=':)'>:)</span> Here&#8217;s what I found and what we did:</p>\n<p>Make your own snow! Just mix equal parts baking soda with shaving cream. </p>\n<p><a href=\"http://adventuresofadetroitfamily.files.wordpress.com/2013/12/20131207-140930.jpg\"><img src=\"https://adventuresofadetroitfamily.files.wordpress.com/2013/12/20131207-140930.jpg\" alt=\"20131207-140930.jpg\" class=\"alignnone size-full\" /></a><br />\nI added a few drops of peppermint essential oil and blue food coloring. Voila!</p>\n<p><a href=\"http://adventuresofadetroitfamily.files.wordpress.com/2013/12/20131207-141144.jpg\"><img src=\"https://adventuresofadetroitfamily.files.wordpress.com/2013/12/20131207-141144.jpg\" alt=\"20131207-141144.jpg\" class=\"alignnone size-full\" /></a></p>\n<p>It was bath time so I let B mix and explore while in an &#8220;arctic adventure&#8221; bath. The mixture is surprisingly cool and when mixed fully it really does feel like snow! </p>\n<p>We will definitely be exploring this again. Next time I plan to do it in the kitchen sink and then add a few glugs of vinegar to get an &#8220;exploding&#8221; action. </p>\n<p>Simple, easy, fun and really cool, my kind of activity!</p>\n<p><strong><em>What activities have you been doing with your little ones this winter</em>?</strong></p>\n", "post_id": 267, "location": false, "date": "12-07-2013", "mentions": [], "extracted_features": {}}, {"tags": ["kids", "Ice skating", "detroit", "Santa", "preschooler", "Christmas"], "text": "<p><a href=\"http://www.campusmartiuspark.org/\">Campus Martius</a> is right in the center of the hub of downtown Detroit. In winter the ice skating rink, majestic tree and small business mall (complete with beer tent parents) is a destination to build memories and traditions. During the holiday season when my far-stretched family comes to visit we always make it a point to spend some time there. </p>\n<p><a href=\"http://adventuresofadetroitfamily.files.wordpress.com/2013/12/20131207-143543.jpg\"><img src=\"https://adventuresofadetroitfamily.files.wordpress.com/2013/12/20131207-143543.jpg\" alt=\"20131207-143543.jpg\" class=\"alignnone size-full\" /></a></p>\n<p>We strolled around the rink, admiring the agile and the fallen in their glory and their agony respectively. The lights of the small business mall beckoned and we purchased some Detroit memorabilia. My sister a shirt, for mom a mug, a sweater and a set of coasters. The husbands marveled at the biker gear and beer accessories. I nibbled some Germack nut mix and coveted a Warhol- esque canvas that could be made from your own photo. <em>Something for everyone! </em>Then we all agreed the beer tent was a good idea. </p>\n<p>Live music is always enjoyable to me, but it&#8217;s especially fun when you can watch your three year old jam out like nobody&#8217;s watching. I swear, we really should&#8217;ve thrown a tip jar down. He was entertainment for a while until his interest waned and we moved on.</p>\n<p>Inside of the Compuware building Santa himself is available from noon-6pm for unlimited photos with your own camera for FREE! No one else was there so we had a blast. B was very apprehensive initially but warmed up when we all got in the picture together. </p>\n<p><a href=\"http://adventuresofadetroitfamily.files.wordpress.com/2013/12/20131207-145356.jpg\"><img src=\"https://adventuresofadetroitfamily.files.wordpress.com/2013/12/20131207-145356.jpg\" alt=\"20131207-145356.jpg\" class=\"alignnone size-full\" /></a><br />\nThe massive waterfall inside the lobby a few feet away allowed B to be amazed long enough for everyone to enjoy a hot cocoa from Tim Horton&#8217;s. The ATM helped us get more loot to head back out again and enjoy more winter traditions. Along our exploration we stumbled upon a sidewalk chess board in front of the DTE Energy building.</p>\n<p><a href=\"http://adventuresofadetroitfamily.files.wordpress.com/2013/12/20131207-150120.jpg\"><img src=\"https://adventuresofadetroitfamily.files.wordpress.com/2013/12/20131207-150120.jpg\" alt=\"20131207-150120.jpg\" class=\"alignnone size-full\" /></a><br />\n<strong><em>What fun family memories are you creating with your family this season?</em></strong></p>\n", "post_id": 272, "location": false, "date": "12-07-2013", "mentions": [], "extracted_features": {}}, {"tags": ["summer", "kids", "family", "Tigers", "Comerica", "detroit", "Comerica Park", "baseball", "Detroit Tigers Baseball"], "text": "<div id=\"attachment_275\" style=\"width: 310px\" class=\"wp-caption alignnone\"><a href=\"https://adventuresofadetroitfamily.files.wordpress.com/2014/06/img_5022.jpg\"><img src=\"https://adventuresofadetroitfamily.files.wordpress.com/2014/06/img_5022.jpg?w=300&#038;h=225\" alt=\"Relaxing with a twisty straw at our seats on the Pepsi Porch\" width=\"300\" height=\"225\" class=\"size-medium wp-image-275\" /></a><p class=\"wp-caption-text\">Relaxing with a twisty straw at our seats on the Pepsi Porch</p></div>\n<p>The sun was hot, the Tigers were&#8230;lukewarm. We cheered for our home team, jeered the opposition and ordered food and drink from our seats, it was a great time! For under $50 per seat, I think these seats were a score. The view was awesome. The little one who cannot sit still for long had room to stretch, stand up, swivel his chair all the way around, rock back and forth and we all got to enjoy the game. Next time you consider buying tickets for a Tigers game, ask for the Pepsi Porch, you will not regret it.</p>\n<p>I am not a die hard fan of baseball. For me, to go to a game it has to be an experience. I want to sip something new, taste something new and not have to wait in line for a stinky bathroom. That is asking a lot for most stadiums, unless you pay for a suite. I heard from a friend the Pepsi Porch was a great place to go, especially with kids. I took a chance for a &#8220;special occasion&#8221; and went above our usual bleacher seat purchase. I sipped locally brewed beer, munched on strawberry-marshmallow kabobs and shared cotton candy with my two favorite people. The crowd-free restrooms were less than 50 feet away from the seats and were spic and span. There are comfy couches all around and a full service bar, plus the &#8220;wave&#8221; was a BIG DEAL in our section. </p>\n<p>Comerica Park is great when it comes to family entertainment and customer service. We rode the all Tiger carousel and the Baseball Ferris Wheel with ease (just $2 per rider). A quick visit to the Customer Service center (nicely air conditioned) for our birthday boy and we walked out with a certificate, rubber Detroit Tigers bracelet, baseball and mini bat. Too bad the birthday boy was turning 43 and the customer service representative gave it all to our 3 year old, but he should&#8217;ve known better, ha ha! I love that he&#8217;s a kid at heart!</p>\n<p>Let&#8217;s Go Tigers!</p>\n", "post_id": 274, "location": false, "date": "06-25-2014", "mentions": [], "extracted_features": {}}, {"tags": [], "text": "<p>Dandelions, red-tailed hawks, pregnant bumble bees and more! We learned about vegetation, creatures big and small, winged and scaled&#8230; all during our two hour &#8220;riverside ramble&#8221; at Lake Erie Metro Park. Although this guided hike was on a paved path and only took us about a half mile, it was FULL of fun and really interesting facts about the wildlife that literally is in our backyard. My 3 year old may have been more interested in the trail mix (because it had chocolate nibs in it this time) but he gabbed endlessly to all those who would listen about how you can EAT dandelions, how Wood ducks LIVE in trees and how bees burrow in the GROUND!!</p>\n<p>We are not planning our next family vacation around a hike on the Appalachian Trail but this was a great hiking introduction to our preschooler. He loves to run, throw rocks (not AT anyone) and dig with sticks. My responsibility, I feel, is to ALSO impart on him the love and respect our family has for the natural world. It&#8217;s easy to get caught up in a concrete jungle full of man-made things but Nature is the original architect and it&#8217;s pretty awe-inspiring!</p>\n<p>We&#8217;ve experienced newborn babies in Spring, Maple syrup tapping in the last glints of winter as well as hiking and campfires all summer. The parks open at dawn and close at dusk. Admission is per car and is $5.00 per day or you can buy a yearly pass for $25.00 and get into all of the metro parks year round. This is NOT the sticker you can buy for an extra $10 when you renew your license plate every year, those are for State Parks like Belle Isle. Bathroom facilities are clean and plentiful. There are traditional playscapes, paved hiking trails and boat launches. There is also the amazing feeling of &#8220;getting lost&#8221; within a completely safe and comfortable environment. So whether you want to check out the wave pool or run on a dirt trail to train for your next marathon, these parks are amazing!</p>\n<p>Setting up a hike with an interpreter at the Lake Erie Metro Park was simple and very inexpensive. The main website <a title=\"Metro Parks\" href=\"http://www.metroparks.com/events\">www.metroparks.com/events</a> has a complete list of ALL of the activities coming up at a park near you.</p>\n<p> </p>\n<p> </p>\n\n\t\t<style type='text/css'>\n\t\t\t#gallery-277-1 {\n\t\t\t\tmargin: auto;\n\t\t\t}\n\t\t\t#gallery-277-1 .gallery-item {\n\t\t\t\tfloat: left;\n\t\t\t\tmargin-top: 10px;\n\t\t\t\ttext-align: center;\n\t\t\t\twidth: 33%;\n\t\t\t}\n\t\t\t#gallery-277-1 img {\n\t\t\t\tborder: 2px solid #cfcfcf;\n\t\t\t}\n\t\t\t#gallery-277-1 .gallery-caption {\n\t\t\t\tmargin-left: 0;\n\t\t\t}\n\t\t\t/* see gallery_shortcode() in wp-includes/media.php */\n\t\t</style>\n\t\t<div data-carousel-extra='{\"blog_id\":54802779,\"permalink\":\"http:\\/\\/adventuresofadetroitfamily.com\\/2014\\/07\\/04\\/hiking-with-a-preschooler\\/\",\"likes_blog_id\":54802779}' id='gallery-277-1' class='gallery galleryid-277 gallery-columns-3 gallery-size-thumbnail'><dl class='gallery-item'>\n\t\t\t<dt class='gallery-icon landscape'>\n\t\t\t\t<a href='http://adventuresofadetroitfamily.com/2014/07/04/hiking-with-a-preschooler/img_4511/'><img width=\"150\" height=\"113\" src=\"https://adventuresofadetroitfamily.files.wordpress.com/2014/07/img_4511.jpg?w=150&#038;h=113\" class=\"attachment-thumbnail\" alt=\"IMG_4511\" data-attachment-id=\"278\" data-orig-file=\"https://adventuresofadetroitfamily.files.wordpress.com/2014/07/img_4511.jpg\" data-orig-size=\"3264,2448\" data-comments-opened=\"1\" data-image-meta=\"{&quot;aperture&quot;:&quot;2.4&quot;,&quot;credit&quot;:&quot;&quot;,&quot;camera&quot;:&quot;iPhone 4S&quot;,&quot;caption&quot;:&quot;&quot;,&quot;created_timestamp&quot;:&quot;1399822732&quot;,&quot;copyright&quot;:&quot;&quot;,&quot;focal_length&quot;:&quot;4.28&quot;,&quot;iso&quot;:&quot;50&quot;,&quot;shutter_speed&quot;:&quot;0.0012674271229404&quot;,&quot;title&quot;:&quot;&quot;}\" data-image-title=\"IMG_4511\" data-image-description=\"\" data-medium-file=\"https://adventuresofadetroitfamily.files.wordpress.com/2014/07/img_4511.jpg?w=300\" data-large-file=\"https://adventuresofadetroitfamily.files.wordpress.com/2014/07/img_4511.jpg?w=1024\" /></a>\n\t\t\t</dt></dl>\n\t\t\t<br style='clear: both' />\n\t\t</div>\n\n", "post_id": 277, "location": false, "date": "07-04-2014", "mentions": [], "extracted_features": {}}, {"tags": ["hike", "play", "bike", "family", "preschooler"], "text": "<p><a href=\"https://adventuresofadetroitfamily.files.wordpress.com/2014/08/20140809-155515.jpg\"><img src=\"https://adventuresofadetroitfamily.files.wordpress.com/2014/08/20140809-155515.jpg\" alt=\"20140809-155515.jpg\" class=\"alignnone size-full\" /></a></p>\n<p>Lake Erie Metro Park is AWESOME! We arrived at 10:00am on a hot August Saturday morning for a wonderful adventure. We started with a guided tour ($3/per person, although most are free) that began at their Nature Center and went along the Cherry Island Trail over bridges and through the woods along the lakeshore. </p>\n<p>We were enchanted by a mother Monarch butterfly laying her precious eggs on the leaves of the milkweed plant. As we walked along the man-made dike between an estuary and Lake Erie it was as if we had been transported back in time. The lotus and lily flower fields, in full bloom this time of year, were wafting their delicate scent across the breeze in the most exotic way. It&#8217;s hard to believe we are less than 30 miles from DETROIT!</p>\n<p><a href=\"https://adventuresofadetroitfamily.files.wordpress.com/2014/08/20140809-160816.jpg\"><img src=\"https://adventuresofadetroitfamily.files.wordpress.com/2014/08/20140809-160816.jpg\" alt=\"20140809-160816.jpg\" class=\"alignnone size-full\" /></a></p>\n<p>This 1400 acre wood also has an amazing bike/ hike/ jog trail that will take you from the Nature Center to the wave pool, along the lakeshore, over marshland, past ponds and the deep woods. My preschooler wasn&#8217;t about to let a perfectly good play ground distract him from his botanical exploration&#8230; Ha ha! The tire swing wins out!!</p>\n<p><a href=\"https://adventuresofadetroitfamily.files.wordpress.com/2014/08/20140809-161157.jpg\"><img src=\"https://adventuresofadetroitfamily.files.wordpress.com/2014/08/20140809-161157.jpg\" alt=\"20140809-161157.jpg\" class=\"alignnone size-full\" /></a></p>\n<p>They have river cruises to the lighthouse, kayaking, fishing, beaches and more and that&#8217;s just summertime fun. We have been lucky enough to have adventures there in every season. Please see their events calendar at <a href=\"http://www.metroparks.com\" rel=\"nofollow\">http://www.metroparks.com</a> and have your own Metro Detroit adventure!</p>\n<p><em>*as always, these are my opinions and experiences. I was in no way paid or compensated to write this about the park.</em></p>\n", "post_id": 282, "location": false, "date": "08-09-2014", "mentions": [], "extracted_features": {}}, {"tags": ["coffee", "Great Lakes coffee", "organic", "iced coffee", "detroit"], "text": "<p>I love iced coffee. I have become particularly focused on (<em>some would say obsessed)</em> creating the perfect iced coffee brew. </p>\n<p><strong>Here&#8217;s my version of perfection:</strong></p>\n<p>Cut a 5X5&#8243; square of cheesecloth</p>\n<p>Dump 1 cup of your favorite ground coffee into the center</p>\n<p><a href=\"https://adventuresofadetroitfamily.files.wordpress.com/2014/08/20140810-114952.jpg\"><img src=\"https://adventuresofadetroitfamily.files.wordpress.com/2014/08/20140810-114952.jpg\" alt=\"20140810-114952.jpg\" class=\"alignnone size-full\" /></a></p>\n<p>Bring the corners of the cheesecloth together, twist and tie tightly with cotton thread/twine.</p>\n<p><a href=\"https://adventuresofadetroitfamily.files.wordpress.com/2014/08/20140810-115125.jpg\"><img src=\"https://adventuresofadetroitfamily.files.wordpress.com/2014/08/20140810-115125.jpg\" alt=\"20140810-115125.jpg\" class=\"alignnone size-full\" /></a><br />\nFill a large glass container with 5-7 cups of cold purified water.</p>\n<p><a href=\"https://adventuresofadetroitfamily.files.wordpress.com/2014/08/20140810-115244.jpg\"><img src=\"https://adventuresofadetroitfamily.files.wordpress.com/2014/08/20140810-115244.jpg\" alt=\"20140810-115244.jpg\" class=\"alignnone size-full\" /></a></p>\n<p>Place the cheesecloth pouch into the water. Let sit out on your counter or in your refrigerator overnight or for at least 8 hours. </p>\n<p><a href=\"https://adventuresofadetroitfamily.files.wordpress.com/2014/08/20140810-115435.jpg\"><img src=\"https://adventuresofadetroitfamily.files.wordpress.com/2014/08/20140810-115435.jpg\" alt=\"20140810-115435.jpg\" class=\"alignnone size-full\" /></a></p>\n<p><em>Voila! </em></p>\n<p>Keep in your refrigerator with the black gold for up to a month. Enjoy ice, cream, sugar or just plain, like me, for up to a month.</p>\n<p><em>If you do not love strong coffee, use less coffee to water in your brew and take the cheesecloth out after the first &#8220;overnight&#8221; brew. </em></p>\n<p>Cheers!</p>\n", "post_id": 288, "location": false, "date": "08-10-2014", "mentions": [], "extracted_features": {}}, {"tags": ["u-pick", "weekend fun", "apples", "family", "kids"], "text": "<p><a href=\"https://adventuresofadetroitfamily.files.wordpress.com/2014/09/20140831-224301.jpg\"><img src=\"https://adventuresofadetroitfamily.files.wordpress.com/2014/09/20140831-224301.jpg\" alt=\"20140831-224301.jpg\" class=\"alignnone size-full\" /></a></p>\n<p>It was a beautiful, sunny, somewhat muggy August morning. We decide to go pick some delicious peaches to make the perfect cobbler. Our last grasp at summer &#8230; CRUSHED. At <a href=\"http://www.erieorchards.com\">Erie Orchards</a> the winter hit so hard not enough peaches came in for u-pick&#8230; buuuuut, some Pink Lady and Macintosh apples were available. </p>\n<p>We have on our sun hats, sunscreen and we are sweating&#8230; Picking apples&#8230; It was surreal. That didn&#8217;t stop us from picking a BUSHEL!! </p>\n<p><a href=\"https://adventuresofadetroitfamily.files.wordpress.com/2014/09/20140831-225341.jpg\"><img src=\"https://adventuresofadetroitfamily.files.wordpress.com/2014/09/20140831-225341.jpg\" alt=\"20140831-225341.jpg\" class=\"alignnone size-full\" /></a></p>\n<p>We filled four HUGE bowls and placed them in the sunniest window in the house because they were a <em>little</em> green inside AND out!</p>\n<p>Apple pie will just have to do! Plus, some apple cobbler, apple sauce, cubed apples for oatmeal, dehydrated apple slices&#8230; </p>\n<p><em>What&#8217;s YOUR favorite apple recipe?</em><strong></strong></p>\n", "post_id": 292, "location": false, "date": "09-01-2014", "mentions": [], "extracted_features": {}}, {"tags": ["Campus Martius", "family fun", "kids", "beach", "family"], "text": "<p><a href=\"https://adventuresofadetroitfamily.files.wordpress.com/2014/09/20140904-192208.jpg\"><img src=\"https://adventuresofadetroitfamily.files.wordpress.com/2014/09/20140904-192208.jpg\" alt=\"20140904-192208.jpg\" class=\"alignnone size-full\" /></a></p>\n<p>&#8221; Let&#8217;s go to the BEACH!&#8221; is my B&#8217;s number ONE request after school every day. Campus Martius has made a beautiful beach to run, jump and play in. With both sun and shaded seating, a water fountain to wash your feet in plus a HUGE fountain to gaze at, your kids will be happy you came. Bring their sand toys if you really want to knock their socks off! </p>\n<p>The Compuware building is just a few feet away with clean public bathrooms and benches to rest for a moment in the air conditioning. The indoor fountain is amazing to watch and will give your kids a giggle. Street parking is readily available and lots of little eateries (mostly well-known national chains) are  all within a hundred yards.</p>\n<p>The &#8220;beach&#8221; has a bar and patio geared toward adults too with a full service bar where you can enjoy a beer and stick YOUR toes in the sand. On the flip side of the fountain is a beautiful grassy area with tons of bistro seating and a gelato stand. The stage area has programs listed on the <a href=\"http://www.campusmartiuspark.org/\">Campus Martius</a> site year round. </p>\n<p><a href=\"https://adventuresofadetroitfamily.files.wordpress.com/2014/09/20140904-193454.jpg\"><img src=\"https://adventuresofadetroitfamily.files.wordpress.com/2014/09/20140904-193454.jpg\" alt=\"20140904-193454.jpg\" class=\"alignnone size-full\" /></a></p>\n<p>What&#8217;s your favorite time of year to visit Campus Martius?</p>\n", "post_id": 296, "location": false, "date": "09-04-2014", "mentions": [], "extracted_features": {}}, {"tags": ["detroit family", "cruising", "family", "detroit style", "family adventure", "detroit", "peaceful parent", "family events", "natural parent"], "text": "<p><img src=\"https://adventuresofadetroitfamily.files.wordpress.com/2013/07/img_8655.jpg\" class=\"size-full\" alt=\"Cruisin'\" /></p>\n<p>Ahhh, there&#8217;s nothing better than the feeling of the wind in your hair when the rubber meets the road, especially in these cool trikes!</p>\n<p>Elizabeth Park, Trenton, MI</p>\n<p>closest main corner: West Rd. &amp; Jefferson</p>\n<p>We took our bikes and trikes for a lovely loop around the park (approx. 1/2 mile) then played for over an hour on their handicap accessible play structure. B and his friends (ages 2-4) were able to safely manage the climbing and sliding leaving the adults to enjoy the day on the nearby shaded picnic tables. Delightful!\n<p>Restroom: Inside the main new brick structure at the crest of the loop. Clean with baby changing table.\n<p>Extras: Beautiful water views, lots of photo opportunities. Mature shade trees. Mulched hiking path through the center with a woodsy feel.\n<p>Funsies:<br />\n*bring food for the ducks and geese<br />\n*skateboards welcome inside the skate park\n<p><a href=\"http://adventuresofadetroitfamily.files.wordpress.com/2013/07/20130703-204642.jpg\"><img src=\"https://adventuresofadetroitfamily.files.wordpress.com/2013/07/20130703-204642.jpg\" alt=\"20130703-204642.jpg\" class=\"alignnone size-full\" /></a></p>\n", "post_id": 3, "location": false, "date": "07-03-2013", "mentions": [], "extracted_features": {}}, {"tags": [], "text": "<p><a href='http://marshamc1203.wordpress.com/2013/07/05/pd9-township-jazz-project/'>PD9: Township Jazz Project</a>.</p>\n", "post_id": 34, "location": false, "date": "07-07-2013", "mentions": [], "extracted_features": {}}, {"tags": [], "text": "<p><a href='http://marshamc1203.wordpress.com/2013/07/04/and-the-heavy-fireworks-start/'>And the Heavy Fireworks Start&#8230;..</a>.</p>\n", "post_id": 36, "location": false, "date": "07-07-2013", "mentions": [], "extracted_features": {}}, {"tags": ["burgers", "Moo cluck moo", "milkshakes", "dining", "family fun", "detroit", "Dearborn", "restaurants"], "text": "<p><a href=\"http://adventuresofadetroitfamily.files.wordpress.com/2013/07/20130708-010002.jpg\"><img src=\"https://adventuresofadetroitfamily.files.wordpress.com/2013/07/20130708-010002.jpg\" alt=\"20130708-010002.jpg\" class=\"alignnone size-full\" /></a></p>\n<p>\nMoo Cluck Moo- restaurant review</p>\n<p><a href=\"http://www.moocluckmoo.com/\" rel=\"nofollow\">http://www.moocluckmoo.com/</a></p>\n<p>Cross Streets: Telegraph Rd. &amp; Joy Rd.</p>\n<p>Bathroom: NONE (apparently when you are a &#8220;carry out only&#8221; establishment you are not required to offer any facilities to your customers.)</p>\n<p>Food: YUM to the capital Y U and M. We used our groupon for two &#8220;all american BBQ&#8221; burgers and added regular fries (although they had many options) and a salted caramel chocolate milk shake. An amazing pickled cole slaw topped my BBQ burger that blew my mind, it was SO good!</p>\n<p>Seating: A few bar height two tops inside and some rickety two tops outside on the blacktop within feet of cars whizzing by at 60mph. We attempted to dine outside as the inside was jammed but found it too challenging to balance a toddler on one knee and eat. Plus, you could barely hear each other talk with the whooshing of traffic. </p>\n<p>Staff: The employees were amazing. I would be happy if any of them were my neighbor or lab partner. </p>\n<p>To solve the &#8220;family dining&#8221; issue we drove a few blocks off Telegraph to a playground attached to a school. It was in a cute brick home lined neighborhood and we attempted to eat &#8220;picnic style&#8221;. However, as soon as B saw the playscape, he was off and running, big daddy in hot pursuit!</p>\n<p><a href=\"http://adventuresofadetroitfamily.files.wordpress.com/2013/07/20130708-020527.jpg\"><img src=\"https://adventuresofadetroitfamily.files.wordpress.com/2013/07/20130708-020527.jpg\" alt=\"20130708-020527.jpg\" class=\"alignnone size-full\" /></a></p>\n<p><a href=\"http://adventuresofadetroitfamily.files.wordpress.com/2013/07/20130708-021143.jpg\"><img src=\"https://adventuresofadetroitfamily.files.wordpress.com/2013/07/20130708-021143.jpg\" alt=\"20130708-021143.jpg\" class=\"alignnone size-full\" /></a>\n<p><a href=\"http://adventuresofadetroitfamily.files.wordpress.com/2013/07/20130708-021157.jpg\"><img src=\"https://adventuresofadetroitfamily.files.wordpress.com/2013/07/20130708-021157.jpg\" alt=\"20130708-021157.jpg\" class=\"alignnone size-full\" /></a>\n<p>\nThis is a picture of the school parking lot. There was one other family there that looked like they had the same meal plan we did. </p>\n<p><a href=\"http://adventuresofadetroitfamily.files.wordpress.com/2013/07/20130708-021520.jpg\"><img src=\"https://adventuresofadetroitfamily.files.wordpress.com/2013/07/20130708-021520.jpg\" alt=\"20130708-021520.jpg\" class=\"alignnone size-full\" /></a></p>\n<p>\nOverall, I felt good about giving B a &#8220;fast food&#8221; burger from here. I was just surprised about the &#8220;carry out only&#8221; scenario. Now that I am prepared, I can go with the right attitude to fully enjoy this great food served up by an uber friendly staff.</p>\n", "post_id": 44, "location": false, "date": "07-08-2013", "mentions": [], "extracted_features": {}}, {"tags": ["book review", "Book", "inside play", "sensory bin", "construction", "quiet play", "diggers", "toddler"], "text": "<p>They say there are only two seasons in Michigan: Winter and Construction. </p>\n<p>That&#8217;s fine with us!</p>\n<p>B is totally fascinated with construction vehicles. If we see a construction site, he absolutely must stop and watch. He loves how big and noisy they are. He loves how they can rip an entire tree from the ground by its&#8217; roots or crunch concrete like it were a piece of tissue paper.</p>\n<p>This is my own compilation of B tested and approved books with a sensory bin that has been a total hit with every toddler (and most adults) that have come in contact with it. </p>\n<p>HOW TO MAKE THE BIN:</p>\n<p>I found an &#8220;under the bed&#8221; bin on clearance and stowed it in the laundry room until all of my bin materials could get pulled together. I used:</p>\n<p>1. An old 5lb bag of flavored coffee beans that have been in my freezer for at least three years.</p>\n<p>2. White beans that were on the bottom shelf and on clearance at Kroger. (You could also try the bulk aisle at Meijer).</p>\n<p>3. A 5-pack of CAT construction vehicles from the toy aisle at Target for $6.00, totally worth every penny!</p>\n<p>4. Some old fake moss rocks I had in a bowl on our coffee table before B could walk. They had been &#8220;retired&#8221; to the bookshelf collecting dust for over a year. </p>\n<p>5. We colored a paper plate blue, cut it out (together) and taped it to the bottom at one end of the bin for a &#8220;lake&#8221;.</p>\n<p>DONE. </p>\n<p>Easy and cheap for ALL of the ten minute intervals it has given me. </p>\n<p>What works in your home to get those &#8220;ten minutes&#8221;?</p>\n<p><a href=\"http://adventuresofadetroitfamily.files.wordpress.com/2013/07/20130708-130043.jpg\"><img src=\"https://adventuresofadetroitfamily.files.wordpress.com/2013/07/20130708-130043.jpg\" alt=\"20130708-130043.jpg\" class=\"alignnone size-full\" /></a></p>\n<p><a href=\"http://adventuresofadetroitfamily.files.wordpress.com/2013/07/20130708-130109.jpg\"><img src=\"https://adventuresofadetroitfamily.files.wordpress.com/2013/07/20130708-130109.jpg\" alt=\"20130708-130109.jpg\" class=\"alignnone size-full\" /></a></p>\n<p><a href=\"http://adventuresofadetroitfamily.files.wordpress.com/2013/07/20130708-130316.jpg\"><img src=\"https://adventuresofadetroitfamily.files.wordpress.com/2013/07/20130708-130316.jpg\" alt=\"20130708-130316.jpg\" class=\"alignnone size-full\" /></a></p>\n<p><a href=\"http://adventuresofadetroitfamily.files.wordpress.com/2013/07/20130708-130624.jpg\"><img src=\"https://adventuresofadetroitfamily.files.wordpress.com/2013/07/20130708-130624.jpg\" alt=\"20130708-130624.jpg\" class=\"alignnone size-full\" /></a></p>\n<p><a href=\"http://adventuresofadetroitfamily.files.wordpress.com/2013/07/20130708-131603.jpg\"><img src=\"https://adventuresofadetroitfamily.files.wordpress.com/2013/07/20130708-131603.jpg\" alt=\"20130708-131603.jpg\" class=\"alignnone size-full\" /></a></p>\n<p>What are your toddlers favorite books?</p>\n", "post_id": 51, "location": false, "date": "07-08-2013", "mentions": [], "extracted_features": {}}, {"tags": [], "text": "<div class=\"wpcom-reblog-snapshot\"><div class=\"reblogger-note\"><p class=\"reblogger-headline\"><img alt='' src='https://0.gravatar.com/avatar/384b769726f6dc339fa4bffd8d5c3dae?s=32&#038;d=identicon&#038;r=G' class='avatar avatar-32' height='32' width='32' /><a href=\"http://adventuresofadetroitfamily.com/author/adventuresofadetroitfamily/\">DetroitFamilyFun</a>:</p><div class='reblogger-note-content'><blockquote><p>Absolutely worth your time to watch this short film. Phenomenal content, top of the line cinematography and featuring Detroiters being awesome!</p>\n</blockquote></div></div><div class=\"reblog-post\"><p class=\"reblog-from\"><img alt='' src='https://0.gravatar.com/avatar/f02353baea76b5cf9bcf88b68c70575c?s=48&#038;d=identicon&#038;r=G' class='avatar avatar-48' height='48' width='48' />Originally posted on <a href=\"http://gwopmagazine.com/2013/07/08/a-girls-guide-to-detroit/\">GWOP MAGAZINE</a>:</p><div class=\"reblogged-content\">\n<div class=\"embed-vimeo\" style=\"text-align:center;\"><iframe src=\"https://player.vimeo.com/video/67615399\" width=\"400\" height=\"300\" frameborder=\"0\" webkitallowfullscreen mozallowfullscreen allowfullscreen></iframe></div>\n\n\n<p><strong>Detroit</strong> is a place that attracts a certain type of individual. Someone that’s both tough and independent.</p>\n\n<p>That’s especially true for the women who have chosen to stake their claim in one of the nation’s most complicated cities. Fearless, talented, and ambitious, these women are shaping Detroit’s future.</p>\n\n<p><strong>EXECUTIVE CREATIVE DIRECTOR:</strong><br>\nToby Barlow</p>\n\n<p><strong>PRODUCED BY</strong>:<br>\n4exit4</p>\n\n<p><strong>DIRECTED BY:</strong><br>\nAmanda LeClaire &amp; Andrew Miller</p>\n\n<p><a href=\"https://vimeo.com/67615399#at=0\">source</a></p>\n</div><p class=\"reblog-source\"><a href=\"http://gwopmagazine.com/2013/07/08/a-girls-guide-to-detroit/\">View original</a></p></div></div>", "post_id": 53, "location": false, "date": "07-09-2013", "mentions": [], "extracted_features": {}}, {"tags": ["toddler yoga", "yoga", "Mommy &amp; me", "baby yoga", "mommy &amp; me yoga"], "text": "<p>I love yoga. Since having B, my practice has severely diminished. However, recently a new class has become available in the Dearborn/downriver area that I love. I just had to shout it from the rooftops! </p>\n<p></em><a href=\"http://rowantreeyoga.com\" rel=\"nofollow\">http://rowantreeyoga.com</a></p>\n<p>(The website didn&#8217;t have the new classes listed, so I cut and pasted the July classes from the newsletter below)</p>\n<p><a href=\"http://adventuresofadetroitfamily.files.wordpress.com/2013/07/20130709-223515.jpg\"><img src=\"https://adventuresofadetroitfamily.files.wordpress.com/2013/07/20130709-223515.jpg\" alt=\"20130709-223515.jpg\" class=\"alignnone size-full\" /></a></p>\n<p>DETAILS:</p>\n<p>1. It&#8217;s CASH ONLY and drop-in, so no commitments. </p>\n<p>2. They have mats and blankets for you to borrow. </p>\n<p>3. You don&#8217;t need special clothes because, if you&#8217;re like me, you&#8217;re probably already in yoga pants everyday, right?! </p>\n<p>It&#8217;s &#8221; mom &amp; tot&#8221; so, if your kid is like mine and feels the need to run, skip, yelp or fart, it&#8217;s okay, you&#8217;re amongst those who understand! If you have two little ones, it&#8217;ll cost you $5 more, but don&#8217;t feel like you can&#8217;t attend because you can&#8217;t &#8220;control&#8221; both of them. This class is designed for little ones with even littler attention spans. No one expects your little ones to just stay on their mat. Mom gets a few poses in while junior may be trying to climb your tree pose or limbo under your down dog, that&#8217;s okaaaaay!!!! It&#8217;s still having a positive effect on your family, I promise. B takes the best naps when we go. </p>\n<p>Where have you done mommy &amp; me yoga with your little one?</p>\n", "post_id": 57, "location": false, "date": "07-10-2013", "mentions": [], "extracted_features": {}}, {"tags": ["toddler yoga", "books", "yoga"], "text": "<p>These are our favorite yoga books to read in the morning or afternoon. Whenever we can sneak in some &#8220;at-home&#8221; yoga. </p>\n<p>Little Yoga: A Toddler&#8217;s First Book of Yoga</p>\n<p><a href=\"http://amzn.com/0805078797\" rel=\"nofollow\">http://amzn.com/0805078797</a></p>\n<p>You Are a Lion! And Other Fun Yoga Poses</p>\n<p><a href=\"http://amzn.com/0399256024\" rel=\"nofollow\">http://amzn.com/0399256024</a></p>\n<p>What are your favorite yoga books or DVD&#8217;s to practice with your toddler?</p>\n<p><a href=\"http://adventuresofadetroitfamily.files.wordpress.com/2013/07/20130710-005749.jpg\"><img src=\"https://adventuresofadetroitfamily.files.wordpress.com/2013/07/20130710-005749.jpg\" alt=\"20130710-005749.jpg\" class=\"alignnone size-full\" /></a></p>\n", "post_id": 61, "location": false, "date": "07-10-2013", "mentions": [], "extracted_features": {}}, {"tags": ["zoo", "grocery store toddler", "shopping with toddler", "detroit", "errands with toddler", "toddler", "terrible two's"], "text": "<p><a href=\"http://adventuresofadetroitfamily.files.wordpress.com/2013/07/20130711-013854.jpg\"><img src=\"https://adventuresofadetroitfamily.files.wordpress.com/2013/07/20130711-013854.jpg\" alt=\"20130711-013854.jpg\" class=\"alignnone size-full\" /></a></p>\n<p>A quick morning errand turned into an education for mom &amp; tot. </p>\n<p>Visiting the new Trader Joe&#8217;s on Telegraph Rd. and Maple (15 Mile Rd.) gave B the chance to explore hands- on fruits, vegetables, dairy and grains from around the globe. Sipping coffee from a just-his-size sample cup (what, your toddler doesn&#8217;t like coffee?) and pushing his cart, he was allowed to be the &#8220;big boy&#8221; that he so fiercely proclaims to be. We talked about colors, letters, shapes, smells and textures all while trying to watch our manners (no running into the ankles of other patrons with your cart). B showed me and everyone at the store he was more than worthy of that free organic lollipop the cashier offered him. </p>\n<p>Zoo, schmoo, how can watching a seemingly lifeless lioness (no matter how close that new glass enclosure can get you) compare to cool air conditioned independence??</p>\n<p>Thank you Trader Joe&#8217;s, see you next week!</p>\n", "post_id": 64, "location": false, "date": "07-11-2013", "mentions": [], "extracted_features": {}}, {"tags": ["movie theater", "toddler", "first movie experience", "mother-son day", "hot weather"], "text": "<p>Monsters University at Emagine theater in Woodhaven, MI was our first choice for a mother-son morning. First of all, I love this theater because they serve beer (and everything else) although I did not have a beer this time, it was a cool and refreshing respite from the heat wave, while giving B and I something to do on a steamy July morning. </p>\n<p>I followed a few simple suggestions from moms who&#8217;ve come before me, this is what they told me:<br />\n1. Choose a morning show time. (Most likely the crowd will be other kids who might be less likely to get bothered by toddler behavior.)<br />\n2. Arrive ten minutes (or more) after the posted show time to avoid the trailers. Most toddlers have a 90 minute max on their ability to sit still, even in this scenario.<br />\n3. Get your toddler a kid sized snack pack to hold, they will be mesmerized at least as long as the popcorn lasts.<br />\n4. Get the booster seat! B would&#8217;ve fallen through the crack in the seat if we hadn&#8217;t requested it. They are free but were not (hello, why not?!) at the entrance of Monsters University. B is a BIG two year old, and it was necessary for him. </p>\n<p>Even though B and I did not sit through the ending credits <em>like his dad and I would have</em>, we had a very nice morning. Was it perfect, <strong>no</strong>, of course not. Between potty breaks and pure silly&#8217;s we saw about 80% of the movie. But, for a first time out, I was proud if B <em>and me</em> for our results. </p>\n<p>Happy trails!! <em>(His dad and I went to see The Lone Ranger after that&#8230;alone</em>)</p>\n<p><a href=\"http://adventuresofadetroitfamily.files.wordpress.com/2013/07/20130715-134957.jpg\"><img src=\"https://adventuresofadetroitfamily.files.wordpress.com/2013/07/20130715-134957.jpg\" alt=\"20130715-134957.jpg\" class=\"alignnone size-full\" /></a></p>\n<p><a href=\"http://adventuresofadetroitfamily.files.wordpress.com/2013/07/20130715-135055.jpg\"><img src=\"https://adventuresofadetroitfamily.files.wordpress.com/2013/07/20130715-135055.jpg\" alt=\"20130715-135055.jpg\" class=\"alignnone size-full\" /></a></p>\n<p><a href=\"http://adventuresofadetroitfamily.files.wordpress.com/2013/07/20130715-135126.jpg\"><img src=\"https://adventuresofadetroitfamily.files.wordpress.com/2013/07/20130715-135126.jpg\" alt=\"20130715-135126.jpg\" class=\"alignnone size-full\" /></a></p>\n", "post_id": 70, "location": false, "date": "07-15-2013", "mentions": [], "extracted_features": {}}, {"tags": [], "text": "<p><a href='https://adventuresofadetroitfamily.wordpress.com/2013/07/15/toddlers-1st-movie-theater-experience/'>Toddler&#8217;s 1st Movie Theater Experience</a>.</p>\n", "post_id": 72, "location": false, "date": "07-16-2013", "mentions": [], "extracted_features": {}}, {"tags": [], "text": "<div class=\"wpcom-reblog-snapshot\"><div class=\"reblogger-note\"><p class=\"reblogger-headline\"><img alt='' src='https://0.gravatar.com/avatar/384b769726f6dc339fa4bffd8d5c3dae?s=32&#038;d=identicon&#038;r=G' class='avatar avatar-32' height='32' width='32' /><a href=\"http://adventuresofadetroitfamily.com/author/adventuresofadetroitfamily/\">DetroitFamilyFun</a>:</p><div class='reblogger-note-content'><blockquote><p>I love the ideas posted here. It&#8217;s not just about moving, but ANY stage/transition in your child&#8217;s life.\n<p>\n1. Welcoming a new sibling<br />\n2. Potty Training<br />\n3. Bed time routine<br />\n4. Starting daycare/preschool</p>\n</blockquote></div></div><div class=\"reblog-post\"><p class=\"reblog-from\"><img alt='' src='https://2.gravatar.com/avatar/21eed502b8edaaad614647bb349048e0?s=48&#038;d=identicon&#038;r=G' class='avatar avatar-48' height='48' width='48' />Originally posted on <a href=\"http://scienceofmom.com/2013/07/17/preparing-your-child-for-a-big-move-book-giveaway/\">Science of Mom</a>:</p><div class=\"reblogged-content\">\n<p>So, we’re moving this summer. At least, we think we are. The deal isn’t done yet, and we’re not even sure of our exact closing date, which is <em>maddening</em>. But probably, by the end of the summer, our little family will move to our first-ever, very-own home, just about a mile away from our current rental.</p>\n\n<p>Talking about a move with Cee has been interesting. She’s been coming to look at houses with us from the beginning, starting in February. We struggled to explain to her why we were spending so much time dragging her through empty houses. We talked about moving to a new house, and she just looked confused. “Why, Mama?” Why, indeed, would we want to leave the only home she likely remembers? (We moved from Arizona to Oregon when she was 7 months.) What could be better than <em>this</em> house, the place of warm memories…</p>\n</div><p class=\"reblog-source\"><a href=\"http://scienceofmom.com/2013/07/17/preparing-your-child-for-a-big-move-book-giveaway/\">View original</a> <span class=\"more-words\">2,301 more words</span></p></div></div>", "post_id": 74, "location": false, "date": "07-18-2013", "mentions": [], "extracted_features": {}}, {"tags": ["indoor playground", "toddler activity", "heat wave", "indoor toddler activity", "Pinterest"], "text": "<p>I like Pinterest. Just like I enjoy going on a shopping website, filling up my cart and then leaving the page. I just like the idea that I could if I wanted to, but have chosen not to. <em>At least that&#8217;s what I tell myself. </em></p>\n<p>\nAfter pages and <em>pages</em> of well organized &#8220;pins&#8221; on how to make a delicious-easy-family-meal-everyone-including-the-toddler-will-lick-off-the-plate-that-is-nutritious <em>and low in sodium </em> alongside creative bath activities to inspire your toddler to looooove getting that hard won dirt from their crevices, I just started using my own brain. I came up with a fun game of my own where I didn&#8217;t have to buy water beads, ivory soap or baking soda. </p>\n<p>\nWe are so lucky to have a local dairy still in business in our area that delivers their fresh milk to your door every week in glass bottles. I love, love, love them! Thank you Calder Dairy in Carleton, MI (I swear I have a point). The glass bottles are returned weekly, but the caps are not. So, of course I wash and save them. <em>All of those hours on Pinterest weren&#8217;t totally wasted, see</em>?! I also have a few plastic wash bins from the dollar store because my child looooves pouring water. W<em>ell, that&#8217;s what he calls it</em>. It could be called spilling, spitting or even spraying water by an onlooker, but, those are just semantics. I am trying to <del>delete</del> reduce screen time (rather abysmally) so I <em>try</em> to have <del>tasks</del> games readily available that B can engage in.\n<p>Here is my little game! My crappy handwriting and black magic marker in all its&#8217; glory! I used a ping pong ball (ummm, no I don&#8217;t have a ping pong table but I have been known to play a mean game of b___r  pong) and B loves throwing things as well, so I thought it would be a hit&#8230; I was correct!!\n<p>Points to consider:<br />\n1. If you get hit with a ping pong ball it doesn&#8217;t hurt nearly as much as getting hit with a golf ball.<br />\n2. You could write <em>any</em> thing (letters, draw shapes, colored dots or put pictures of family) on the bottom of any tray/bin with tape.<br />\n3. The fun part is throwing the ball and trying to &#8220;score&#8221; (which is what we yell when B sinks one). </p>\n<p><a href=\"http://adventuresofadetroitfamily.files.wordpress.com/2013/07/20130721-134156.jpg\"><img src=\"https://adventuresofadetroitfamily.files.wordpress.com/2013/07/20130721-134156.jpg\" alt=\"20130721-134156.jpg\" class=\"alignnone size-full\" /></a></p>\n<p><a href=\"http://adventuresofadetroitfamily.files.wordpress.com/2013/07/20130721-134206.jpg\"><img src=\"https://adventuresofadetroitfamily.files.wordpress.com/2013/07/20130721-134206.jpg\" alt=\"20130721-134206.jpg\" class=\"alignnone size-full\" /></a></p>\n<p>He&#8217;s learning how to recognize numbers up to twenty. The white and pink are divided into odd and even numbers although that is something we have yet to start talking about, I was being ambitious. </p>\n<p>What games have you and your toddler created?</p>\n", "post_id": 78, "location": false, "date": "07-21-2013", "mentions": [], "extracted_features": {}}, {"tags": ["water", "family", "toddler", "river", "detroit"], "text": "<p><a href=\"http://adventuresofadetroitfamily.files.wordpress.com/2013/07/20130722-004142.jpg\"><img src=\"https://adventuresofadetroitfamily.files.wordpress.com/2013/07/20130722-004142.jpg\" alt=\"20130722-004142.jpg\" class=\"alignnone size-full\" /></a></p>\n<p><a href=\"http://adventuresofadetroitfamily.files.wordpress.com/2013/07/20130722-004223.jpg\"><img src=\"https://adventuresofadetroitfamily.files.wordpress.com/2013/07/20130722-004223.jpg\" alt=\"20130722-004223.jpg\" class=\"alignnone size-full\" /></a></p>\n<p><a href=\"http://adventuresofadetroitfamily.files.wordpress.com/2013/07/20130722-004519.jpg\"><img src=\"https://adventuresofadetroitfamily.files.wordpress.com/2013/07/20130722-004519.jpg\" alt=\"20130722-004519.jpg\" class=\"alignnone size-full\" /></a></p>\n<p><a href=\"http://adventuresofadetroitfamily.files.wordpress.com/2013/07/20130722-004607.jpg\"><img src=\"https://adventuresofadetroitfamily.files.wordpress.com/2013/07/20130722-004607.jpg\" alt=\"20130722-004607.jpg\" class=\"alignnone size-full\" /></a>\n<p>\nA beautiful day for a boat ride! The hum of the engine acts as a lullaby while the summer breeze tickles the toes through flip-flops (or flippers, as B calls them). The gentle touch of a toddlers hand is the icing on the cake. Although other &#8220;rulers&#8221; may be <em>official</em> in the two countries we are balancing between, B is truly a prince today. </p>\n<p>As we slide through ancient glacial pathways that now separate two countries, one is tempted to think of those who swam, paddled and sunk in these depths. I am reminded of the constant <del>balance</del> battle between man and nature as a huge plume of steam rises from a smokestack along the rivers edge. </p>\n<p><a href=\"http://adventuresofadetroitfamily.files.wordpress.com/2013/07/20130722-013349.jpg\"><img src=\"https://adventuresofadetroitfamily.files.wordpress.com/2013/07/20130722-013349.jpg\" alt=\"20130722-013349.jpg\" class=\"alignnone size-full\" /></a>\n<p><em>The Detroit Princess Cruise line is NOT a sponsor nor did they compensate me in any way to take their cruise. I purchased a Groupon and took the chance on a sunny July day that my two year old could miss his nap and still  enjoy the river. </em> </p>\n<p><a href=\"http://adventuresofadetroitfamily.files.wordpress.com/2013/07/20130722-015007.jpg\"><img src=\"https://adventuresofadetroitfamily.files.wordpress.com/2013/07/20130722-015007.jpg\" alt=\"20130722-015007.jpg\" class=\"alignnone size-full\" /></a><br />\nFacts:<br />\nDaily outings at 1:00 and 3:30PM at Bishop Park in Wyandotte (behind the Henry Ford Hospital and Bacon Memorial Library) and a separate boat has the same schedule at Hart Plaza/ RiverWalk. All passengers are taken on a first come first served basis do try to arrive thirty minutes before boarding and be prepared to stand in line, even if you&#8217;ve purchased your tickets in advance.</p>\n<p>Good to know:<br />\nThe ramp (the gang plank?!) was too skinny to fit the stroller through so we had to &#8220;unload it&#8221;, fold it and carry kiddo and everything else on board. Once on board we could&#8217;ve stayed in the dining area but attempted going up on the covered deck. Found a nice shady wooden bench (relief) after braving metal stairs that were more like a ladder (yikes). The bathroom was much like you would find on an airplane, so diaper changes would need to be done &#8221; al fresco&#8221;. You can bring drinks and snacks on board for the 0-5 year olds but anyone 6+ better have cash on hand for anything else available at the bar.</p>\n<p>At $17 per person 6+ years old for a two hour cruise it&#8217;s a fine family value, though I&#8217;m glad I had a half off deal. </p>\n<p>\n<strong>Does your toddler love the water? If so, what water fun have you had this summer?</strong><em></em></p>\n", "post_id": 86, "location": false, "date": "07-22-2013", "mentions": [], "extracted_features": {}}, {"tags": ["water conservation", "toddler", "gardening", "rain barrel"], "text": "<p>My husband hates this monstrosity. He is only going along with my romantic idealism that having a rain barrel makes me a conservationist so I don&#8217;t bother him about buying more signage for his man cave (seriously, that&#8217;s another story all together). He drilled a hole into one of our gutters and now this massive barrel sits in wait for me to fill up my watering can seven times (yes, I counted) to water every single potted plant and herb in our yard <em>every</em> day. </p>\n<p>It would be much easier to use the hose, but I am stubborn and want to prove to my neighbors (a.k.a my in-laws) and my friends that I&#8217;m not just taking up valuable deck space with this thing but actually benefitting the earth. As I do this routine each night I offer B to hold the can and pour the water (you know, teach him how things grow). He was into it the first week or so, but two months in, he&#8217;s OUT. I&#8217;m beginning to wish I had just stuck with my original plan of paving my entire yard. </p>\n<p>I am hating my plants right now. They are so needy. I even had to beg someone to come over and water them when we went away for the weekend. I secretly hoped the person would forget and they would all die and I could be released of my nightly obligation. Why can&#8217;t I commune with nature? I want to be &#8220;earthy&#8221;, but I&#8217;d rather be doing almost ANYTHING else. I&#8217;m beginning to see the allure if that green grasslike indoor /outdoor carpeting. Am I losing my mind? </p>\n<p><a href=\"http://adventuresofadetroitfamily.files.wordpress.com/2013/07/20130727-031659.jpg\"><img src=\"https://adventuresofadetroitfamily.files.wordpress.com/2013/07/20130727-031659.jpg\" alt=\"20130727-031659.jpg\" class=\"alignnone size-full\" /></a></p>\n", "post_id": 90, "location": false, "date": "07-27-2013", "mentions": [], "extracted_features": {}}, {"tags": ["face plant", "scrape", "birthday", "toddler", "friends", "lollipop", "celebration"], "text": "<p><a href=\"http://adventuresofadetroitfamily.files.wordpress.com/2013/07/20130728-182121.jpg\"><img src=\"https://adventuresofadetroitfamily.files.wordpress.com/2013/07/20130728-182121.jpg\" alt=\"20130728-182121.jpg\" class=\"alignnone size-full\" /></a></p>\n<p>Size 8 toddler shoes (and toes) all around. The swing was full of laughter and crumbs, the best seat in the house! One of B&#8217;s friends has a little sister who invited us to her 1st birthday party, we were happy to join in the fun! Rain showers threatened and then dribbled but not for long. Every child there was eager to share the cake AND presents. The birthday song was the cutest chorus I&#8217;ve ever heard. It was a perfect backyard party, until&#8230;</p>\n<p><a href=\"http://adventuresofadetroitfamily.files.wordpress.com/2013/07/20130728-202551.jpg\"><img src=\"https://adventuresofadetroitfamily.files.wordpress.com/2013/07/20130728-202551.jpg\" alt=\"20130728-202551.jpg\" class=\"alignnone size-full\" /></a><br />\nB decided to wipe the patio with his face. I mean when does the instinct to put your hands out in front of you as you fall begin? I know toddlers are top heavy with their wobbly legs and balloon shaped noggins but, seriously!? Apparently he was playing with an excavator (no longer just a truck, these kids are specific and discerning) when he started to run to show it to someone and tripped. The excavator was completely unharmed in this incident. B on the other hand may be scarred for life. </p>\n<p>He cried one of those cries that starts out as long silent inhale, mouth agape, but ends up as a blood curdling horror film worthy screech. My heart dropped. I heard the thud of his over- sized head clunk the pavers like a ripe melon. After we calmed down and wiped him clean, all was well. One of the fathers there is a physician and examined B. No stitches or MRI&#8217;s needed, &#8220;just keep it clean and he&#8217;ll be fine&#8221;. In the end all he needed was a hug and a lollipop. I wish all troubles of the world could be as easily solved.</p>\n<p><em>Have you had any bad &#8220;ouchies&#8221; with your little one?</em><strong></strong></p>\n", "post_id": 96, "location": false, "date": "07-29-2013", "mentions": [], "extracted_features": {}}], "edges": [{"data": [19353748, 15132862, 33155700, 52393591, 33155700, 52393591, 15132862, 52393591, 20405278, 50904295, 52393591, 40672019, 52393591, 40672019, 52393591, 44105185, 52393591, 53377774, 52393591, 52817823, 35561114, 52393591, 37570515, 52393591, 37570515, 52393591, 27054937, 52393591, 51340287, 52393591, 53691311, 52393591, 52393591, 16385829, 16385829, 52393591, 8641800, 52393591, 51954026, 52393591, 16385829, 52393591, 16385829, 30852701, 52393591, 30852701, 53157031, 52393591, 52393591, 52195675, 36710303, 52393591, 31725419, 36710303, 52393591, 44981473, 52393591, 27945572, 52393591, 55869380, 52393591, 52393591, 55869380, 53881523, 52393591, 53881523, 16385829, 52393591, 16385829, 52393591, 52393591, 16385829, 0, 52393591, 56974632, 52393591, 56974632, 52393591, 0, 52393591, 2474435, 52393591, 6056917, 35561114, 52393591, 35561114, 52393591, 35561114, 35561114, 52393591, 35561114, 46548413, 52393591, 46548413, 52393591, 46548413, 52393591, 33155700, 52393591, 38408091, 35561114, 51455273, 52393591, 51455273, 52393591, 52766426], "type": "comment", "service": "wordpress"}, {"data": [15132862, 19353748, 22179465, 43872495, 46548413, 33155700, 49623478, 15132862, 46548413, 47278235, 52766426, 53989845, 46548413, 53946133, 15558484, 53946133, 7454139, 44105185, 49623478, 50904295, 35561114, 38048822, 46548413, 55869380, 27054937, 30458273, 36710303, 37570515, 47523426, 47780528, 50133489, 50904295, 51340287, 33155700, 44217386, 46548413, 50425941, 52491754, 52745616, 54783259, 9103265, 16385829, 22179465, 22634563, 33155700, 43872495, 44560433, 44839401, 46548413, 53377774, 53691311, 54629245, 56057403, 9273691, 16385829, 33155700, 33544430, 34864141, 42502970, 44923551, 53768025, 53881523, 54783259, 54783259, 618743, 7454139, 17195951, 27945572, 30852701, 33155700, 46548413, 49623478, 53881523, 10084311, 15558484, 15558856, 16385829, 30361232, 35302387, 36710303, 46548413, 53881523, 55447976, 57195852, 16385829, 27945572, 36710303, 53881523, 12897789, 27054937, 27945572, 30852701, 44839401, 44981473, 47238049, 54412775, 27945572, 41314973, 46548413, 52270889, 27945572, 29533196, 55869380, 66341722, 9523778, 26048408, 46548413, 51472981, 52074957, 52089846, 27054937, 33155700, 38853260, 43872495, 46548413, 53881523, 55869380, 56974632, 26048408, 27945572, 44560433, 46548413, 16385829, 33155700, 41903938, 56974632, 7359255, 29669578, 46548413, 47325008, 56974632, 27054937, 42289462, 46548413, 47325008, 54783259, 44442768, 44560433, 54783259, 56974632, 6056917, 36710303, 6056917, 20000118, 44560433, 55295907, 66795516, 6056917, 48364554, 6056917, 27945572, 39560649, 66795516, 68661776, 7359255, 17195951, 46548413, 66795516, 26048408, 52393591, 47237664, 39798142, 48099837, 49623478, 52074957, 52093199, 49623478, 52448184, 15790022, 20185121, 27902660, 48099837, 50826493, 6056917, 24434887, 29854770, 49623478, 52614680, 29854770, 35561114, 44442768, 46548413, 41903938, 46548413, 33155700, 35561114, 45777386, 46548413, 51455273, 46548413, 49623478], "type": "like", "service": "wordpress"}], "metadata": {"services": [{"username": "DetroitFamilyFun", "display_name": "adventuresofadetroitfamily", "service": "wordpress", "service_url": "https://wordpress.com/", "location": {"location_name": "Detroit, MI"}, "service_id": 52393591, "profile_url": "http://en.gravatar.com/adventuresofadetroitfamily"}]}}